AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t LAYER3YOFF : 16;           /*!< [15..0] Specify the pixel offset of the starting Y dimension
                                                     of layer 3                                                                */
      __IOM uint32_t LAYER3XOFF : 16;           /*!< [31..16] Specify the pixel offset of the starting X dimension
                                                     of layer 3                                                                */
    } LAYER3STARTXY_b;
  } ;

  union {
    __IOM uint32_t LAYER3SIZEXY;                /*!< (@ 0x00000098) X and Y size of layer 3.                                   */

    struct {
      __IOM uint32_t LAYER3PIXSZEY : 16;        /*!< [15..0] Specify the pixel size of the layer 3 in the Y dimension          */
      __IOM uint32_t LAYER3PIXSZEX : 16;        /*!< [31..16] Specify the pixel size of the layer 3 in the X dimension         */
    } LAYER3SIZEXY_b;
  } ;

  union {
    __IOM uint32_t LAYER3ADDR;                  /*!< (@ 0x0000009C) The start address of the framebuffer to be accessed
                                                                    by layer 3.                                                */

    struct {
      __IOM uint32_t LAYER3STARTADDRFBUF : 32;  /*!< [31..0] Specify the start address of framebuffer for each layer
                                                     3.                                                                        */
    } LAYER3ADDR_b;
  } ;

  union {
    __IOM uint32_t LAYER3STRIDE;                /*!< (@ 0x000000A0) Specify the stride and the AXI bus burst of layer
                                                                    3.                                                         */

    struct {
      __IOM uint32_t LAYER3STRIDEDIST : 16;     /*!< [15..0] Specify the stride, which is the distance from line
                                                     to line in bytes for each layer 3 memory                                  */
      __IOM uint32_t LAYER3AXIBURSTBITS : 3;    /*!< [18..16] Specify the AXI bits per burst in layer 3                        */
      __IOM uint32_t LAYER3AXIFIFOTHLD : 2;     /*!< [20..19] Specify the AXI fifo threshold burst start in layer
                                                     3                                                                         */
      __IOM uint32_t RSVD       : 11;           /*!< [31..21] This bitfield is reserved.                                       */
    } LAYER3STRIDE_b;
  } ;

  union {
    __IOM uint32_t LAYER3RESXY;                 /*!< (@ 0x000000A4) X and Y dimensions for the resolution of layer
                                                                    3.                                                         */

    struct {
      __IOM uint32_t LAYER3PIXRESY : 16;        /*!< [15..0] Specify the layer n pixel resolution in the Y dimension           */
      __IOM uint32_t LAYER3PIXRESX : 16;        /*!< [31..16] Specify the layer n pixel resolution in the X dimension          */
    } LAYER3RESXY_b;
  } ;

  union {
    __IOM uint32_t LAYER3SCALEX;                /*!< (@ 0x000000A8) Scale X factor of layer 3.                                 */

    struct {
      __IOM uint32_t LAYER3XFACTOR : 32;        /*!< [31..0] Specify the scale X factor of layer n (4.14 fixed point
                                                     number)                                                                   */
    } LAYER3SCALEX_b;
  } ;

  union {
    __IOM uint32_t LAYER3SCALE;                 /*!< (@ 0x000000AC) Scale Y factor of layer 3.                                 */

    struct {
      __IOM uint32_t LAYER3YFACTOR : 32;        /*!< [31..0] Specify the scale Y factor of layer n (4.14 fixed point
                                                     number)                                                                   */
    } LAYER3SCALE_b;
  } ;
  __IM  uint32_t  RESERVED2[14];

  union {
    __IOM uint32_t DBICMD;                      /*!< (@ 0x000000E8) Register to read/write commands from/to DBI Type-B
                                                                    interface.                                                 */

    struct {
      __IOM uint32_t DATA2DBI   : 16;           /*!< [15..0] Data to send to the DBI interface                                 */
      __IOM uint32_t RSVD0      : 11;           /*!< [26..16] This bitfield is reserved.                                       */
      __IOM uint32_t LOCALSTORE : 1;            /*!< [27..27] When set to 1, bits [15:0] are locally stored as base
                                                     address of the horizontal line; it is used along with the
                                                     DBI_CFG[17:16] register bits for the SPI interface                        */
      __IOM uint32_t READDBI    : 1;            /*!< [28..28] Read from DBI interface                                          */
      __IOM uint32_t RSVD1      : 1;            /*!< [29..29] This bitfield is reserved.                                       */
      __IOM uint32_t DIRECTDATA : 1;            /*!< [30..30] Send direct data of type 'command' to the DBI interface          */
      __IOM uint32_t RSVD2      : 1;            /*!< [31..31] This bitfield is reserved.                                       */
    } DBICMD_b;
  } ;

  union {
    __IOM uint32_t DBIRDAT;                     /*!< (@ 0x000000EC) Data read by DBI Type-B interface are stored
                                                                    in the DBI_RDAT register.                                  */

    struct {
      __IOM uint32_t READTYPEB  : 32;           /*!< [31..0] Read data from DBI Type-B interface                               */
    } DBIRDAT_b;
  } ;

  union {
    __IOM uint32_t CONFG;                       /*!< (@ 0x000000F0) Information of the layers n activation and setup.          */

