AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t CFGGLBGAMMAEN : 1;         /*!< [0..0] Indicates that Global Gamma/Palette is enabled                     */
      __IOM uint32_t CFGFCURSOREN : 1;          /*!< [1..1] Indicates that fixed cursor is enabled                             */
      __IOM uint32_t CFGPCURSOREN : 1;          /*!< [2..2] Indicates that programmable cursor is enabled                      */
      __IOM uint32_t CFGDITHEREN : 1;           /*!< [3..3] Indicates that dithering is enabled                                */
      __IOM uint32_t CFGFORMATTEN : 1;          /*!< [4..4] Indicates that formatting is enabled                               */
      __IOM uint32_t CFGYUVCNVTEN : 1;          /*!< [5..5] Indicates that high quality YUV converter is enabled               */
      __IOM uint32_t CFGDBITYPEBEN : 1;         /*!< [6..6] Indicates that DBI Type-B interface is enabled                     */
      __IOM uint32_t CFGRGB2YUVEN : 1;          /*!< [7..7] Indicates that RGB to YUV converter is enabled                     */
      __IOM uint32_t CFGLAYER0EN : 1;           /*!< [8..8] Indicates that layer 0 is enabled                                  */
      __IOM uint32_t CFGLAYER0BLENDER : 1;      /*!< [9..9] Indicates that layer 0 has blender                                 */
      __IOM uint32_t CFGLAYER0SCALAR : 1;       /*!< [10..10] Indicates that layer 0 has scaler                                */
      __IOM uint32_t CFGLAYER0GAMMALUT : 1;     /*!< [11..11] Indicates that layer 0 has gamma LUT                             */
      __IOM uint32_t CFGLAYER1EN : 1;           /*!< [12..12] Indicates that layer 1 is enabled                                */
      __IOM uint32_t CFGLAYER1BLENDER : 1;      /*!< [13..13] Indicates that layer 1 has blender                               */
      __IOM uint32_t CFGLAYER1SCALAR : 1;       /*!< [14..14] Indicates that layer 1 has scaler                                */
      __IOM uint32_t CFGLAYER1GAMMALUT : 1;     /*!< [15..15] Indicates that layer 1 has gamma LUT                             */
      __IOM uint32_t CFGLAYER2EN : 1;           /*!< [16..16] Indicates that layer 2 is enabled                                */
      __IOM uint32_t CFGLAYER2BLENDER : 1;      /*!< [17..17] Indicates that layer 2 has blender                               */
      __IOM uint32_t CFGLAYER2SCALAR : 1;       /*!< [18..18] Indicates that layer 2 has scaler                                */
      __IOM uint32_t CFGLAYER2GAMMALUT : 1;     /*!< [19..19] Indicates that layer 2 has gamma LUT                             */
      __IOM uint32_t CFGLAYER3EN : 1;           /*!< [20..20] Indicates that layer 3 is enabled                                */
      __IOM uint32_t CFGLAYER3BLENDER : 1;      /*!< [21..21] Indicates that layer 3 has blender                               */
      __IOM uint32_t CFGLAYER3SCALAR : 1;       /*!< [22..22] Indicates that layer 3 has scaler                                */
      __IOM uint32_t CFGLAYER3GAMMALUT : 1;     /*!< [23..23] Indicates that layer 3 has gamma LUT                             */
      __IOM uint32_t RSVD       : 8;            /*!< [31..24] This bitfield is reserved.                                       */
    } CONFG_b;
  } ;

  union {
    __IOM uint32_t IDREG;                       /*!< (@ 0x000000F4) Identification Register.                                   */

    struct {
      __IOM uint32_t DCID       : 32;           /*!< [31..0] Fixed value for DC ID                                             */
    } IDREG_b;
  } ;

  union {
    __IOM uint32_t INTERRUPT;                   /*!< (@ 0x000000F8) Register interrupts enabled, level or edge enabled.        */

    struct {
      __IOM uint32_t INTVSYNCEN : 1;            /*!< [0..0] When set to 1, VSYNC interrupt enabled                             */
      __IOM uint32_t INTHSYNCEN : 1;            /*!< [1..1] When set to 1, HSYNC interrupt enabled                             */
      __IOM uint32_t INTMMUERR  : 1;            /*!< [2..2] When set to 1, MMU error interrupt enabled                         */
      __IOM uint32_t INTTEEN    : 1;            /*!< [3..3] When set to 1, TE interrupt enabled                                */
            uint32_t            : 27;
      __IOM uint32_t INTTRIGGER : 1;            /*!< [31..31] Interrupt request trigger control                                */
    } INTERRUPT_b;
  } ;

  union {
    __IOM uint32_t STATUS;                      /*!< (@ 0x000000FC) DSI Status register (interrupt and pending activity)       */

    struct {
      __IOM uint32_t STATNOTBLANK : 1;          /*!< [0..0] Indicates that the controller is not in active vertical
                                                     blanking                                                                  */
      __IOM uint32_t STATDE     : 1;            /*!< [1..1] Indicates the DE signal status (0 or 1) at the current
                                                     time of reading                                                           */
      __IOM uint32_t STATHSYNC  : 1;            /*!< [2..2] Indicates the HSYNC signal status (0 or 1) at the current
                                                     time of reading                                                           */
      __IOM uint32_t STATVSYNC  : 1;            /*!< [3..3] Indicates the VSYNC signal status and the tearing e?ect
                                                     signal status (0 or 1) at the current time of reading                     */
      __IOM uint32_t STATCSYNC  : 1;            /*!< [4..4] Indicates the CSYNC signal status (0 or 1) at the current
                                                     time of reading                                                           */
      __IOM uint32_t STATLAST   : 1;            /*!< [5..5] Indicates that the last row is currently displayed                 */
      __IOM uint32_t STATUF     : 1;            /*!< [6..6] Indicates current underflow                                        */
      __IOM uint32_t STATSTICKY : 1;            /*!< [7..7] Indicates sticky underflow. This bit clears when interrupt
                                                     register is written                                                       */
      __IOM uint32_t STATTEAR   : 1;            /*!< [8..8] Indicates DBI Type-B tearing effect                                */
            uint32_t            : 1;
      __IOM uint32_t STATDBIRGB : 1;            /*!< [10..10] Indicates pending RGB data in DBI interface                      */
      __IOM uint32_t STATDBIPENDCOM : 1;        /*!< [11..11] Indicates pending commands in DBI interface                      */
      __IOM uint32_t STATDBIPENDTRANS : 1;      /*!< [12..12] Indicates pending output transaction in DBI interface            */
            uint32_t            : 19;
    } STATUS_b;
  } ;

  union {
    __IOM uint32_t COLMOD;                      /*!< (@ 0x00000100) Color mode status register indicating formats/back
                                                                    pressure are enabled.                                      */

