AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t DATALANES  : 3;            /*!< [2..0] The number Data lanes to be supported is programmed by
                                                     the processor                                                             */
      __IOM uint32_t CHNUMVM    : 2;            /*!< [4..3] Channel number for video mode                                      */
      __IOM uint32_t CHNUMCMODE : 2;            /*!< [6..5] Channel Number for command mode is programmed by the
                                                     processor                                                                 */
      __IOM uint32_t SUPCOLVIDMODE : 3;         /*!< [9..7] Supported colour format for video mode.                            */
            uint32_t            : 3;
      __IOM uint32_t REGNAME    : 3;            /*!< [15..13] FIXME - Bitfield description needed here.                        */
            uint32_t            : 16;
    } DSIFUNCPRG_b;
  } ;

  union {
    __IOM uint32_t HSTXTIMEOUT;                 /*!< (@ 0x00000010) Maximum duration allow for the DSi host to remain
                                                                    in High speed mode for transmission.                       */

    struct {
      __IOM uint32_t MAXDURTOCNT : 24;          /*!< [23..0] The maximum duration allowed for the DSI host to remain
                                                     in high speed mode for a transmission. If the counter expires,
                                                     processor is interrupted with HS_Tx_timeout interrupt                     */
            uint32_t            : 8;
    } HSTXTIMEOUT_b;
  } ;

  union {
    __IOM uint32_t LPRXTO;                      /*!< (@ 0x00000014) Timeout value to be checked for reverse communicationl     */

    struct {
      __IOM uint32_t TOCHKRVS   : 24;           /*!< [23..0] Timeout value to be checked for reverse communication.
                                                     If the counter expires, processor is interrupted with LP_Rx_timeout
                                                     interrupt.The timeout value is protocol specific. Time
                                                     out value is calculated from txclkesc(50ns).                              */
            uint32_t            : 8;
    } LPRXTO_b;
  } ;

  union {
    __IOM uint32_t TURNARNDTO;                  /*!< (@ 0x00000018) Timeout value to be checked after the DSI host
                                                                    makes a trun around in the direction of
                                                                    transfers.                                                 */

    struct {
      __IOM uint32_t TIMOUT     : 6;            /*!< [5..0] If the counter expires, processor is interrupted with
                                                     Turn_around_ack timeout interrupt; this specified period
                                                     shall be longer then the maximum possible turnaround delay
                                                     for the unit to which the turnaround request was sent,
                                                     which is 23 clock cycles of txclkesc; any number greater
                                                     than or equal to 23 is an acceptable number.                              */
            uint32_t            : 26;
    } TURNARNDTO_b;
  } ;

  union {
    __IOM uint32_t DEVICERESETTIMER;            /*!< (@ 0x0000001C) Timeout value to be checked for device to be
                                                                    reset after issuing reset entry command                    */

    struct {
      __IOM uint32_t TIMOUT     : 16;           /*!< [15..0] If the timer expires the DSI Host enters normal operation;
                                                     This time out value is used while contention recovery procedure;
                                                     the time out value is equal to a value longer than the
                                                     specified time required to complete the reset sequence                    */
            uint32_t            : 16;
    } DEVICERESETTIMER_b;
  } ;

  union {
    __IOM uint32_t DPIRESOLUTION;               /*!< (@ 0x00000020) Shows the horizontal address count in pixels               */

    struct {
      __IOM uint32_t DPIRESOLUTION : 32;        /*!< [31..0] TODO: update this register description                            */
    } DPIRESOLUTION_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t HSYNCCNT;                    /*!< (@ 0x00000028) Shows the horizontal sync value in terms of byte
                                                                    clock.                                                     */

    struct {
      __IOM uint32_t HORZCNT    : 16;           /*!< [15..0] rw 0000h Shows the horizontal sync value in terms of
                                                     byte clock (txbyteclkhs); Minimum HSA period should be
                                                     sufficient to transmit a Hsync start short packet(4 bytes)
                                                     i) For Non-burst Mode with sync pulse, Min value - 4 in
                                                     decimal (plus an optional 6 bytes for a zero payload blanking
                                                     packet); But if the value is less than 10 but more than
                                                     4, then this count will be added to the HBP's count for
                                                     one lane; ii) For Non-Burst Sync Event and Burst Mode,
                                                     there is no HSA, so you can program this to zero. If you                  */
            uint32_t            : 16;
    } HSYNCCNT_b;
  } ;

  union {
    __IOM uint32_t HORIZBKPORCHCNT;             /*!< (@ 0x0000002C) Shows the horizontal back porch value in terms
                                                                    of txbyteclkhs.                                            */

