AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< [0..0] This field provides the reset (enable) to the DFE.                 */
            uint32_t            : 31;
    } RSTENBDFE_b;
  } ;

  union {
    __IOM uint32_t AFETRIM0;                    /*!< (@ 0x00000078) Afe Trim reg0                                              */

    struct {
      __IOM uint32_t AFETRIM0   : 32;           /*!< [31..0] Afe Trim reg0.                                                    */
    } AFETRIM0_b;
  } ;

  union {
    __IOM uint32_t AFETRIM1;                    /*!< (@ 0x0000007C) Afe Trim reg1                                              */

    struct {
      __IOM uint32_t AFETRIM1   : 32;           /*!< [31..0] Afe Trim reg1.                                                    */
    } AFETRIM1_b;
  } ;

  union {
    __IOM uint32_t AFETRIM2;                    /*!< (@ 0x00000080) Afe Trim reg2                                              */

    struct {
      __IOM uint32_t AFETRIM2   : 32;           /*!< [31..0] Afe Trim reg2.                                                    */
    } AFETRIM2_b;
  } ;

  union {
    __IOM uint32_t AFETRIM3;                    /*!< (@ 0x00000084) Afe Trim reg3                                              */

    struct {
      __IOM uint32_t AFETRIM3   : 32;           /*!< [31..0] Afe Trim reg3.                                                    */
    } AFETRIM3_b;
  } ;
  __IM  uint32_t  RESERVED1[4];

  union {
    __IOM uint32_t ERRORAUTORCOV;               /*!< (@ 0x00000098) Errir ayti recivert register                               */

    struct {
      __IOM uint32_t ECCMULERRCLR : 1;          /*!< [0..0] if this bit is set to 1, Ecc_mul_err_clr error recovery
                                                     action is taken immediately by DSI TX                                     */
      __IOM uint32_t INVLDDTCLR : 1;            /*!< [1..1] If this bit is set to 1, Invld_dt_clr error recovery
                                                     action is taken immediately by DSI TX                                     */
      __IOM uint32_t HICONTCLR  : 1;            /*!< [2..2] If this bit is set to 1, Hi_cont_clr error recover action
                                                     is taken immediately by DSI TX                                            */
      __IOM uint32_t LOCONTCLR  : 1;            /*!< [3..3] If this bit is set to 1, lo_cont_clr error recovery action
                                                     is taken immediately by DSI TX                                            */
      __IOM uint32_t HSRXTIMEOUTCLR : 1;        /*!< [4..4] If this bit is set to 1, Hs_rx_timeout_clr error recovery
                                                     action is taken immediately by DSI TX                                     */
      __IOM uint32_t LPRXTIMEOUTCLR : 1;        /*!< [5..5] If this bit is set to 1, lp_rx_timeout_clr error recovery
                                                     action is taken immediately by DSI TX                                     */
            uint32_t            : 26;
    } ERRORAUTORCOV_b;
  } ;

  union {
    __IOM uint32_t MIPIDIRDPIDIFF;              /*!< (@ 0x0000009C) Mipi direction DPI difference                              */

    struct {
      __IOM uint32_t MIPIDIR    : 1;            /*!< [0..0] This field provides the direction of MIPI bus;                     */
            uint32_t            : 14;
      __IOM uint32_t DPIHIGH    : 1;            /*!< [15..15] This field provides information to check DPI line time
                                                     is greater or DSI line time is greater                                    */
      __IOM uint32_t DPIDIFF    : 16;           /*!< [31..16] This field provides the difference in one line time
                                                     between DPI and DSI                                                       */
    } MIPIDIRDPIDIFF_b;
  } ;

  union {
    __IOM uint32_t DATALANEPOLSWAP;             /*!< (@ 0x000000A0) Data lane polarity swap register                           */

    struct {
      __IOM uint32_t DATALNPOLSWAP : 4;         /*!< [3..0] Data lane Polarity sw                                              */
            uint32_t            : 28;
    } DATALANEPOLSWAP_b;
  } ;
} DSI_Type;                                     /*!< Size = 164 (0xa4)                                                         */



/* =========================================================================================================================== */
/* ================                                          DSPI2S0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief IO Peripheral Master (DSPI2S0)
  */

typedef struct {                                /*!< (@ 0x50428000) DSPI2S0 Structure                                          */

  union {
    __IOM uint32_t FIFO;                        /*!< (@ 0x00000000) Provides direct random access to both input and
                                                                    output fifos. The state of the FIFO is not
                                                                    distured by reading these locations (ie
                                                                    no POP will be done). FIFO0 is accessible
                                                                    from addresses 0x0 - 0x1C, and is used for
                                                                    data outuput from the IOM to external devices.
                                                                    These FIFO locations can be read and written
                                                                    directly.FIFO locations 0x20 - 0x3C provide
                                                                    read only access to the input fifo. These
                                                                    FIFO locations cannot be directly written
                                                                    by the MCU, and are updated only by the
                                                                    internal hardware.                                         */

