AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t IBAINCLUDE : 1;            /*!< [0..0] Include I3C Broadcast Address This bit controls whether
                                                     the I3C broadcast address (0x7E) is included for private
                                                     transfers. If the I3C broadcast address is not included
                                                     for private transfers, then IBIs driven from Slaves might
                                                     not win the arbitration, potentially delaying acceptance
                                                     of the IBIs. Values: 0x0 Do not include I3C Broadcast Address
                                                     for Private Transfers 0x1 Include I3C Broadcast Address
                                                     for Private Transfers Table 4 :HC Control Register Fields                 */
            uint32_t            : 6;
      __IOM uint32_t I2CSLAVEPRESENT : 1;       /*!< [7..7] I C Slave Present on Bus 2 Indicates whether or not any
                                                     Legacy I C Devices are present on the I3C Bus. Whenever
                                                     this bit is set, the Host Controller shall use the HDR-TSL
                                                     protocol (Ternary Symbol Legacy Inclusive Bus) for HDR-
                                                     TS Transfers. The specific mode of the transfer (SDR, DDR,
                                                     HDR-TS) is controlled on a per-Command basis. The Host
                                                     Controller shall use this field to select either TSL (1'b1)
                                                     or TSP (1'b0) for HDR-TS transfers. Values: 0x0 DISABLED
                                                     Legacy inclusive bus mode disabled 0x1 ENABLED Legacy                     */
      __IOM uint32_t HOTJOINCTRL : 1;           /*!< [8..8] Hot-Join ACK/NACK Control This bit acts as global control
                                                     to either ACK (1'b0) or NACK will be followed by the broadcast
                                                     CCC to disable Hot-Join. (1'b1) all Hot-Join Requests arriving
                                                     from the Devices on the I3C Bus. If set to NACK (1'b1),
                                                     then the NACK Values: 0x0 ACK ACK the Hot-Join request
                                                     0x1 NACK NACK and send broadcast CCC to disable Hot-Join                  */
            uint32_t            : 20;
      __IOM uint32_t ABORT      : 1;            /*!< [29..29] Host Controller Abort When set to 1, this bit allows
                                                     the Host Controller to relinquish control of the I3C Bus
                                                     before completing the currently issued transfer. In response
                                                     to an ABORT request, the Host Controller issues the STOP
                                                     condition on the I3C Bus after the complete data byte is
                                                     transferred or received. The Driver shall clear the ABORT
                                                     bit to allow operation on the Bus. Values: 0x0 RUNNING
                                                     Host Controller Running 0x1 ABORTED Host Controller Aborted               */
      __IOM uint32_t RESUME     : 1;            /*!< [30..30] Host Controller Resume This bit is used to resume Host
                                                     Controller operation following the Halt state. The Host
                                                     Controller enters the Halt state (as indicated in register
                                                     PRESENT_STATE) as a result of any type of error occurring
                                                     in a transfer. The error type is indicated by the field
                                                     ERR_STATUS in register RESPONSE_QUEUE_PORT). After the
                                                     Host Controller has entered the Halt state, the application
                                                     must write the value 1'b1 to the RESUME bit to resume Host
                                                     Controller operation. The Host Controller shall auto-                     */
      __IOM uint32_t BUSENABLE  : 1;            /*!< [31..31] Host Controller Bus Enable Enables or disables the
                                                     operation on the I3C Bus by the Host Controller. If the
                                                     software sets this bit, then it also confirms that initialization
                                                     is done, and that the Host Controller can use the programmed
                                                     register values (e.g., generation of SCL on IBI detection,
                                                     etc.). If this bit is not set, then the Host Controller
                                                     shall not generate SCL for incoming IBI. Software may disable
                                                     the Host Controller bus operation while it is active, However,
                                                     if a disable request occurs while rec                                     */
    } HCCONTROL_b;
  } ;

  union {
    __IOM uint32_t DEVICEADDR;                  /*!< (@ 0x00000008) DEVICE_ADDR                                                */

    struct {
            uint32_t            : 16;
      __IOM uint32_t DYNAMICADDR : 7;           /*!< [22..16] Device Dynamic Address. This field is used to program
                                                     the Device Dynamic Address. The Controller uses this address
                                                     to respond to the Master Transactions in I3C Interface
                                                     Mode (Slave or Secondary Master role). In Main Master mode,
                                                     the software has to program the Dynamic Address through
                                                     the Slave interface as it self- assigns its Dynamic Address.
                                                     In all other modes, the Main Master assigns this address
                                                     during ENTDAA or SETDASA mechanism.                                       */
            uint32_t            : 8;
      __IOM uint32_t DYNAMICADDRVALID : 1;      /*!< [31..31] Dynamic Address Valid                                            */
    } DEVICEADDR_b;
  } ;

  union {
    __IOM uint32_t HCCAPABILITIES;              /*!< (@ 0x0000000C) HC_CAPABILITIES                                            */

