AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
            uint32_t            : 2;
      __IOM uint32_t COMBOCOMMAND : 1;          /*!< [2..2] Defines whether Host Controller supports Combo Command
                                                     Transfers Values: 0x0 DISABLED Combo Transfer is not supported
                                                     0x1 ENABLED Combo Transfer is supported                                   */
      __IOM uint32_t AUTOCOMMAND : 1;           /*!< [3..3] Defines whether the Host Controller supports Auto- Command
                                                     functionality. Values: 1'b0: DISABLED: Auto-Command is
                                                     not supported 1'b1: ENABLED: Auto-Command is supported                    */
            uint32_t            : 1;
      __IOM uint32_t NONCURRENTMASTERCAP : 1;   /*!< [5..5] Defines whether the Host Controller supports handoff
                                                     of the Current Master role to another Device on the I3C
                                                     Bus. Values: 1'b0: DISABLED: Not capable of acting as Non-
                                                     Current Master: ENABLED: Capable acting as Non-Current
                                                     Master                                                                    */
      __IOM uint32_t HDRDDREN   : 1;            /*!< [6..6] Defines whether Host Controller supports HDR-DDR transfers.
                                                     Values: 0x0 DISABLED HDR-DDR not supported 0x1 ENABLED
                                                     HDR-DDR supported                                                         */
      __IOM uint32_t HDRTSEN    : 1;            /*!< [7..7] Defines whether Host Controller supports HDR-TS transfers.
                                                     Values: 0x0 DISABLED HDR-TS not supported 0x1 ENABLED HDR-TS
                                                     supported                                                                 */
            uint32_t            : 24;
    } HCCAPABILITIES_b;
  } ;

  union {
    __IOM uint32_t RESETCTRL;                   /*!< (@ 0x00000010) RESET_CTRL                                                 */

    struct {
      __IOM uint32_t SOFTRST    : 1;            /*!< [0..0] Core Software Reset On Driver setting this bit to 1'b1,
                                                     the Host Controller shall be reset and disabled. All registers
                                                     shall return to their reset values, and the software shall
                                                     re-initialize the Controller. This field is cleared automatically
                                                     upon Host Controller reset completion. This field also
                                                     resets all Queues in the Host Controller. This field does
                                                     not reset any Ring Headers in the Host Controller. Note:
                                                     Programming this field while it contains a value of 1'b1
                                                     may result in undefined behavior.                                         */
      __IOM uint32_t CMDQUEUERST : 1;           /*!< [1..1] Command Queue Software Reset On software setting this
                                                     bit to 1'b1, the Command Queues in the Controller shall
                                                     be flushed. This field shall be cleared automatically upon
                                                     Command Queue reset completion. This field is valid for
                                                     PIO Mode only.                                                            */
      __IOM uint32_t RESPQUEUERST : 1;          /*!< [2..2] Response Queue Software Reset On software setting this
                                                     bit to 1'b1, the Response Queues in the Controller shall
                                                     be flushed. This field shall be cleared automatically upon
                                                     Response Queue reset completion. This field is valid for
                                                     PIO Mode only.                                                            */
      __IOM uint32_t TXFIFORST  : 1;            /*!< [3..3] Transmit Queue Buffer Software Reset On software setting
                                                     this bit to 1'b1, the Tx Queues in the Controller shall
                                                     be flushed. This field shall be cleared automatically upon
                                                     Tx Data Queue reset completion. This field is valid for
                                                     PIO Mode only.                                                            */
      __IOM uint32_t RXFIFORST  : 1;            /*!< [4..4] Receive Queue Buffer Software Reset On software setting
                                                     this bit to 1'b1, the Rx Queues in the Controller shall
                                                     be flushed. This field shall be cleared automatically upon
                                                     completion of Rx Data Queue reset. This field is valid
                                                     for PIO Mode only.                                                        */
      __IOM uint32_t IBIQUEUERST : 1;           /*!< [5..5] IBI Queue Buffer Software Reset On software setting this
                                                     bit to 1'b1, the IBI Queues in the Controller shall be
                                                     flushed. This field shall be cleared automatically upon
                                                     completion of IBI Queue reset. This field is valid for
                                                     PIO Mode only.                                                            */
            uint32_t            : 26;
    } RESETCTRL_b;
  } ;

  union {
    __IOM uint32_t PRESENTSTATE;                /*!< (@ 0x00000014) PRESENT_STATE                                              */

