AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
            uint32_t            : 2;
      __IOM uint32_t CURRENTMASTER : 1;         /*!< [2..2] This Bit is used to check whether the Master is Current
                                                     Master or not. The Current Master is the master one who
                                                     owns the SCL line. If this bit is set to 0, the master
                                                     is not current master and requires to request and the ownership
                                                     before initiating any transfer on the line. If this bit
                                                     is set to 1, the master is the current master and can initiate
                                                     the transfers on the line. TBD Note: Default value shall
                                                     be 1?                                                                     */
            uint32_t            : 29;
    } PRESENTSTATE_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t INTRSTATUS;                  /*!< (@ 0x00000020) INTR_STATUS                                                */

    struct {
            uint32_t            : 10;
      __IOM uint32_t HCINTERNALERRSTAT : 1;     /*!< [10..10] Host Controller Internal Error Reflects the interrupt
                                                     status that is populated based on any non-recoverable internal
                                                     error of the Host Controller                                              */
            uint32_t            : 21;
    } INTRSTATUS_b;
  } ;

  union {
    __IOM uint32_t INTRSTATUSENABLE;            /*!< (@ 0x00000024) INTR_STATUS_ENABLE                                         */

    struct {
            uint32_t            : 10;
      __IOM uint32_t HCINTERNALERRSTATEN : 1;   /*!< [10..10] Enables the corresponding interrupt bit. When Set to
                                                     1'b1, HC_INTERNAL_ERR_STATUS shall be logged.                             */
            uint32_t            : 21;
    } INTRSTATUSENABLE_b;
  } ;

  union {
    __IOM uint32_t INTRSIGNALENABLE;            /*!< (@ 0x00000028) INTR_SIGNAL_ENABLE                                         */

    struct {
            uint32_t            : 10;
      __IOM uint32_t HCINTERNALERRSIGNALEN : 1; /*!< [10..10] When set to 1'b1 and register HC_INTERNAL_ERR_STATUS
                                                     is set, the hardware Controller asserts an interrupt to
                                                     the Host.                                                                 */
            uint32_t            : 21;
    } INTRSIGNALENABLE_b;
  } ;

  union {
    __IOM uint32_t INTRFORCE;                   /*!< (@ 0x0000002C) INTR_FORCE                                                 */

    struct {
            uint32_t            : 10;
      __IOM uint32_t HCINTERNALERRFORCE : 1;    /*!< [10..10] For debug, helps to force this interrupt.                        */
            uint32_t            : 21;
    } INTRFORCE_b;
  } ;

  union {
    __IOM uint32_t DATSECTIONOFFSET;            /*!< (@ 0x00000030) DAT_SECTION_OFFSET                                         */

    struct {
      __IOM uint32_t TABLEOFFSET : 12;          /*!< [11..0] DAT Table Offset Offset of the DAT relative to the BASE
                                                     address of the current HCI. If the Host Controller does
                                                     not support implementing the DAT in registers (thereby
                                                     forcing the Software to provide the Device Context in memory),
                                                     then it should indicate this by setting this field to 12h000.             */
      __IOM uint32_t TABLESIZE  : 7;            /*!< [18..12] DAT Table Size Size of the DAT, in DWORDs.                       */
            uint32_t            : 13;
    } DATSECTIONOFFSET_b;
  } ;

  union {
    __IOM uint32_t DCTSECTIONOFFSET;            /*!< (@ 0x00000034) DCT_SECTION_OFFSET                                         */

    struct {
      __IOM uint32_t TABLEOFFSET : 12;          /*!< [11..0] DCT Table Offset Offset of the DCT relative to the BASE
                                                     address of the current HCI. If the Host Controller does
                                                     not support implementing the DCT in registers, thereby
                                                     forcing the Software to provide the Device Context, then
                                                     it should indicate this by providing this field to 12h000.                */
      __IOM uint32_t TABLESIZE  : 7;            /*!< [18..12] DCT Table Size Size of the DCT, in DWORDs.                       */
      __IOM uint32_t TABLEINDEX : 5;            /*!< [23..19] DCT Table Index Current index of the DCT, which is
                                                     used as the starting index for the I3C ENTDAA CCC. Once
                                                     the complete characteristics of device that won the arbitration
                                                     are written to the DCT (during ENTDAA using Address Assignment
                                                     Command) this index is incremented by 1. If needed, the
                                                     software may override starting DCT index by setting this
                                                     field.                                                                    */
            uint32_t            : 8;
    } DCTSECTIONOFFSET_b;
  } ;

  union {
    __IOM uint32_t RINGHEADERSSECTIONOFFSET;    /*!< (@ 0x00000038) RING_HEADERS_SECTION_OFFSET                                */

