AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t SECTIONOFFSET : 16;        /*!< [15..0] Offset of Ring Headers section relative to BASE address
                                                     (RH_BASE). Value of 0 indicates section is not implemented.
                                                     TBD Note: Reset value shall be HC implementation specific
                                                     Table 15 : Ring Headers Section Offset Register Fields                    */
            uint32_t            : 16;
    } RINGHEADERSSECTIONOFFSET_b;
  } ;

  union {
    __IOM uint32_t PIOSECTIONOFFSET;            /*!< (@ 0x0000003C) PIO_SECTION_OFFSET                                         */

    struct {
      __IOM uint32_t SECTIONOFFSET : 16;        /*!< [15..0] Offset of PIO section relative to BASE address (PIO_BASE).
                                                     Value of 0 indicates section is not implemented. TBD Note:
                                                     Reset value shall be HC implementation specific Table 16
                                                     : PIO Section Offset Register Fields                                      */
            uint32_t            : 16;
    } PIOSECTIONOFFSET_b;
  } ;

  union {
    __IOM uint32_t EXTCAPSSECTIONOFFSET;        /*!< (@ 0x00000040) EXTCAPS_SECTION_OFFSET                                     */

    struct {
      __IOM uint32_t SECTIONOFFSET : 16;        /*!< [15..0] Extended Capabilities Section Offset Offset of the Extended
                                                     Capabilities registers section of the register map, relative
                                                     to the BASE address of the current HCI. A value of 0 in
                                                     this field indicates that the Extended Capabilities section
                                                     is not implemented.                                                       */
            uint32_t            : 16;
    } EXTCAPSSECTIONOFFSET_b;
  } ;
  __IM  uint32_t  RESERVED1[5];

  union {
    __IOM uint32_t IBINOTIFYCTRL;               /*!< (@ 0x00000058) IBI_NOTIFY_CTRL                                            */

    struct {
      __IOM uint32_t NOTIFYHJREJECTED : 1;      /*!< [0..0] Notify Rejected Hot-Join Control Enables or disables
                                                     reporting rejection of individual Hot Join requests. Values:
                                                     1'b0: DISABLED: Do not pass rejected IBI Status to IBI
                                                     Queue, if the incoming Hot- Join request is NACKed and
                                                     is auto- disabled based on field HOT_JOIN_CTRL of HC_CONTROL.
                                                     1'b1: ENABLED: Pass rejected IBI Status to the IBI Queue,
                                                     if the incoming Hot Join request is NACKed and is auto-disabled
                                                     based on field HOT_JOIN_CTRL of HC_CONTROL.                               */
      __IOM uint32_t NOTIFYMRREJECTED : 1;      /*!< [1..1] Notify Rejected Master Request Control Enables or disables
                                                     reporting rejection of individual Master Requests. Values:
                                                     1'b0: DISABLED: Do not pass rejected IBI Status to IBI
                                                     Queue/Ring, if the incoming Master Request is NACKed and
                                                     is auto- disabled based on MR_REJECT field in relevant
                                                     DAT entry. 1'b1: ENABLED: Pass rejected IBI Status to the
                                                     IBI Queue, if the incoming Master Request is NACKed and
                                                     is auto-disabled based on MR_REJECT field in relevant DAT
                                                     entry.                                                                    */
            uint32_t            : 1;
      __IOM uint32_t NOTIFYSIRREJECTED : 1;     /*!< [3..3] Notify Rejected Slave Interrupt Request Control Enables
                                                     or disables reporting rejection of individual Slave Interrupt
                                                     Requests (SIR). Values: 1'b0: DISABLED: Do not pass rejected
                                                     IBI Status to the IBI Queue/Rings, if the incoming SIR
                                                     is NACKed and is auto- disabled based on SIR_REJECT field
                                                     in relevant DAT entry. 1'b1: ENABLED: Pass rejected IBI
                                                     Status to the IBI Queue/Rings, if the incoming SIR is NACKed
                                                     and is auto-disabled based on SIR_REJECT field in relevant
                                                     DAT entry.                                                                */
            uint32_t            : 28;
    } IBINOTIFYCTRL_b;
  } ;
  __IM  uint32_t  RESERVED2[105];

  union {
    __IOM uint32_t DAT0;                        /*!< (@ 0x00000200) Device Address Table 0                                     */

    struct {
      __IOM uint32_t STATICADDRESS : 7;         /*!< [6..0] Device Static Address 2 I3C / I C Static Address                   */
            uint32_t            : 5;
      __IOM uint32_t IBIPAYLOAD : 1;            /*!< [12..12] Device IBI Payload Indicates whether IBIs from this
                                                     Device have a Data Payload. This field reflects the IBI
                                                     Payload bit in the Devices Bus Characteristics Register
                                                     (BCR). During IBI handling for this Device, the Master
                                                     shall use this field to determine whether or not to drive
                                                     reception of the IBI Data Payload. Data continuation is
                                                     indicated by the T-Bit. Values: 1'b0: NO_PAYLOAD: IBIs
                                                     from this Device do not carry a Data Payload 1'b1: PAYLOAD:
                                                     IBIs from this Device do carry a Data Payload                             */
      __IOM uint32_t SIRREJECT  : 1;            /*!< [13..13] Device In-Band Slave Interrupt Request Reject Controls
                                                     whether this Device, when operating in the Master role,
                                                     will accept vs. reject Slave Interrupt Requests from other
                                                     Devices. Values: 1'b0: ACCEPT: This Device shall ACK the
                                                     SIR 1'b1: REJECT: This Device shall NACK the SIR and send
                                                     the auto-disable CCC                                                      */
      __IOM uint32_t MRREJECT   : 1;            /*!< [14..14] Device In-Band Master Request Reject Controls whether
                                                     this Device, when operating in the Master role, will accept
                                                     vs. reject Master requests from other Devices. This bit
                                                     is only valid if the Host Controller declares Non-Current
                                                     Master Capability. Values: 1'b0: ACCEPT: This Device shall
                                                     ACK Master Requests 1'b1: REJECT: This Device shall NACK
                                                     Master Requests and send the auto- disable command                        */
      __IOM uint32_t TS         : 1;            /*!< [15..15] Device IBI Timestamp Enables or disables IBI timestamping
                                                     for a specific Device. Note: The IBI Status Descriptor
                                                     for each IBI event indicates whether or not the individual
                                                     IBI event was actually timestamped. Values: 1'b0: NO_TS:
                                                     The Master shall not timestamp IBIs from this Device with
                                                     Master Timestamps 1'b1: TS: The Master shall timestamp
                                                     IBIs for this Device with Master Timestamps                               */
      __IOM uint32_t DYNAMICADDRESS : 8;        /*!< [23..16] Device I3C Dynamic Address Bit 23 is the Parity Bit,
                                                     per the I3C Specification Error! Reference source not found.
                                                     at Section 5.1.4.2, computed and updated by the software
                                                     Driver.                                                                   */
            uint32_t            : 2;
      __IOM uint32_t RINGID     : 3;            /*!< [28..26] Device Ring Group ID Used to send an IBI from a specific
                                                     Device to the appropriate Ring Bundle.                                    */
      __IOM uint32_t DEVNACKRETRYCNT : 2;       /*!< [30..29] Device NACK Retry Count Device-specific retry count              */
      __IOM uint32_t DEVICE     : 1;            /*!< [31..31] Device Type Values: 0x0: I3C: I3C Device 0x1: I C:
                                                     I C Device 2 2                                                            */
    } DAT0_b;
  } ;

  union {
    __IOM uint32_t DAT1;                        /*!< (@ 0x00000204) Device Address Table 1                                     */

