AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t AUTOCMDMASK : 8;           /*!< [7..0] Device Auto-Command Mask Mask for the IBI Mandatory Byte
                                                     that will trigger an Auto-Command Read transaction on the
                                                     I3C Bus.                                                                  */
      __IOM uint32_t AUTOCMDVALUE : 8;          /*!< [15..8] Device Auto-Command IBI Mandatory Byte Value Value of
                                                     the IBI Mandatory Byte that will trigger an Auto-Command
                                                     Read transaction on the I3C Bus                                           */
      __IOM uint32_t AUTOCMDMODE : 3;           /*!< [18..16] Device Auto-Command Mode Indicates the mode and speed
                                                     for the Auto- Command Read. This field is only valid for
                                                     the Device in I3C Mode (see the DEVICE field in the DAT
                                                     Table entry indexed by field DEV_INDEX). Values for I3C
                                                     Mode: 0x0: I3C SDR0 Standard SDR Speed, fSCL Max (12.5MHz)
                                                     0x1: I3C SDR1 8 MHz sustainable data rate 0x2: I3C SDR2
                                                     6 MHz sustainable data rate 0x3: I3C SDR3 4 MHz sustainable
                                                     data rate 0x4: I3C SDR4 2 MHz sustainable data rate 0x5:
                                                     I3C HDR-TS HDR-Ternary Mode. Selection of HDR- TSP                        */
      __IOM uint32_t AUTOCMDHDRCODE : 8;        /*!< [26..19] Device Auto-Command HDR Command Code Specifies Auto-Command
                                                     Read Command Code. Only valid if Read is executed in HDR
                                                     Mode. If value is below 0x80, then the Host Controller
                                                     shall use 0x80 for HDR Command Code.                                      */
            uint32_t            : 5;
    } DAT1_b;
  } ;
  __IM  uint32_t  RESERVED3[62];

  union {
    __IOM uint32_t DCT0;                        /*!< (@ 0x00000300) Device Characteristics Table 0                             */

    struct {
      __IOM uint32_t PID        : 32;           /*!< [31..0] Device Provisional ID High Bits [48:16] of Devices I3C
                                                     PID.                                                                      */
    } DCT0_b;
  } ;

  union {
    __IOM uint32_t DCT1;                        /*!< (@ 0x00000304) Device Characteristics Table 1                             */

    struct {
      __IOM uint32_t PID        : 16;           /*!< [15..0] Device Provisional ID Low Bits [15:0] of Devices I3C
                                                     PID.                                                                      */
            uint32_t            : 16;
    } DCT1_b;
  } ;

  union {
    __IOM uint32_t DCT2;                        /*!< (@ 0x00000308) Device Characteristics Table 2                             */

    struct {
      __IOM uint32_t DCR        : 8;            /*!< [7..0] Device DCR Value of Devices I3C Device Characteristics
                                                     Register.                                                                 */
      __IOM uint32_t BCR        : 8;            /*!< [15..8] Device BCR Value of Devices I3C Bus Characteristics
                                                     Register.                                                                 */
            uint32_t            : 16;
    } DCT2_b;
  } ;

  union {
    __IOM uint32_t DCT3;                        /*!< (@ 0x0000030C) Device Characteristics Table 3                             */

    struct {
      __IOM uint32_t DYNAMICADDRESS : 8;        /*!< [7..0] Device I3C Dynamic Address Includes Parity Bit.                    */
            uint32_t            : 24;
    } DCT3_b;
  } ;
  __IM  uint32_t  RESERVED4[60];

  union {
    __IOM uint32_t RHSCONTROL;                  /*!< (@ 0x00000400) RHS_CONTROL                                                */

    struct {
      __IOM uint32_t HEADERENMASK : 4;          /*!< [3..0] Driver Maximum Header Count Maximum number of Ring Headers
                                                     currently enabled by the software. When changing this value,
                                                     all Ring Bundles (Ring Headers) must be in Disabled state.
                                                     Note: The software may enable fewer Ring Bundles than the
                                                     MAX_HEADER_COUNT_CAPABILITY hardware maximum. Valid Values:
                                                     0-8                                                                       */
      __IOM uint32_t MAXHEADERCOUNT : 4;        /*!< [7..4] HC Maximum Header Count Maximum number of Ring Bundles
                                                     supported by the Host Controller hardware. Valid Values:
                                                     0-8                                                                       */
            uint32_t            : 8;
      __IOM uint32_t HEADERSIZE : 8;            /*!< [23..16] Ring Header Size Size in DWORDs per Ring Header Descriptor
                                                     structure, expressed as a power of 2. I.e., structure size
                                                     is (1 SHL HEADER_SIZE) DWORDs. Example: A HEADER_SIZE value
                                                     of 3 gives a Ring Header 3 Descriptor size of 2 DWORDs
                                                     = 8 DWORDs = 32 bytes. Reset Value: 0x5, giving a default
                                                     Ring Header Descriptor size of 0x80 bytes = 128 bytes =
                                                     32 DWORDs.                                                                */
      __IOM uint32_t PREAMBLESIZE : 8;          /*!< [31..24] Preamble Section Size Length in DWORDs of this Preamble
                                                     Section.                                                                  */
    } RHSCONTROL_b;
  } ;

  union {
    __IOM uint32_t RH0OFFSET;                   /*!< (@ 0x00000404) RH0_OFFSET                                                 */

