AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t OFFSET     : 32;           /*!< [31..0] Offset to Ring Header descriptor for ring bundle number
                                                     0.                                                                        */
    } RH0OFFSET_b;
  } ;

  union {
    __IOM uint32_t RH1OFFSET;                   /*!< (@ 0x00000408) RH1_OFFSET                                                 */

    struct {
      __IOM uint32_t OFFSET     : 32;           /*!< [31..0] Offset to Ring Header descriptor for ring bundle number
                                                     1.                                                                        */
    } RH1OFFSET_b;
  } ;

  union {
    __IOM uint32_t RH2OFFSET;                   /*!< (@ 0x0000040C) RH2_OFFSET                                                 */

    struct {
      __IOM uint32_t OFFSET     : 32;           /*!< [31..0] Offset to Ring Header descriptor for ring bundle number
                                                     2.                                                                        */
    } RH2OFFSET_b;
  } ;

  union {
    __IOM uint32_t RH3OFFSET;                   /*!< (@ 0x00000410) RH3_OFFSET                                                 */

    struct {
      __IOM uint32_t OFFSET     : 32;           /*!< [31..0] Offset to Ring Header descriptor for ring bundle number
                                                     3.                                                                        */
    } RH3OFFSET_b;
  } ;
  __IM  uint32_t  RESERVED5[59];

  union {
    __IOM uint32_t COMMANDQUEUEPORT;            /*!< (@ 0x00000500) COMMAND_QUEUE_PORT                                         */

    struct {
      __IOM uint32_t DATA       : 32;           /*!< [31..0] Data for command queue                                            */
    } COMMANDQUEUEPORT_b;
  } ;

  union {
    __IOM uint32_t RESPONSEQUEUEPORT;           /*!< (@ 0x00000504) RESPONSE_QUEUE_PORT                                        */

    struct {
      __IOM uint32_t DATA       : 32;           /*!< [31..0] Data read from response queue.                                    */
    } RESPONSEQUEUEPORT_b;
  } ;

  union {
    __IOM uint32_t XFERDATAPORT;                /*!< (@ 0x00000508) XFER_DATA_PORT                                             */

    struct {
      __IOM uint32_t DATA       : 32;           /*!< [31..0] Data read from Rx Data Buffer. The Receive data port
                                                     is mapped to the RxData Buffer. The Receive data is always
                                                     packed in 4-byte aligned and stored in the Rx-Data Buffer.
                                                     If the command length is not aligned to the 4-bytes, then
                                                     there will be unused bytes in the end location of the transfer
                                                     bytes. Data written to Tx Data Buffer. The Transmit Data
                                                     port is mapped to the Tx-Data Buffer. The transmit data
                                                     should always be packed in 4-byte aligned and written to
                                                     the Transmit data port register. If the Command l                         */
    } XFERDATAPORT_b;
  } ;

  union {
    __IOM uint32_t IBIPORT;                     /*!< (@ 0x0000050C) IBI_PORT                                                   */

    struct {
      __IOM uint32_t IBIDATA    : 32;           /*!< [31..0] Data read from IBI Data Buffer. This register is mapped
                                                     to the IBI Ring Data Buffer.The IBI Data is always packed
                                                     in 4-byte aligned and put to the IBI Ring. If the incoming
                                                     data is not aligned to the 4-bytes, then there will be
                                                     unused bytes in the end location of the IBI transfer. Table
                                                     48 : IBI Data Port Register Fields                                        */
    } IBIPORT_b;
  } ;

  union {
    __IOM uint32_t QUEUETHLDCTRL;               /*!< (@ 0x00000510) QUEUE_THLD_CTRL                                            */

    struct {
      __IOM uint32_t CMDEMPTYBUFTHLD : 8;       /*!< [7..0] Command Ready Buffer Threshold in DWORDs Controls the
                                                     minimum number of empty Command Queue entries needed to
                                                     trigger the CMD_QUEUE_READY_STAT interrupt. If this field
                                                     is greater than (QUEUE_SIZE.CR_QUEUE_SIZE 1), then only
                                                     the number of bits required to address the full buffer
                                                     depth will be considered. Values: 0: Interrupt is issued
                                                     when Command Queue is completely empty N: Interrupt is
                                                     issued when Command Queue contains N entries                              */
      __IOM uint32_t RESPBUFTHLD : 8;           /*!< [15..8] Response Ready Buffer Threshold in DWORDs Controls the
                                                     minimum number of Response Queue entries needed to trigger
                                                     the RESP_READY_STAT interrupt. If this field is greater
                                                     than (QUEUE_SIZE.CR_QUEUE_SIZE 1), then only the number
                                                     of bits required to address the full buffer depth will
                                                     be considered. Values: 0: Interrupt is issued when response
                                                     Queue contains 1 entry (DWORD) N: Interrupt is triggered
                                                     when Response Queue contains N+1 entries (DWORD)                          */
      __IOM uint32_t IBIDATATHLD : 8;           /*!< [23..16] IBI Data Threshold This is the IBI Data segment size,
                                                     in DWORDs (4 Bytes). Supported Values: Minimum: 1 (4 Bytes)
                                                     Maximum: 63 (252 Bytes), provided that the configured IBI
                                                     Queue depth is GE 64. In PIO Mode, this field allows the
                                                     incoming IBI Data to be sliced into multiple segments generating
                                                     status individually, to support cut- through readout of
                                                     a long IBI Payload Data. When Asynchronous Timing Control
                                                     mode is supported, this field should be set to a value
                                                     of 4 or more to allow the single data segment to                          */
      __IOM uint32_t IBISTATUSTHLD : 8;         /*!< [31..24] IBI Status Threshold in DWORDs Controls generation
                                                     of the IBI_STATUS_THLD_STAT interrupt, based on the value
                                                     of the IBI Queues Outstanding IBI Status count. Values:
                                                     0: Interrupt is generated when the Outstanding IBI Status
                                                     count is GE 1 N: Interrupt is generated when the Outstanding
                                                     IBI Status is GE N+1 Each IBI Status entry can represent
                                                     either the complete IBI payload (if the IBI payload byte
                                                     size LE 4*IBI_DATA_THLD), or a segment of the IBI payload
                                                     (if the IBI payload byte size GT 4*IBI_DATA_THLD).                        */
    } QUEUETHLDCTRL_b;
  } ;

  union {
    __IOM uint32_t DATABUFFERTHLDCTRL;          /*!< (@ 0x00000514) DATA_BUFFER_THLD_CTRL                                      */

