AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t TXBUFTHLD  : 3;            /*!< [2..0] Transmit Buffer Threshold Minimum number of empty Transmit
                                                     FIFO entries, in DWORDs, that will trigger the TX_THLD_STAT
                                                     interrupt. The software must program a value less than
                                                     QUEUE_SIZE.TX_DATA_BUFFER_SIZE in this register. Values:
                                                     0x0: Interrupt triggers at 2 Tx Buffer entries, DWORDs
                                                     0x1: Interrupt triggers at 4 Tx Buffer entries, DWORDs
                                                     0x2: Interrupt triggers at 8 Tx Buffer entries, DWORDs
                                                     0x3: Interrupt triggers at 16 Tx Buffer entries, DWORDs
                                                     0x4: Interrupt triggers at 32 Tx Buffer entries, DWORDs
                                                     0x5                                                                       */
            uint32_t            : 5;
      __IOM uint32_t RXBUFTHLD  : 3;            /*!< [10..8] Receive Buffer Threshold Minimum number of Receive FIFO
                                                     entries in DWORDs that will trigger the RX_THLD_STAT interrupt.
                                                     The software must program a value less than QUEUE_SIZE.RX_DATA_BUFFER_SIZ
                                                     in this register. Values: 0x0: Interrupt triggers at 2
                                                     Rx Buffer entries, DWORDs 0x1: Interrupt triggers at 4
                                                     Rx Buffer entries, DWORDs 0x2: Interrupt triggers at 8
                                                     Rx Buffer entries, DWORDs 0x3: Interrupt triggers at 16
                                                     Rx Buffer entries, DWORDs 0x4: Interrupt triggers at 32
                                                     Rx Buffer entries, DWORDs 0x5: Interrup                                   */
            uint32_t            : 5;
      __IOM uint32_t TXSTARTTHLD : 3;           /*!< [18..16] Transmit (Transfer) Start Threshold in DWORDs When
                                                     preparing to initiate a Write Transfer on the I3C Bus,
                                                     the Host Controller shall wait until the Transmit Buffer
                                                     has at least the indicated number of locations available.
                                                     Two optional configurable Modes are available: Store and
                                                     Forward Mode If the TX_START_THLD field is set to the Transmit
                                                     Buffer size, then the Host Controller shall delay initiation
                                                     of the Write Command as follows: If the data length to
                                                     be transferred is GT the Transmit Buffer size, then th                    */
            uint32_t            : 5;
      __IOM uint32_t RXSTARTTHLD : 3;           /*!< [26..24] Receive Start Threshold When preparing to initiate
                                                     a Read Transfer on the I3C Bus, the Host Controller shall
                                                     wait until the Receive Buffer has at least the indicated
                                                     number of empty locations in DWORDs. Two optional configurable
                                                     Modes are available: Store and Forward Mode If the RX_START_THLD
                                                     field is set to the Receive Buffer size, then the Host
                                                     Controller shall delay initiation of the Read Command as
                                                     follows: If the data length to be transferred is GT the
                                                     Receive Buffer size, then the Host Controller sha                         */
            uint32_t            : 5;
    } DATABUFFERTHLDCTRL_b;
  } ;

  union {
    __IOM uint32_t QUEUESIZECTRL;               /*!< (@ 0x00000518) QUEUE_SIZE_CTRL                                            */

    struct {
      __IOM uint32_t CRQUEUESIZE : 8;           /*!< [7..0] Command/Response Queue Size Zero-based size, in Command
                                                     Descriptor / Response Descriptor in entries. Note that
                                                     the Command Descriptor size is two DWORDs, and the Response
                                                     Descriptor size is one DWORD. Values: 2 255 DWORDs                        */
      __IOM uint32_t IBI        : 8;            /*!< [15..8] R IMPL IBI Size Zero-based size of IBI Status / IBI
                                                     Data Payload entries, in DWORDs. This field sets the maximum
                                                     valid index for programming both IBI Status and IBI Threshold,
                                                     because IBI Status Descriptor entries and IBI Data Payload
                                                     entries are both put to the same Queue. Values: 2 255 DWORDs              */
      __IOM uint32_t RXDATABUFFERSIZE : 8;      /*!< [23..16] Receive Data Buffer Size In DWORDs Values: 0x0: 2 DWORDs
                                                     0x1: 4 DWORDs 0x2: 8 DWORDs 0x3: 16 DWORDs 0x4: 32 DWORDs
                                                     0x5: 64 DWORDs 0x6: 128 DWORDs 0x7: 256 DWORDs                            */
      __IOM uint32_t TXDATABUFFERSIZE : 8;      /*!< [31..24] Transmit Data Buffer Size In DWORDs Values: 0x0: 2
                                                     DWORDs 0x1: 4 DWORDs 0x2: 8 DWORDs 0x3: 16 DWORDs 0x4:
                                                     32 DWORDs 0x5: 64 DWORDs 0x6: 128 DWORDs 0x7: 256 DWORDs                  */
    } QUEUESIZECTRL_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t PIOINTRSTATUS;               /*!< (@ 0x00000520) PIO_INTR_STATUS                                            */

