AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t TXTHLDSTAT : 1;            /*!< [0..0] Tx Data Buffer Threshold Status The Host Controller shall
                                                     set this bit to 1'b1 when the number of entries in the
                                                     Tx Data Queue is LE the TX_BUF_THLD threshold (see register
                                                     DATA_BUFFER_THLD_CTRL). The Host Controller shall automatically
                                                     clear this field to 1'b0 when the number of Tx Data Queue
                                                     entries exceeds the TX_BUF_THOLD threshold.                               */
      __IOM uint32_t RXTHLDSTAT : 1;            /*!< [1..1] Rx Data Buffer Threshold Status The Host Controller shall
                                                     set this bit to 1'b1 when the number of entries in the
                                                     Rx Data Queue is GE the RX_BUF_THLD threshold (see register
                                                     DATA_BUFFER_THLD_CTRL). The Host Controller shall automatically
                                                     clear this field to 1'b0 when the number of Rx Data Queue
                                                     entries falls below the RX_BUF_THLD threshold.                            */
      __IOM uint32_t IBISTATUSTHLDSTAT : 1;     /*!< [2..2] IBI Status Threshold Status The Host Controller shall
                                                     set this bit to 1'b1 when the number of IBI Status Entries
                                                     in the IBI Queue reaches the IBI_STATUS_THLD threshold
                                                     (see register QUEUE_THLD_CTRL). The Host Controller shall
                                                     automatically clear this field to 1'b0 when the number
                                                     of IBI Status entries in the IBI Queue falls below the
                                                     IBI_STATUS_THLD threshold as a result of application reads.               */
      __IOM uint32_t CMDQUEUEREADYSTAT : 1;     /*!< [3..3] Command Queue Ready Status The Host Controller shall
                                                     set this bit to 1'b1 when the number of Command Queue entries
                                                     is LE the CMD_EMPTY_BUF_THLD threshold (see register QUEUE_THLD_CTRL).
                                                     The Host Controller shall automatically clear this field
                                                     to 1'b0 when the number of Command Queue entries exceeds
                                                     the RESP_BUF_THLD threshold.                                              */
      __IOM uint32_t RESPREADYSTAT : 1;         /*!< [4..4] Response Ready Status The Host Controller shall set this
                                                     bit to 1'b1 when the number of Response Queue entries is
                                                     GE the RESP_BUF_THLD threshold (see register QUEUE_THLD_CTRL).
                                                     The Host Controller shall automatically clear this field
                                                     to 1'b0 when the number of Response Queue entries falls
                                                     below the RESP_BUF_THLD threshold.                                        */
      __IOM uint32_t TRANSFERABORTSTAT : 1;     /*!< [5..5] Transfer Abort Status The Host Controller shall set this
                                                     bit to 1'b1 when any transfer is aborted. To clear, write
                                                     1'b0 to this bit.                                                         */
            uint32_t            : 3;
      __IOM uint32_t TRANSFERERRSTAT : 1;       /*!< [9..9] Transfer Error Status The Host Controller shall set this
                                                     bit to 1'b1 when any transfer error occurs on the I3C Bus.
                                                     The Error Type for this error shall be available in the
                                                     Response structure corresponding to this transfer/command.
                                                     To clear, write 1'b0 to this bit.                                         */
            uint32_t            : 22;
    } PIOINTRSTATUS_b;
  } ;

  union {
    __IOM uint32_t PIOINTRSTATUSENABLE;         /*!< (@ 0x00000524) PIO_INTR_STATUS_ENABLE                                     */

    struct {
      __IOM uint32_t TXTHLDSTATEN : 1;          /*!< [0..0] When set to 1'b1, enables interrupt status logging for
                                                     TX_THLD_STAT                                                              */
      __IOM uint32_t RXTHLDSTATEN : 1;          /*!< [1..1] When set to 1'b1, enables interrupt status logging for
                                                     RX_THLD_STAT                                                              */
      __IOM uint32_t IBISTATUSTHLDSTATEN : 1;   /*!< [2..2] When set to 1'b1, enables interrupt status logging for
                                                     IBI_STATUS_THLD_STAT                                                      */
      __IOM uint32_t CMDQUEUEREADYSTATEN : 1;   /*!< [3..3] When set to 1'b1, enables interrupt status logging for
                                                     CMD_QUEUE_READY_STAT                                                      */
      __IOM uint32_t RESPREADYSTATEN : 1;       /*!< [4..4] When set to 1'b1, enables interrupt status logging for
                                                     RESP_READY_STAT                                                           */
      __IOM uint32_t TRANSFERABORTSTATEN : 1;   /*!< [5..5] When set to 1'b1, enables interrupt status logging for
                                                     TRANSFER_ABORT_STAT                                                       */
            uint32_t            : 3;
      __IOM uint32_t TRANSFERERRSTATEN : 1;     /*!< [9..9] When set to 1'b1, enables interrupt status logging for
                                                     TRANSFER_ERR_STAT                                                         */
            uint32_t            : 22;
    } PIOINTRSTATUSENABLE_b;
  } ;

  union {
    __IOM uint32_t PIOINTRSIGNALENABLE;         /*!< (@ 0x00000528) PIO_INTR_SIGNAL_ENABLE                                     */

