AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t DMAENABLE  : 1;            /*!< [0..0] Enable the DMA controller. When disabled, DMA requests
                                                     will be ignored by the controller                                         */
      __IOM uint32_t DECODEABORT : 1;           /*!< [1..1] APB Decode Abort. When set, the APB bridge will issue
                                                     a data abort (bus fault) on transactions to peripherals
                                                     that are powered down. When set to 0, writes are quietly
                                                     discarded and reads return 0.                                             */
            uint32_t            : 6;
      __IOM uint32_t HYSTERESIS : 8;            /*!< [15..8] This field determines how long the DMA will remain active
                                                     during deep sleep before shutting down and returning the
                                                     system to full deep sleep. Values are based on a 94KHz
                                                     clock and are roughly 10us increments for a range of ~10us
                                                     to 2.55ms                                                                 */
            uint32_t            : 16;
    } APBDMACTRL_b;
  } ;
  __IM  uint32_t  RESERVED11[45];

  union {
    __IOM uint32_t KEXTCLKSEL;                  /*!< (@ 0x00000338) Locks the state of the EXTCLKSEL register from
                                                                    writes. This is done to prevent errant writes
                                                                    to the register, as this could cause the
                                                                    chip to halt. Write a value of 0x53 to unlock
                                                                    write access to the EXTCLKSEL register.
                                                                    Once unlocked, the register will read back
                                                                    a 1 to undicate this is unlocked. Writing
                                                                    the register with any other value other
                                                                    than 0x53 will enable the lock.                            */

    struct {
      __IOM uint32_t KEXTCLKSEL : 32;           /*!< [31..0] Key register value.                                               */
    } KEXTCLKSEL_b;
  } ;
  __IM  uint32_t  RESERVED12[4];

  union {
    __IOM uint32_t SIMOBUCK4;                   /*!< (@ 0x0000034C) SIMO Buck Muxed VDDC LV Active Sequence Trim
                                                                    Control                                                    */

    struct {
      __IOM uint32_t SIMOBUCKVDDCLVACTDRVSTRTRIM : 2;/*!< [1..0] VDDC LV active trim control for drive strength.               */
      __IOM uint32_t SIMOBUCKVDDCLVACTHIGHTOFFTRIMFINE : 4;/*!< [5..2] DEPRECATED.                                             */
      __IOM uint32_t SIMOBUCKVDDCLVACTHIGHTOFFTRIM : 5;/*!< [10..6] VDDC LV active high toff trim control for Buck sequence.   */
      __IOM uint32_t SIMOBUCKVDDCLVACTHIGHTONTRIM : 4;/*!< [14..11] VDDC LV active high ton trim control for Buck sequence.    */
      __IOM uint32_t SIMOBUCKVDDCLVACTLOWTOFFTRIMFINE : 4;/*!< [18..15] DEPRECATED.                                            */
      __IOM uint32_t SIMOBUCKVDDCLVACTLOWTOFFTRIM : 5;/*!< [23..19] VDDC LV active low trim control for a 500 MHz clock
                                                     inside the simobuck analog design.                                        */
      __IOM uint32_t SIMOBUCKVDDCLVACTLOWTONTRIM : 4;/*!< [27..24] VDDC LV active low ton trim control for Buck sequence.      */
      __IOM uint32_t SIMOBUCKVDDCLVINPREFSEL : 1;/*!< [28..28] DEPRECATED                                                      */
            uint32_t            : 3;
    } SIMOBUCK4_b;
  } ;
  __IM  uint32_t  RESERVED13[10];

  union {
    __IOM uint32_t SIMOBUCK15;                  /*!< (@ 0x00000378) SIMO Buck Compare, Brown out, Active and Low
                                                                    power Trim Control                                         */

    struct {
      __IOM uint32_t SIMOBUCKVDDCCOMPTRIMMINUS : 5;/*!< [4..0] Static trim to allow separation between low power and
                                                     active rail.                                                              */
      __IOM uint32_t SIMOBUCKVDDCCOMPTRIMPLUS : 5;/*!< [9..5] Static trim to allow separation when low power GT active
                                                     rail.                                                                     */
      __IOM uint32_t SIMOBUCKVDDCBRNOUTTRIM : 10;/*!< [19..10] Digital brown out max counter value for VDDC rail.              */
      __IOM uint32_t SIMOBUCKVDDCLVRXCOMPTRIMEN : 1;/*!< [20..20] Enable the VDDC LV rail. If not enabled, the rail will
                                                     not be regulated. This must be done before simobuck comes
                                                     up.                                                                       */
      __IOM uint32_t SIMOBUCKVDDSRXCOMPTRIMEN : 1;/*!< [21..21] Enable the VDDS rail. If not enabled, the rail will
                                                     not be regulated. This must be done before simobuck comes
                                                     up.                                                                       */
      __IOM uint32_t SIMOBUCKVDDFRXCOMPTRIMEN : 1;/*!< [22..22] Enable the VDDF rail. If not enabled, the rail will
                                                     not be regulated. This must be done before simobuck comes
                                                     up.                                                                       */
      __IOM uint32_t SIMOBUCKVDDCRXCOMPTRIMEN : 1;/*!< [23..23] Enable the VDDC rail. If not enabled, the rail will
                                                     not be regulated. This must be done before simobuck comes
                                                     up.                                                                       */
      __IOM uint32_t SIMOBUCKZXCOMPOFFSETTRIM : 5;/*!< [28..24] Zxcomp offset trim. Feedthrough to analog.                     */
            uint32_t            : 3;
    } SIMOBUCK15_b;
  } ;

  union {
    __IOM uint32_t PWRSW0;                      /*!< (@ 0x0000037C) PWRSW Control 0                                            */

