AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
            uint32_t            : 18;
      __IOM uint32_t PWRSWVDDMDSP0DYNSEL : 1;   /*!< [18..18] override value for pwrsw_vddmdsp0_dynsel                         */
      __IOM uint32_t PWRSWVDDMDSP0STATSEL : 1;  /*!< [19..19] VDDMDSP0 power switch static select                              */
      __IOM uint32_t PWRSWVDDMDSP0OVERRIDE : 1; /*!< [20..20] override enable for pwrsw_vddmdsp0_dynsel                        */
      __IOM uint32_t PWRSWVDDMDSP1DYNSEL : 1;   /*!< [21..21] override value for pwrsw_vddmdsp1_dynsel                         */
      __IOM uint32_t PWRSWVDDMDSP1STATSEL : 1;  /*!< [22..22] VDDMDSP1 power switch static select                              */
      __IOM uint32_t PWRSWVDDMDSP1OVERRIDE : 1; /*!< [23..23] override enable for pwrsw_vddmdsp1_dynsel                        */
            uint32_t            : 8;
    } PWRSW0_b;
  } ;

  union {
    __IOM uint32_t PWRSW1;                      /*!< (@ 0x00000380) PWRSW Control 1                                            */

    struct {
      __IOM uint32_t PWRSWVDDRDSP0DYNSEL : 2;   /*!< [1..0] override value for pwrsw_vddrdsp0_dynsel                           */
      __IOM uint32_t PWRSWVDDRDSP0PGN : 1;      /*!< [2..2] override value for pwrsw_vddrdsp0_pgn                              */
      __IOM uint32_t PWRSWVDDRDSP0STATSEL : 1;  /*!< [3..3] VDDRDSP0 power switch static select                                */
      __IOM uint32_t PWRSWVDDRDSP0OVERRIDE : 1; /*!< [4..4] override enable for pwrsw_vddrdsp0_dynsel and pgn                  */
      __IOM uint32_t PWRSWVDDRDSP1DYNSEL : 2;   /*!< [6..5] override value for pwrsw_vddrdsp1_dynsel                           */
      __IOM uint32_t PWRSWVDDRDSP1PGN : 1;      /*!< [7..7] override value for pwrsw_vddrdsp1_pgn                              */
      __IOM uint32_t PWRSWVDDRDSP1STATSEL : 1;  /*!< [8..8] VDDRDSP1 power switch static select                                */
      __IOM uint32_t PWRSWVDDRDSP1OVERRIDE : 1; /*!< [9..9] override enable for pwrsw_vddrdsp1_dynsel and pgn                  */
      __IOM uint32_t PWRSWVDDRLDYNSEL : 1;      /*!< [10..10] override value for pwrsw_vddrl_dynsel                            */
      __IOM uint32_t PWRSWVDDRLPGN : 1;         /*!< [11..11] override value for pwrsw_vddrl_pgn                               */
      __IOM uint32_t PWRSWVDDRLSTATSEL : 1;     /*!< [12..12] VDDRL power switch static select                                 */
      __IOM uint32_t PWRSWVDDRLOVERRIDE : 1;    /*!< [13..13] override enable for pwrsw_vddrl_dynsel and pgn                   */
      __IOM uint32_t PWRSWVDDRMDYNSEL : 1;      /*!< [14..14] override value for pwrsw_vddrm_dynsel                            */
      __IOM uint32_t PWRSWVDDRMPGN : 1;         /*!< [15..15] override value for pwrsw_vddrm_pgn                               */
      __IOM uint32_t PWRSWVDDRMSTATSEL : 1;     /*!< [16..16] VDDRM power switch static select                                 */
      __IOM uint32_t PWRSWVDDRMOVERRIDE : 1;    /*!< [17..17] override enable for pwrsw_vddrm_dynsel and pgn                   */
      __IOM uint32_t PWRSWVDDLPGN : 1;          /*!< [18..18] override value for pwrsw_vddl_pgn                                */
      __IOM uint32_t PWRSWVDDLOVERRIDE : 1;     /*!< [19..19] override enable for pwrsw_vddl_pgn                               */
      __IOM uint32_t PWRSWCOMPPDNB : 1;         /*!< [20..20] pwrsw_comp_pdnb                                                  */
      __IOM uint32_t PWRSWOVRDRVEN : 1;         /*!< [21..21] pwrsw_ovrdrv_en                                                  */
      __IOM uint32_t DIGPWRSWOVRDRVEN : 1;      /*!< [22..22] digpwrsw_ovrdrv_en                                               */
      __IOM uint32_t DIGPWRSWOVRDRVSEL : 2;     /*!< [24..23] digpwrsw_ovrdrv_sel                                              */
      __IOM uint32_t USEVDDF4VDDRCPUINHP : 1;   /*!< [25..25] Setting this bit selects VDDF for VDDRCPU in when MCU
                                                     is in HP mode. This is valid for only normal operational
                                                     mode (i.e without overrides).                                             */
      __IOM uint32_t FORCEVDDRMVDDS : 1;        /*!< [26..26] Setting this bit selects VDDS for VDDRM when Flash
                                                     is off. This is valid for only normal operational mode
                                                     (i.e. without overrides).                                                 */
      __IOM uint32_t FORCEVDDRMOFF : 1;         /*!< [27..27] Setting this bit forces VDDRM to be open when Flash
                                                     is off. This is valid for only normal operational mode
                                                     (i.e. without overrides).                                                 */
      __IOM uint32_t SHORTVDDCVDDCLVOREN : 1;   /*!< [28..28] pwrsw short override select for vddc/vddclv                      */
      __IOM uint32_t SHORTVDDCVDDCLVORVAL : 1;  /*!< [29..29] pwrsw short override value for vddc/vddclv                       */
      __IOM uint32_t SHORTVDDFVDDSOREN : 1;     /*!< [30..30] pwrsw short override select for vddf/vdds                        */
      __IOM uint32_t SHORTVDDFVDDSORVAL : 1;    /*!< [31..31] pwrsw short override value for vddf/vdds                         */
    } PWRSW1_b;
  } ;
  __IM  uint32_t  RESERVED14[9];

  union {
    __IOM uint32_t FLASHWPROT0;                 /*!< (@ 0x000003A8) These bits write-protect flash in 16KB chunks.             */

    struct {
      __IOM uint32_t FW0BITS    : 32;           /*!< [31..0] Write protect flash 0x00000000 - 0x0007FFFF. Each bit
                                                     provides write protection for 16KB chunks of flash data
                                                     space. Bits are cleared by writing a 1 to the bit. When
                                                     read, 0 indicates the region is protected. Bits are sticky
                                                     (can be set when PROTLOCK is 1, but only cleared by reset)                */
    } FLASHWPROT0_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT1;                 /*!< (@ 0x000003AC) These bits write-protect flash in 16KB chunks.             */

