AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t DMAWPROT1  : 16;           /*!< [15..0] Write protect SRAM from DMA. Each bit provides write
                                                     protection for an 8KB region of memory. When set to 1,
                                                     the region will be protected from DMA writes, when set
                                                     to 0, DMA may write the region.                                           */
            uint32_t            : 16;
    } DMASRAMWPROT1_b;
  } ;

  union {
    __IOM uint32_t DMASRAMRPROT0;               /*!< (@ 0x000003D0) These bits read-protect system SRAM from DMA
                                                                    operations in 8KB chunks.                                  */

    struct {
      __IOM uint32_t DMARPROT0  : 32;           /*!< [31..0] Read protect SRAM from DMA. Each bit provides write
                                                     protection for an 8KB region of memory. When set to 1,
                                                     the region will be protected from DMA reads, when set to
                                                     0, DMA may read the region.                                               */
    } DMASRAMRPROT0_b;
  } ;

  union {
    __IOM uint32_t DMASRAMRPROT1;               /*!< (@ 0x000003D4) These bits read-protect system SRAM from DMA
                                                                    operations in 8KB chunks.                                  */

    struct {
      __IOM uint32_t DMARPROT1  : 16;           /*!< [15..0] Read protect SRAM from DMA. Each bit provides write
                                                     protection for an 8KB region of memory. When set to 1,
                                                     the region will be protected from DMA reads, when set to
                                                     0, DMA may read the region.                                               */
            uint32_t            : 16;
    } DMASRAMRPROT1_b;
  } ;
  __IM  uint32_t  RESERVED15[22];

  union {
    __IOM uint32_t AUDIO1;                      /*!< (@ 0x00000430) Audio trims 1                                              */

    struct {
            uint32_t            : 6;
      __IOM uint32_t MICBIASVOLTAGETRIM : 6;    /*!< [11..6] micbias_voltage_trim                                              */
      __IOM uint32_t MICBIASPDNB : 1;           /*!< [12..12] micbias_pdnb                                                     */
            uint32_t            : 19;
    } AUDIO1_b;
  } ;
  __IM  uint32_t  RESERVED16;

  union {
    __IOM uint32_t PGAADCIFCTRL;                /*!< (@ 0x00000438) PGA ADCIF control                                          */

    struct {
      __IOM uint32_t PGAADCIFCHAACTIVE : 2;     /*!< [1..0] pgaadcif_chA_active                                                */
      __IOM uint32_t PGAADCIFCHAPDNB : 2;       /*!< [3..2] pgaadcif_chA_pdnb                                                  */
      __IOM uint32_t PGAADCIFCHBACTIVE : 2;     /*!< [5..4] pgaadcif_chB_active                                                */
      __IOM uint32_t PGAADCIFCHBPDNB : 2;       /*!< [7..6] pgaadcif_chB_pdnb                                                  */
      __IOM uint32_t PGAADCIFTESTPADEN : 1;     /*!< [8..8] pgaadcif_testpad_en                                                */
      __IOM uint32_t PGAADCIFTESTPADSEL : 3;    /*!< [11..9] pgaadcif_testpad_sel                                              */
      __IOM uint32_t PGAADCIFVCOMPEN : 1;       /*!< [12..12] pgaadcif_vcomp_en                                                */
      __IOM uint32_t PGAADCIFVCOMPSEL : 2;      /*!< [14..13] pgaadcif_vcomp_sel                                               */
            uint32_t            : 17;
    } PGAADCIFCTRL_b;
  } ;

  union {
    __IOM uint32_t PGACTRL1;                    /*!< (@ 0x0000043C) PGA control 1                                              */

    struct {
      __IOM uint32_t PGACHA0GAIN1SEL : 3;       /*!< [2..0] d2a_pga_chA0_gain1_sel_vddh                                        */
      __IOM uint32_t PGACHA0GAIN2DIV2SEL : 1;   /*!< [3..3] d2a_pga_chA0_gain2_div2_sel_vddh                                   */
      __IOM uint32_t PGACHA0GAIN2SEL : 5;       /*!< [8..4] d2a_pga_chA0_gain2_sel_vddh                                        */
      __IOM uint32_t PGACHA1GAIN1SEL : 3;       /*!< [11..9] d2a_pga_chA1_gain1_sel_vddh                                       */
      __IOM uint32_t PGACHA1GAIN2DIV2SEL : 1;   /*!< [12..12] d2a_pga_chA1_gain2_div2_sel_vddh                                 */
      __IOM uint32_t PGACHA1GAIN2SEL : 5;       /*!< [17..13] d2a_pga_chA1_gain2_sel_vddh                                      */
      __IOM uint32_t PGACHABYPASSEN : 2;        /*!< [19..18] d2a_pga_chA_bypass_en_vddh                                       */
      __IOM uint32_t PGACHAOPAMPINPDNB : 2;     /*!< [21..20] d2a_pga_chA_opamp_in_pdnb_vddh                                   */
      __IOM uint32_t PGACHAOPAMPOUTPDNB : 2;    /*!< [23..22] d2a_pga_chA_opamp_out_pdnb_vddh                                  */
      __IOM uint32_t PGACHAVCMGENPDNB : 1;      /*!< [24..24] d2a_pga_chA_vcmgen_pdnb_vddh                                     */
      __IOM uint32_t PGACHAVCMGENQCHARGEEN : 1; /*!< [25..25] d2a_pga_chA_vcmgen_qcharge_en_vddh                               */
      __IOM uint32_t PGAIREFGENPDNB : 1;        /*!< [26..26] d2a_pga_irefgen_pdnb_vddh                                        */
      __IOM uint32_t PGAVREFGENPDNB : 1;        /*!< [27..27] d2a_pga_vrefgen_pdnb_vddh                                        */
      __IOM uint32_t PGAVREFGENQUICKSTARTEN : 1;/*!< [28..28] d2a_pga_vrefgen_quickstart_en_vddh                               */
      __IOM uint32_t VCOMPSELPGA : 1;           /*!< [29..29] d2a_vcomp_sel_pga_vddh                                           */
            uint32_t            : 2;
    } PGACTRL1_b;
  } ;

  union {
    __IOM uint32_t PGACTRL2;                    /*!< (@ 0x00000440) PGA control 2                                              */

