AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t PGACHB0GAIN1SEL : 3;       /*!< [2..0] d2a_pga_chB0_gain1_sel_vddh                                        */
      __IOM uint32_t PGACHB0GAIN2DIV2SEL : 1;   /*!< [3..3] d2a_pga_chB0_gain2_div2_sel_vddh                                   */
      __IOM uint32_t PGACHB0GAIN2SEL : 5;       /*!< [8..4] d2a_pga_chB0_gain2_sel_vddh                                        */
      __IOM uint32_t PGACHB1GAIN1SEL : 3;       /*!< [11..9] d2a_pga_chB1_gain1_sel_vddh                                       */
      __IOM uint32_t PGACHB1GAIN2DIV2SEL : 1;   /*!< [12..12] d2a_pga_chB1_gain2_div2_sel_vddh                                 */
      __IOM uint32_t PGACHB1GAIN2SEL : 5;       /*!< [17..13] d2a_pga_chB1_gain2_sel_vddh                                      */
      __IOM uint32_t PGACHBBYPASSEN : 2;        /*!< [19..18] d2a_pga_chB_bypass_en_vddh                                       */
      __IOM uint32_t PGACHBOPAMPINPDNB : 2;     /*!< [21..20] d2a_pga_chB_opamp_in_pdnb_vddh                                   */
      __IOM uint32_t PGACHBOPAMPOUTPDNB : 2;    /*!< [23..22] d2a_pga_chB_opamp_out_pdnb_vddh                                  */
      __IOM uint32_t PGACHBVCMGENPDNB : 1;      /*!< [24..24] d2a_pga_chB_vcmgen_pdnb_vddh                                     */
      __IOM uint32_t PGACHBVCMGENQCHARGEEN : 1; /*!< [25..25] d2a_pga_chB_vcmgen_qcharge_en_vddh                               */
            uint32_t            : 6;
    } PGACTRL2_b;
  } ;

  union {
    __IOM uint32_t AUDADCPWRDLY;                /*!< (@ 0x00000444) Audio ADC Power Up Delay Control                           */

    struct {
      __IOM uint32_t AUDADCPWR0 : 8;            /*!< [7..0] ADC Reference Buffer Power Enable delay in 64 ADC CLK
                                                     increments for ADC_CLKSEL = 0x1, 32 ADC CLOCK increments
                                                     for ADC_CLKSEL = 0x2.                                                     */
      __IOM uint32_t AUDADCPWR1 : 8;            /*!< [15..8] ADC Reference Keeper enable delay in 16 ADC CLK increments
                                                     for ADC_CLKSEL = 0x1, 8 ADC CLOCK increments for ADC_CLKSEL
                                                     = 0x2.                                                                    */
            uint32_t            : 16;
    } AUDADCPWRDLY_b;
  } ;
} MCUCTRL_Type;                                 /*!< Size = 1096 (0x448)                                                       */



/* =========================================================================================================================== */
/* ================                                          MEMCPY0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief MEMCPY Interface (MEMCPY0)
  */

typedef struct {                                /*!< (@ 0x40101000) MEMCPY0 Structure                                          */

  union {
    __IOM uint32_t CTRL;                        /*!< (@ 0x00000000) MEMCPY Control                                             */

    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< [0..0] MEMCPY Enable. Setting this bit to EN will start the
                                                     MEMCPY operation                                                          */
      __IOM uint32_t PRIORITY   : 1;            /*!< [1..1] Sets the Priority of the MEMCPY request                            */
      __IOM uint32_t SRCSTATIC  : 1;            /*!< [2..2] Indicates Source address is static (non-incrementing)              */
      __IOM uint32_t DSTSTATIC  : 1;            /*!< [3..3] Indicates Destination address is static (non-incrementing)         */
      __IOM uint32_t FUNCTION   : 4;            /*!< [7..4] Function to be performed                                           */
      __IOM uint32_t HASH       : 4;            /*!< [11..8] Function to be performed                                          */
            uint32_t            : 20;
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t STATUS;                      /*!< (@ 0x00000004) MEMCPY Status                                              */

    struct {
      __IOM uint32_t TIP        : 1;            /*!< [0..0] MEMCPY Transfer In Progress indicator. 1 will indicate
                                                     that a MEMCPY transfer is active. The MEMCPY transfer may
                                                     be waiting on data, transferring data, or waiting for priority.
                                                     All of these will be indicated with a 1. A 0 will indicate
                                                     that the MEMCPY is fully complete and no further transactions
                                                     will be done.                                                             */
      __IOM uint32_t CPL        : 1;            /*!< [1..1] MEMCPY Transfer Complete. This signals the end of the
                                                     MEMCPY operation.                                                         */
      __IOM uint32_t ERR        : 1;            /*!< [2..2] MEMCPY Error. This active high bit signals that an error
                                                     was encountered during the MEMCPY operation.                              */
            uint32_t            : 29;
    } STATUS_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t SRCADDR;                     /*!< (@ 0x00000010) Source address                                             */

    struct {
      __IOM uint32_t SRCADDR    : 32;           /*!< [31..0] Source Address                                                    */
    } SRCADDR_b;
  } ;

  union {
    __IOM uint32_t TARGADDR;                    /*!< (@ 0x00000014) Target Address                                             */

