AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t ACCESS     : 32;           /*!< [31..0] Key register value.                                               */
    } ACCESS_b;
  } ;
  __IM  uint32_t  RESERVED[17];

  union {
    __IOM uint32_t TMCCTRL;                     /*!< (@ 0x00000050) MRAM Controller Manual Control                             */

    struct {
      __IOM uint32_t TMCRST     : 1;            /*!< [0..0] Manual override on TMC reset (1=reset 0=out of reset)              */
      __IOM uint32_t TMCLPR     : 1;            /*!< [1..1] Manual override on TMC LPR (low power mode)                        */
      __IOM uint32_t TMCPD      : 1;            /*!< [2..2] Manual override on TMC PD (powerdown)                              */
      __IOM uint32_t TMCSLP     : 1;            /*!< [3..3] Manual override on TMC sleep                                       */
      __IOM uint32_t TMCOVERRIDE : 1;           /*!< [4..4] Manual override controle enable                                    */
            uint32_t            : 27;
    } TMCCTRL_b;
  } ;

  union {
    __IOM uint32_t TMCCMD;                      /*!< (@ 0x00000054) MRAM Controller Manual Command                             */

    struct {
      __IOM uint32_t TMCCMD     : 5;            /*!< [4..0] 4-bit command to send                                              */
      __IOM uint32_t TMCYADR    : 5;            /*!< [9..5] YADR value                                                         */
      __IOM uint32_t TMCXADR    : 12;           /*!< [21..10] XADR value                                                       */
      __IOM uint32_t TMCINFO0   : 1;            /*!< [22..22] Info0 control line                                               */
      __IOM uint32_t TMCINFO1   : 1;            /*!< [23..23] INFO1 control line                                               */
      __IOM uint32_t TMCSRAMDMA : 1;            /*!< [24..24] SRAM DMA control line                                            */
            uint32_t            : 7;
    } TMCCMD_b;
  } ;
} MRAM_Type;                                    /*!< Size = 88 (0x58)                                                          */



/* =========================================================================================================================== */
/* ================                                           MSPI0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Multi-bit SPI Master (MSPI0)
  */

typedef struct {                                /*!< (@ 0x40060000) MSPI0 Structure                                            */

  union {
    __IOM uint32_t CTRL;                        /*!< (@ 0x00000000) This register is used to enable individual PIO
                                                                    based transactions to a device on the bus.
                                                                    The CFG register must be programmed properly
                                                                    for the transfer, and the ADDR and INSTR
                                                                    registers should be programmed if the SENDI
                                                                    and SENDA fields are enabled.                              */

    struct {
      __IOM uint32_t START      : 1;            /*!< [0..0] Write to 1 to initiate a PIO transaction on the bus (typically
                                                     the entire register should be written at once with this
                                                     bit set).                                                                 */
      __IOM uint32_t STATUS     : 1;            /*!< [1..1] Command status: 1 indicates command has completed. Cleared
                                                     by writing 1 to this bit or starting a new transfer.                      */
      __IOM uint32_t BUSY       : 1;            /*!< [2..2] Command status: 1 indicates controller is busy (command
                                                     in progress)                                                              */
      __IOM uint32_t CONT       : 1;            /*!< [3..3] Continuation transfer. When 1, indicates that the MSPI
                                                     will hold CE low after the transaction completes. This
                                                     is included for compatibility with IOM module since the
                                                     MSPI transfer module can handle most cases in a single
                                                     transfer. NOTE: CONT functionality only works with CLKDIV=2
                                                     (24 MHz).                                                                 */
      __IOM uint32_t PIODEV     : 1;            /*!< [4..4] Selects the Device configutation to use for PIO requests           */
      __IOM uint32_t SENDA      : 1;            /*!< [5..5] Indicates whether an address phase should be sent (see
                                                     ADDR register and ASIZE field in CFG register)                            */
      __IOM uint32_t SENDI      : 1;            /*!< [6..6] Indicates whether an instruction phase should be sent
                                                     (see INSTR field and ISIZE field in CFG register)                         */
      __IOM uint32_t TXRX       : 1;            /*!< [7..7] 1 Indicates a TX operation, 0 indicates an RX operation
                                                     of XFERBYTES                                                              */
      __IOM uint32_t BIGENDIAN  : 1;            /*!< [8..8] 1 indicates data in FIFO is in big endian format (MSB
                                                     first); 0 indicates little endian data (default, LSB first).              */
      __IOM uint32_t PIOSCRAMBLE : 1;           /*!< [9..9] Enables data scrambling for PIO opertions. This should
                                                     only be used for data operations and never for commands
                                                     to a device.                                                              */
      __IOM uint32_t ENTURN     : 1;            /*!< [10..10] Indicates whether TX->RX turnaround cycles should be
                                                     enabled for this operation (see TURNAROUND field in CFG
                                                     register).                                                                */
      __IOM uint32_t ENDCX      : 1;            /*!< [11..11] Enable DCX signal on data [1]                                    */
      __IOM uint32_t ENWLAT     : 1;            /*!< [12..12] Enable Write Latency Counter (time between address
                                                     and first data byte). Counter value is WRITELATENCY.                      */
      __IOM uint32_t PIOMIXED   : 3;            /*!< [15..13] **Experimental Support** Provides override controls
                                                     for data operations where instruction, address, and data
                                                     may transfer in different rates.                                          */
      __IOM uint32_t XFERBYTES  : 16;           /*!< [31..16] Number of bytes to transmit or receive (based on TXRX
                                                     bit)                                                                      */
    } CTRL_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t ADDR;                        /*!< (@ 0x00000008) Optional Address field to send for PIO transfers           */

