AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t WTULPDSPA  : 4;            /*!< [3..0] Weight used for ULP mode DSPA                                      */
      __IOM uint32_t WTULPDBG   : 4;            /*!< [7..4] Weight used for ULP mode DBG                                       */
      __IOM uint32_t WTULPAUDREC : 4;           /*!< [11..8] Weight used for ULP mode AUDREC                                   */
      __IOM uint32_t WTULPAUDPB : 4;            /*!< [15..12] Weight used for ULP mode AUDPB                                   */
      __IOM uint32_t WTULPAUDADC : 4;           /*!< [19..16] Weight used for ULP mode AUDADC                                  */
      __IOM uint32_t WTULPI3C0  : 4;            /*!< [23..20] Weight used for ULP mode I3C0                                    */
      __IOM uint32_t WTULPI3C1  : 4;            /*!< [27..24] Weight used for ULP mode I3C1                                    */
      __IOM uint32_t WTULPMSPI2 : 4;            /*!< [31..28] Weight used for ULP mode MSPI2                                   */
    } PWRWEIGHTULP3_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTULP4;               /*!< (@ 0x00000150) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTULPI2S0  : 4;            /*!< [3..0] Weight used for ULP mode I2S0                                      */
      __IOM uint32_t WTULPI2S1  : 4;            /*!< [7..4] Weight used for ULP mode I2S1                                      */
      __IOM uint32_t WTULPI2S2  : 4;            /*!< [11..8] Weight used for ULP mode I2S2                                     */
      __IOM uint32_t WTULPI2S3  : 4;            /*!< [15..12] Weight used for ULP mode I2S3                                    */
      __IOM uint32_t WTULPPDM0  : 4;            /*!< [19..16] Weight used for ULP mode PDM0                                    */
      __IOM uint32_t WTULPPDM1  : 4;            /*!< [23..20] Weight used for ULP mode PDM1                                    */
      __IOM uint32_t WTULPPDM2  : 4;            /*!< [27..24] Weight used for ULP mode PDM2                                    */
      __IOM uint32_t WTULPPDM3  : 4;            /*!< [31..28] Weight used for ULP mode PDM3                                    */
    } PWRWEIGHTULP4_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTULP5;               /*!< (@ 0x00000154) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTULPDISPPHY : 4;          /*!< [3..0] Weight used for ULP mode DISP PHY                                  */
      __IOM uint32_t WTULPUSBPHY : 4;           /*!< [7..4] Weight used for ULP mode USB PHY                                   */
            uint32_t            : 24;
    } PWRWEIGHTULP5_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP0;                /*!< (@ 0x00000158) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTLPMCU    : 4;            /*!< [3..0] Weight used for LP mode MCU                                        */
      __IOM uint32_t WTLPDSP0   : 4;            /*!< [7..4] Weight used for LP mode DSP0                                       */
      __IOM uint32_t WTLPDSP1   : 4;            /*!< [11..8] Weight used for LP mode DSP1                                      */
      __IOM uint32_t WTLPIOS    : 4;            /*!< [15..12] Weight used for LP mode IOS                                      */
      __IOM uint32_t WTLPUART0  : 4;            /*!< [19..16] Weight used for LP mode UART0                                    */
      __IOM uint32_t WTLPUART1  : 4;            /*!< [23..20] Weight used for LP mode UART1                                    */
      __IOM uint32_t WTLPUART2  : 4;            /*!< [27..24] Weight used for LP mode UART2                                    */
      __IOM uint32_t WTLPUART3  : 4;            /*!< [31..28] Weight used for LP mode UART3                                    */
    } PWRWEIGHTLP0_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP1;                /*!< (@ 0x0000015C) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTLPIOM0   : 4;            /*!< [3..0] Weight used for LP mode IOM0                                       */
      __IOM uint32_t WTLPIOM1   : 4;            /*!< [7..4] Weight used for LP mode IOM1                                       */
      __IOM uint32_t WTLPIOM2   : 4;            /*!< [11..8] Weight used for LP mode IOM2                                      */
      __IOM uint32_t WTLPIOM3   : 4;            /*!< [15..12] Weight used for LP mode IOM3                                     */
      __IOM uint32_t WTLPIOM4   : 4;            /*!< [19..16] Weight used for LP mode IOM4                                     */
      __IOM uint32_t WTLPIOM5   : 4;            /*!< [23..20] Weight used for LP mode IOM5                                     */
      __IOM uint32_t WTLPIOM6   : 4;            /*!< [27..24] Weight used for LP mode IOM6                                     */
      __IOM uint32_t WTLPIOM7   : 4;            /*!< [31..28] Weight used for LP mode IOM7                                     */
    } PWRWEIGHTLP1_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP2;                /*!< (@ 0x00000160) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

