AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t WTLPADC    : 4;            /*!< [3..0] Weight used for LP mode ADC                                        */
      __IOM uint32_t WTLPMSPI0  : 4;            /*!< [7..4] Weight used for LP mode MSPI0                                      */
      __IOM uint32_t WTLPMSPI1  : 4;            /*!< [11..8] Weight used for LP mode MSPI1                                     */
      __IOM uint32_t WTLPGFX    : 4;            /*!< [15..12] Weight used for LP mode GFX                                      */
      __IOM uint32_t WTLPDISP   : 4;            /*!< [19..16] Weight used for LP mode DISP                                     */
      __IOM uint32_t WTLPCRYPTO : 4;            /*!< [23..20] Weight used for LP mode CRYPTO                                   */
      __IOM uint32_t WTLPSDIO   : 4;            /*!< [27..24] Weight used for LP mode SDIO                                     */
      __IOM uint32_t WTLPUSB    : 4;            /*!< [31..28] Weight used for LP mode USB                                      */
    } PWRWEIGHTLP2_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP3;                /*!< (@ 0x00000164) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTLPDSPA   : 4;            /*!< [3..0] Weight used for LP mode DSPA                                       */
      __IOM uint32_t WTLPDBG    : 4;            /*!< [7..4] Weight used for LP mode DBG                                        */
      __IOM uint32_t WTLPAUDREC : 4;            /*!< [11..8] Weight used for LP mode AUDREC                                    */
      __IOM uint32_t WTLPAUDPB  : 4;            /*!< [15..12] Weight used for LP mode AUDPB                                    */
      __IOM uint32_t WTLPAUDADC : 4;            /*!< [19..16] Weight used for LP mode AUDADC                                   */
      __IOM uint32_t WTLPI3C0   : 4;            /*!< [23..20] Weight used for LP mode I3C0                                     */
      __IOM uint32_t WTLPI3C1   : 4;            /*!< [27..24] Weight used for LP mode I3C1                                     */
      __IOM uint32_t WTLPMSPI2  : 4;            /*!< [31..28] Weight used for LP mode MSPI2                                    */
    } PWRWEIGHTLP3_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP4;                /*!< (@ 0x00000168) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTLPI2S0   : 4;            /*!< [3..0] Weight used for LP mode I2S0                                       */
      __IOM uint32_t WTLPI2S1   : 4;            /*!< [7..4] Weight used for LP mode I2S1                                       */
      __IOM uint32_t WTLPI2S2   : 4;            /*!< [11..8] Weight used for LP mode I2S2                                      */
      __IOM uint32_t WTLPI2S3   : 4;            /*!< [15..12] Weight used for LP mode I2S3                                     */
      __IOM uint32_t WTLPPDM0   : 4;            /*!< [19..16] Weight used for LP mode PDM0                                     */
      __IOM uint32_t WTLPPDM1   : 4;            /*!< [23..20] Weight used for LP mode PDM1                                     */
      __IOM uint32_t WTLPPDM2   : 4;            /*!< [27..24] Weight used for LP mode PDM2                                     */
      __IOM uint32_t WTLPPDM3   : 4;            /*!< [31..28] Weight used for LP mode PDM3                                     */
    } PWRWEIGHTLP4_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP5;                /*!< (@ 0x0000016C) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTLPDISPPHY : 4;           /*!< [3..0] Weight used for LP mode DISP PHY                                   */
      __IOM uint32_t WTLPUSBPHY : 4;            /*!< [7..4] Weight used for LP mode USB PHY                                    */
            uint32_t            : 24;
    } PWRWEIGHTLP5_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP0;                /*!< (@ 0x00000170) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTHPMCU    : 4;            /*!< [3..0] Weight used for HP mode MCU                                        */
      __IOM uint32_t WTHPDSP0   : 4;            /*!< [7..4] Weight used for HP mode DSP0                                       */
      __IOM uint32_t WTHPDSP1   : 4;            /*!< [11..8] Weight used for HP mode DSP1                                      */
      __IOM uint32_t WTHPIOS    : 4;            /*!< [15..12] Weight used for HP mode IOS                                      */
      __IOM uint32_t WTHPUART0  : 4;            /*!< [19..16] Weight used for HP mode UART0                                    */
      __IOM uint32_t WTHPUART1  : 4;            /*!< [23..20] Weight used for HP mode UART1                                    */
      __IOM uint32_t WTHPUART2  : 4;            /*!< [27..24] Weight used for HP mode UART2                                    */
      __IOM uint32_t WTHPUART3  : 4;            /*!< [31..28] Weight used for HP mode UART3                                    */
    } PWRWEIGHTHP0_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP1;                /*!< (@ 0x00000174) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

