AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t ALM        : 1;            /*!< [0..0] RTC Alarm interrupt                                                */
            uint32_t            : 31;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< (@ 0x00000204) Read bits from this register to discover the
                                                                    cause of a recent interrupt.                               */

    struct {
      __IOM uint32_t ALM        : 1;            /*!< [0..0] RTC Alarm interrupt                                                */
            uint32_t            : 31;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< (@ 0x00000208) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t ALM        : 1;            /*!< [0..0] RTC Alarm interrupt                                                */
            uint32_t            : 31;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< (@ 0x0000020C) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

    struct {
      __IOM uint32_t ALM        : 1;            /*!< [0..0] RTC Alarm interrupt                                                */
            uint32_t            : 31;
    } INTSET_b;
  } ;
} RTC_Type;                                     /*!< Size = 528 (0x210)                                                        */



/* =========================================================================================================================== */
/* ================                                           SDIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SDIO Control Registers (SDIO)
  */

typedef struct {                                /*!< (@ 0x40070000) SDIO Structure                                             */

  union {
    __IOM uint32_t SDMA;                        /*!< (@ 0x00000000) SDMA system address                                        */

    struct {
      __IOM uint32_t SDMASYSTEMADDRESS : 32;    /*!< [31..0] This register contains the physical system memory address
                                                     used for DMA transfers or the second argument for the Auto
                                                     CMD23. (1) SDMA System Address This register contains the
                                                     system memory address for a SDMA transfer. When the Host
                                                     Controller stops a SDMA transfer, this register shall point
                                                     to the system address of the next contiguous data position.
                                                     It can be accessed only if no transaction is executing
                                                     (i.e., after a transaction has stopped). Read operations
                                                     during transfers may return an invalid value. T                           */
    } SDMA_b;
  } ;

  union {
    __IOM uint32_t BLOCK;                       /*!< (@ 0x00000004) Block size                                                 */

    struct {
      __IOM uint32_t TRANSFERBLOCKSIZE : 12;    /*!< [11..0] This register specifies the block size for block data
                                                     transfers for CMD17, CMD18, CMD24, CMD25, and CMD53. It
                                                     can be accessed only if no transaction is executing (i.e
                                                     after a transaction has stopped). Read operations during
                                                     transfer return an invalid value and write operations shall
                                                     be ignored.                                                               */
      __IOM uint32_t HOSTSDMABUFSZ : 3;         /*!< [14..12] To perform long DMA transfer, System Address register
                                                     shall be updated at every system boundary during DMA transfer.
                                                     These bits specify the size of contiguous buffer in the
                                                     system memory. The DMA transfer shall wait at the every
                                                     boundary specified by these fields and the HC generates
                                                     the DMA Interrupt to request the HD to update the System
                                                     Address register. These bits shall support when the DMA
                                                     Support in the Capabilities register is set to 1 and this
                                                     function is active when the DMA Enable in the Transfer
                                                                                                                               */
            uint32_t            : 1;
      __IOM uint32_t BLKCNT     : 16;           /*!< [31..16] This register is enabled when Block Count Enable in
                                                     the Transfer Mode register is set to 1 and is valid only
                                                     for multiple block transfers. The HC decrements the block
                                                     count after each block transfer and stops when the count
                                                     reaches zero. It can be accessed only if no transaction
                                                     is executing (i.e. after a transaction has stopped). Read
                                                     operations during transfer return an invalid value and
                                                     write operations shall be ignored. When saving transfer
                                                     context as a result of Suspend command, the number of blocks
                                                     y                                                                         */
    } BLOCK_b;
  } ;

  union {
    __IOM uint32_t ARGUMENT1;                   /*!< (@ 0x00000008) Argument1                                                  */

