AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t CLKEN      : 1;            /*!< [0..0] This bit is set to 0 when the HD is not using the HC
                                                     or the HC awaits a wakeup event. The HC should stop its
                                                     internal clock to go very low power state. Still, registers
                                                     shall be able to be read and written. Clock starts to oscillate
                                                     when this bit is set to 1. When clock oscillation is stable,
                                                     the HC shall set Internal Clock Stable in this register
                                                     to 1. This bit shall not affect card detection.                           */
      __IOM uint32_t CLKSTABLE  : 1;            /*!< [1..1] This bit is set to 1 when SD clock is stable after writing
                                                     to Internal Clock Enable in this register to 1. The SD
                                                     Host Driver shall wait to set SD Clock Enable until this
                                                     bit is set to 1. Note: This is useful when using PLL for
                                                     a clock oscillator that requires setup time.                              */
      __IOM uint32_t SDCLKEN    : 1;            /*!< [2..2] The HC shall stop SDCLK when writing this bit to 0. SDCLK
                                                     frequency Select can be changed when this bit is 0. Then,
                                                     the HC shall maintain the same clock frequency until SDCLK
                                                     is stopped (Stop at SDCLK = 0). If the HC detects the No
                                                     Card state, this bit shall be cleared.                                    */
            uint32_t            : 2;
      __IOM uint32_t CLKGENSEL  : 1;            /*!< [5..5] This bit is used to select the clock generator mode in
                                                     SDCLK Frequency Select. If the Programmable Clock Mode
                                                     is supported (non-zero value is set to Clock Multiplier
                                                     in the Capabilities register), this bit attribute is RW,
                                                     and if not supported, this bit attribute is RO and zero
                                                     is read. This bit depends on the setting of Preset Value
                                                     Enable in the Host Control 2 register. If the Preset Value
                                                     Enable = 0, this bit is set by Host Driver. If the Preset
                                                     Value Enable = 1, this bit is automatically set to a value                */
      __IOM uint32_t UPRCLKDIV  : 2;            /*!< [7..6] Bit 07-06 is assigned to bit 09-08 of clock divider in
                                                     SDCLK Frequency Select                                                    */
      __IOM uint32_t FREQSEL    : 8;            /*!< [15..8] This register is used to select the frequency of the
                                                     SDCLK pin. The frequency is not programmed directly; rather
                                                     this register holds the divisor of the Base Clock Frequency
                                                     For SD clock in the capabilities register. Only the following
                                                     settings are allowed. (1) 8-bit Divided Clock Mode Setting
                                                     00h specifies the highest frequency of the SD Clock. When
                                                     setting multiple bits, the most significant bit is used
                                                     as the divisor. But multiple bits should not be set. The
                                                     two default divider values can be calculated b                            */
      __IOM uint32_t TIMEOUTCNT : 4;            /*!< [19..16] This value determines the interval by which DAT line
                                                     time-outs are detected. Refer to the Data Time-out Error
                                                     in the Error Interrupt Status register for information
                                                     on factors that dictate time-out generation. Time-out clock
                                                     frequency will be generated by dividing the sdclockTMCLK
                                                     by this value. When setting this register, prevent inadvertent
                                                     time-out events by clearing the Data Time-out Error Status
                                                     Enable (in the Error Interrupt Status Enable register)
                                                     At the initialization of the HC, the HD shall set th                      */
            uint32_t            : 4;
      __IOM uint32_t SWRSTALL   : 1;            /*!< [24..24] This reset affects the entire HC except for the card
                                                     detection circuit. Register bits of type ROC, RW, RW1C,
                                                     RWAC are cleared to 0. During its initialization, the HD
                                                     shall set this bit to 1 to reset the HC. The HC shall reset
                                                     this bit to 0 when capabilities registers are valid and
                                                     the HD can read them. Additional use of Software Reset
                                                     For All may not affect the value of the Capabilities registers.
                                                     If this bit is set to 1, the SD card shall reset itself
                                                     and must be re initialized by the HD. A reset pulse is                    */
      __IOM uint32_t SWRSTCMD   : 1;            /*!< [25..25] Only part of command circuit is reset. The following
                                                     registers and bits are cleared by this bit: Present State
                                                     register Command Inhibit (CMD) Normal Interrupt Status
                                                     register Command Complete                                                 */
      __IOM uint32_t SWRSTDAT   : 1;            /*!< [26..26] Only part of data circuit is reset. The following registers
                                                     and bits are cleared by this bit: Buffer Data Port Register
                                                     Buffer is cleared and Initialized. Present State register
                                                     Buffer read Enable Buffer write Enable Read Transfer Active
                                                     Write Transfer Active DAT Line Active Command Inhibit (DAT)
                                                     Block Gap Control register Continue Request Stop At Block
                                                     Gap Request Normal Interrupt Status register Buffer Read
                                                     Ready Buffer Write Ready Block Gap Event Transfer Complete                */
            uint32_t            : 5;
    } CLOCKCTRL_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< (@ 0x00000030) Interrupt enable                                           */

