AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t TMR8ASYNC  : 1;            /*!< [0..0] Indicates the timer should be run directly on the source
                                                     clock. When this bit is set, the timer is not synchronous
                                                     to the bus allowing for low-jitter clock output operations.               */
            uint32_t            : 7;
      __IOM uint32_t TMR8TRIGSEL : 8;           /*!< [15..8] Counter/Timer 8 Trigger Source Selection                          */
            uint32_t            : 16;
    } MODE8_b;
  } ;
  __IM  uint32_t  RESERVED13[3];

  union {
    __IOM uint32_t CTRL9;                       /*!< (@ 0x00000320) This includes the Control bit fields for timer
                                                                    9.                                                         */

    struct {
      __IOM uint32_t TMR9EN     : 1;            /*!< [0..0] Counter/Timer 9 Enable bit.                                        */
      __IOM uint32_t TMR9CLR    : 1;            /*!< [1..1] Counter/Timer Clear bit.                                           */
      __IOM uint32_t TMR9POL0   : 1;            /*!< [2..2] Counter/Timer 9 output 0 polarity.                                 */
      __IOM uint32_t TMR9POL1   : 1;            /*!< [3..3] Counter/Timer 9 output 1 polarity.                                 */
      __IOM uint32_t TMR9FN     : 4;            /*!< [7..4] Counter/Timer 9 Function Select.                                   */
      __IOM uint32_t TMR9CLK    : 8;            /*!< [15..8] Counter/Timer 9 Clock Select.                                     */
      __IOM uint32_t TMR9TMODE  : 2;            /*!< [17..16] Counter/Timer 9 Trigger Mode                                     */
            uint32_t            : 6;
      __IOM uint32_t TMR9LMT    : 8;            /*!< [31..24] Counter/Timer 9 Pattern Limit Count.                             */
    } CTRL9_b;
  } ;

  union {
    __IOM uint32_t TIMER9;                      /*!< (@ 0x00000324) This register holds the running time or event
                                                                    count for timer 9.                                         */

    struct {
      __IOM uint32_t TIMER9     : 32;           /*!< [31..0] Counter/Timer 9                                                   */
    } TIMER9_b;
  } ;

  union {
    __IOM uint32_t TMR9CMP0;                    /*!< (@ 0x00000328) This contains the Compare limits for timer 9.
                                                                    This is the primary comparator that can
                                                                    be used to mark the END of a timer cycle
                                                                    (and thus restart the timer for repeat modes)              */

    struct {
      __IOM uint32_t TMR9CMP0   : 32;           /*!< [31..0] Counter/Timer 9 End Compare Register. For MEASURE mode
                                                     indicates the high phase sample count.                                    */
    } TMR9CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR9CMP1;                    /*!< (@ 0x0000032C) This comparator is used as a secondary compare
                                                                    count for modes that generate pulses. For
                                                                    MEASURE mode indicates the low phase sample
                                                                    count.                                                     */

    struct {
      __IOM uint32_t TMR9CMP1   : 32;           /*!< [31..0] Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR9CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE9;                       /*!< (@ 0x00000330) The mode register contains optional mode controls
                                                                    for the timer                                              */

    struct {
      __IOM uint32_t TMR9ASYNC  : 1;            /*!< [0..0] Indicates the timer should be run directly on the source
                                                     clock. When this bit is set, the timer is not synchronous
                                                     to the bus allowing for low-jitter clock output operations.               */
            uint32_t            : 7;
      __IOM uint32_t TMR9TRIGSEL : 8;           /*!< [15..8] Counter/Timer 9 Trigger Source Selection                          */
            uint32_t            : 16;
    } MODE9_b;
  } ;
  __IM  uint32_t  RESERVED14[3];

  union {
    __IOM uint32_t CTRL10;                      /*!< (@ 0x00000340) This includes the Control bit fields for timer
                                                                    10.                                                        */

    struct {
      __IOM uint32_t TMR10EN    : 1;            /*!< [0..0] Counter/Timer 10 Enable bit.                                       */
      __IOM uint32_t TMR10CLR   : 1;            /*!< [1..1] Counter/Timer Clear bit.                                           */
      __IOM uint32_t TMR10POL0  : 1;            /*!< [2..2] Counter/Timer 10 output 0 polarity.                                */
      __IOM uint32_t TMR10POL1  : 1;            /*!< [3..3] Counter/Timer 10 output 1 polarity.                                */
      __IOM uint32_t TMR10FN    : 4;            /*!< [7..4] Counter/Timer 10 Function Select.                                  */
      __IOM uint32_t TMR10CLK   : 8;            /*!< [15..8] Counter/Timer 10 Clock Select.                                    */
      __IOM uint32_t TMR10TMODE : 2;            /*!< [17..16] Counter/Timer 10 Trigger Mode                                    */
            uint32_t            : 6;
      __IOM uint32_t TMR10LMT   : 8;            /*!< [31..24] Counter/Timer 10 Pattern Limit Count.                            */
    } CTRL10_b;
  } ;

  union {
    __IOM uint32_t TIMER10;                     /*!< (@ 0x00000344) This register holds the running time or event
                                                                    count for timer 10.                                        */

