AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t TMR14ASYNC : 1;            /*!< [0..0] Indicates the timer should be run directly on the source
                                                     clock. When this bit is set, the timer is not synchronous
                                                     to the bus allowing for low-jitter clock output operations.               */
            uint32_t            : 7;
      __IOM uint32_t TMR14TRIGSEL : 8;          /*!< [15..8] Counter/Timer 14 Trigger Source Selection                         */
            uint32_t            : 16;
    } MODE14_b;
  } ;
  __IM  uint32_t  RESERVED19[3];

  union {
    __IOM uint32_t CTRL15;                      /*!< (@ 0x000003E0) This includes the Control bit fields for timer
                                                                    15.                                                        */

    struct {
      __IOM uint32_t TMR15EN    : 1;            /*!< [0..0] Counter/Timer 15 Enable bit.                                       */
      __IOM uint32_t TMR15CLR   : 1;            /*!< [1..1] Counter/Timer Clear bit.                                           */
      __IOM uint32_t TMR15POL0  : 1;            /*!< [2..2] Counter/Timer 15 output 0 polarity.                                */
      __IOM uint32_t TMR15POL1  : 1;            /*!< [3..3] Counter/Timer 15 output 1 polarity.                                */
      __IOM uint32_t TMR15FN    : 4;            /*!< [7..4] Counter/Timer 15 Function Select.                                  */
      __IOM uint32_t TMR15CLK   : 8;            /*!< [15..8] Counter/Timer 15 Clock Select.                                    */
      __IOM uint32_t TMR15TMODE : 2;            /*!< [17..16] Counter/Timer 15 Trigger Mode                                    */
            uint32_t            : 6;
      __IOM uint32_t TMR15LMT   : 8;            /*!< [31..24] Counter/Timer 15 Pattern Limit Count.                            */
    } CTRL15_b;
  } ;

  union {
    __IOM uint32_t TIMER15;                     /*!< (@ 0x000003E4) This register holds the running time or event
                                                                    count for timer 15.                                        */

    struct {
      __IOM uint32_t TIMER15    : 32;           /*!< [31..0] Counter/Timer 15                                                  */
    } TIMER15_b;
  } ;

  union {
    __IOM uint32_t TMR15CMP0;                   /*!< (@ 0x000003E8) This contains the Compare limits for timer 15.
                                                                    This is the primary comparator that can
                                                                    be used to mark the END of a timer cycle
                                                                    (and thus restart the timer for repeat modes)              */

    struct {
      __IOM uint32_t TMR15CMP0  : 32;           /*!< [31..0] Counter/Timer 15 End Compare Register. For MEASURE mode
                                                     indicates the high phase sample count.                                    */
    } TMR15CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR15CMP1;                   /*!< (@ 0x000003EC) This comparator is used as a secondary compare
                                                                    count for modes that generate pulses. For
                                                                    MEASURE mode indicates the low phase sample
                                                                    count.                                                     */

    struct {
      __IOM uint32_t TMR15CMP1  : 32;           /*!< [31..0] Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR15CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE15;                      /*!< (@ 0x000003F0) The mode register contains optional mode controls
                                                                    for the timer                                              */

    struct {
      __IOM uint32_t TMR15ASYNC : 1;            /*!< [0..0] Indicates the timer should be run directly on the source
                                                     clock. When this bit is set, the timer is not synchronous
                                                     to the bus allowing for low-jitter clock output operations.               */
            uint32_t            : 7;
      __IOM uint32_t TMR15TRIGSEL : 8;          /*!< [15..8] Counter/Timer 15 Trigger Source Selection                         */
            uint32_t            : 16;
    } MODE15_b;
  } ;
} TIMER_Type;                                   /*!< Size = 1012 (0x3f4)                                                       */



/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial UART (UART0)
  */

typedef struct {                                /*!< (@ 0x4001C000) UART0 Structure                                            */

  union {
    __IOM uint32_t DR;                          /*!< (@ 0x00000000) UART Data                                                  */

    struct {
      __IOM uint32_t DATA       : 8;            /*!< [7..0] This is the UART data port.                                        */
      __IOM uint32_t FEDATA     : 1;            /*!< [8..8] This is the framing error indicator.                               */
      __IOM uint32_t PEDATA     : 1;            /*!< [9..9] This is the parity error indicator.                                */
      __IOM uint32_t BEDATA     : 1;            /*!< [10..10] This is the break error indicator.                               */
      __IOM uint32_t OEDATA     : 1;            /*!< [11..11] This is the overrun error indicator.                             */
            uint32_t            : 20;
    } DR_b;
  } ;

  union {
    __IOM uint32_t RSR;                         /*!< (@ 0x00000004) UART Status                                                */

