AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t BF00       : 1;            /*!< [0..0] All port z bypass value. 1'b1: bypass enable 1'b0:bypass
                                                     disable                                                                   */
      __IOM uint32_t BF11       : 1;            /*!< [1..1] This bitfield is reserved.                                         */
      __IOM uint32_t BF22       : 1;            /*!< [2..2] HS keep alive enable. 1'b1: HS keep alive enable 1'b0:
                                                     HS keep alive disable                                                     */
      __IOM uint32_t BF33       : 1;            /*!< [3..3] This bitfield is reserved.                                         */
      __IOM uint32_t BF44       : 1;            /*!< [4..4] This bitfield is reserved.                                         */
      __IOM uint32_t BF75       : 3;            /*!< [7..5] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG2C_b;
  } ;

  union {
    __IOM uint32_t REG30;                       /*!< (@ 0x00000030) Register description here                                  */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG30_b;
  } ;

  union {
    __IOM uint32_t REG34;                       /*!< (@ 0x00000034) Register description here                                  */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] FIXME (description needed).                                        */
            uint32_t            : 24;
    } REG34_b;
  } ;

  union {
    __IOM uint32_t REG38;                       /*!< (@ 0x00000038) Register description here                                  */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG38_b;
  } ;

  union {
    __IOM uint32_t REG3C;                       /*!< (@ 0x0000003C) Register description here                                  */

    struct {
      __IOM uint32_t BF10       : 2;            /*!< [1..0] FIXME (description needed).                                        */
      __IOM uint32_t BF42       : 3;            /*!< [4..2] This bitfield is reserved.                                         */
      __IOM uint32_t BF75       : 3;            /*!< [7..5] Host disconnect filter select. 3'b100:6 clocks(480M clock)
                                                     3'b101:8 clocks 3'b111:disconnect disable Other: invalid                  */
            uint32_t            : 24;
    } REG3C_b;
  } ;

  union {
    __IOM uint32_t REG40;                       /*!< (@ 0x00000040) Register description here                                  */

    struct {
      __IOM uint32_t BF60       : 7;            /*!< [6..0] This bitfield is reserved.                                         */
      __IOM uint32_t BF77       : 1;            /*!< [7..7] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG40_b;
  } ;

  union {
    __IOM uint32_t REG44;                       /*!< (@ 0x00000044) Register description here                                  */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< [0..0] 1: DP/DM will be sampled in HS Tx or Rx state 0: DP/DM
                                                     will be sampled only in Hs Rx state                                       */
      __IOM uint32_t BF11       : 1;            /*!< [1..1] Disconnect squelch and comparator calibration bypass,
                                                     active high                                                               */
      __IOM uint32_t BF42       : 3;            /*!< [4..2] This bitfield is reserved.                                         */
      __IOM uint32_t BF65       : 2;            /*!< [6..5] This bitfield is reserved.                                         */
      __IOM uint32_t BF77       : 1;            /*!< [7..7] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG44_b;
  } ;

  union {
    __IOM uint32_t REG48;                       /*!< (@ 0x00000048) Register description here                                  */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< [0..0] Enable TX shutdown, active LOW. This bit is only used
                                                     for debug purpose , nothing to do with the normal operation
                                                     and signal quality, keeping the default value is strongly
                                                     recommended.                                                              */
      __IOM uint32_t BF71       : 7;            /*!< [7..1] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG48_b;
  } ;

  union {
    __IOM uint32_t REG4C;                       /*!< (@ 0x0000004C) Register description here                                  */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG4C_b;
  } ;

  union {
    __IOM uint32_t REG50;                       /*!< (@ 0x00000050) Register description here                                  */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG50_b;
  } ;

  union {
    __IOM uint32_t REG54;                       /*!< (@ 0x00000054) Register description here                                  */

