AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t FRMNUM     : 16;           /*!< [15..0] Read-only field containing the last received frame number
                                                     in bits 10:0, 15:11 read 0.                                               */
      __IOM uint32_t ENDPOINT   : 4;            /*!< [19..16] Index selected endpoint.                                         */
            uint32_t            : 4;
      __IOM uint32_t TestSE0NAK : 1;            /*!< [24..24] The remains in high-speed mode and responds to any
                                                     valid IN token with a NAK Bits D0 - D3 select one of the
                                                     four USB 2.0 Test Modes (see Section 10: 'Testmodes') Bits
                                                     D4 and D5 select MUSBHSFC-specific test modes used in the
                                                     supplied testbenches Note: Only one of Bits D0 - D5 should
                                                     be set at any time 2 . 3 . I N D E X E D R E G I S T E
                                                     R Note: The action of the following registers when the
                                                     selected endpoint has not been configured is undefined                    */
      __IOM uint32_t TestJ      : 1;            /*!< [25..25] The CPU sets this bit to enter the Test_J test mode.
                                                     In this mode, the MUSBHSFC - in high-speed mode - transmits
                                                     a continuous J on the bus                                                 */
      __IOM uint32_t TestK      : 1;            /*!< [26..26] The CPU sets this bit to enter the Test_K test mode.
                                                     In this mode, the MUSBHSFC - in high-speed mode - transmits
                                                     a continuous K on the bus                                                 */
      __IOM uint32_t TestPacket : 1;            /*!< [27..27] The CPU sets this bit to enter the Test_Packet test
                                                     mode. In this mode, the MUSBHSFC - in high- speed mode
                                                     - repetitively transmits on the bus a 53-byte test packet,
                                                     the form of which is defined in Section 11.4. Note: The
                                                     53-byte test packet must be loaded into the Endpoint 0
                                                     FIFO before the test mode is entered                                      */
      __IOM uint32_t ForceHS    : 1;            /*!< [28..28] The CPU sets this bit to force the MUSBHSFC into High-speed
                                                     mode when it receives a USB reset.                                        */
      __IOM uint32_t ForceFS    : 1;            /*!< [29..29] The CPU sets this bit to force the MUSBHSFC into Full-speed
                                                     mode when it receives a USB reset.                                        */
            uint32_t            : 2;
    } CFG3_b;
  } ;

  union {
    __IOM uint32_t IDX0;                        /*!< (@ 0x00000010) InCSRU is an 8-bit register that provides additional
                                                                    control for IN transactions through the
                                                                    currently-selected endpoint. The address
                                                                    for the INCSRL register is actually the
                                                                    same as CSR0. However to avoid CMSIS conflicts,
                                                                    the address here includes an additional
                                                                    offset of 0x1000. Access to this register
                                                                    must take this into account.) InCSRL is
                                                                    a 8-bit register that provides control and
                                                                    status bits for IN transactions through
                                                                    the currently-selected endpoint. Note: Users
                                                                    should be aware that th                                    */

    struct {
      __IOM uint32_t MAXPAYLOAD : 11;           /*!< [10..0] Maximum payload transmitted in a single transaction.              */
      __IOM uint32_t PKTSPLITOPTION : 5;        /*!< [15..11] Implementation specific.                                         */
      __IOM uint32_t InPktRdyOutPktRdy : 1;     /*!< [16..16] The CPU sets this bit after loading a data packet into
                                                     the FIFO. It is cleared automatically when a data packet
                                                     has been transmitted. If the FIFO is double-buffered, it
                                                     is also automatically cleared when there is space for a
                                                     second packet in the FIFO (see Section 9.2). An interrupt
                                                     is generate (if enabled) when the bit is cleared (suppressed
                                                     by the built-in DMA controller in DMA Mode 1). When Index=0,
                                                     this bit serves as the OutPkyRdy bit: This bit is set when
                                                     a data packet has been received. An interrupt i                           */
      __IOM uint32_t FIFONotEmptyInPktRdy : 1;  /*!< [17..17] This bit is set when there is at least 1 packet in
                                                     the IN FIFO. When Index=0, this bit serves as the InPktRdy
                                                     bit: The CPU sets this bit after loading a data packet
                                                     into the FIFO. It is cleared automatically when the data
                                                     packet has been transmitted. An interrupt is generated
                                                     when this bit is cleared (if enabled).                                    */
      __IOM uint32_t UnderRunSentStall : 1;     /*!< [18..18] In ISO mode, this bit is set when a zero length data
                                                     packet is sent after receiving an IN token with the InPktRdy
                                                     bit not set. In Bulk/Interrupt mode, this bit is set when
                                                     a NAK is returned i response to an IN token. The CPU should
                                                     clear this bit. When Index=0, this bit serves as the SentStall
                                                     bit: This bit is set when a STALL handshake is transmitted.
                                                     The CPU should clear this bit.                                            */
      __IOM uint32_t FlushFIFODataEnd : 1;      /*!< [19..19] The CPU writes a 1 to this bit to flush the next packet
                                                     to be transmitted from the endpoint IN FIFO. The FIFO pointer
                                                     is reset and the InPktRdy bit (below) is cleared. May be
                                                     set simultaneousl with InPktRdy to abort the packet that
                                                     has just been loaded into the FIFO. Note: (i) FlushFIFO
                                                     shoul only be set when InPktRdy is set (at other times,
                                                     it may cause data corruption). (ii) If the FIFO contains
                                                     two packets FlushFIFO may need to be set twice to completely
                                                     clear the FIFO. When Index=0, this bit serves as                          */
      __IOM uint32_t SendStallSetupEnd : 1;     /*!< [20..20] The CPU writes a 1 to this bit to issue a STALL handshake
                                                     to an IN token. The CPU clears this bit to terminate the
                                                     stall condition. Note: This bit has no effect where the
                                                     endpoint is being used for Isochronous transfers. When
                                                     Index=0, this bit will be set when a control transaction
                                                     ends before the DataEnd bit has been set. An interrupt
                                                     will be generated and the FIFO flushed at this time. The
                                                     bit is cleared by the CPU writing a 1 to the ServicedSetupEnd
                                                     bit.                                                                      */
      __IOM uint32_t SentStallSendStall : 1;    /*!< [21..21] This bit is set when a STALL handshake is transmitted.
                                                     The FIFO is flushed and the InPktRdy bit is cleared (see
                                                     below). The CPU should clear this bit. When Index=0, this
                                                     bit serves as the SendStall function: The CPU writes a
                                                     1 to this bit to terminate the current transaction. The
                                                     STALL handshake will be transmitted and then this bit will
                                                     be cleared automatically. Note: This behavior differs from
                                                     that of the SendStall bits associated with additional IN/OUT
                                                     endpoints, which need to be cleared by the CPU.                           */
      __IOM uint32_t ClrDataTogServicedOutPktRdy : 1;/*!< [22..22] The CPU writes a 1 to this bit to reset the endpoint
                                                     IN data toggle to 0. When Index=0, this bit serves as the
                                                     ServicedOutPktReady bit: The CPU writes a 1 to this bit
                                                     to clear the OutPktRdy bit. It is cleared automatically.                  */
      __IOM uint32_t IncompTxServiceSetupEnd : 1;/*!< [23..23] When indicate where a large packet has been split into
                                                     2 or 3 packets for transmission but insufficient I tokens
                                                     have been received to send all the parts. The remainder
                                                     of the current packet is then flushed from the FIFO (but
                                                     any second packet in the FIFO will remain). Note: In anything
                                                     other than a high bandwidth Isochronous transfer, this
                                                     bit will always return 0. When Index=0, this bit serves
                                                     as the ServiceSetupEnd: The CPU writes a 1 to this bit
                                                     to clear the SetupEnd bit. It is cleared automatically.                   */
      __IOM uint32_t D0         : 1;            /*!< [24..24] Unused, always return 0.                                         */
      __IOM uint32_t DPktBufDis : 1;            /*!< [25..25] This bit is used to control the use of enabled 1b -
                                                     Disable Double packet buffering, regardless of the End
                                                     Point Fifo Size and INMAXP size relationship 0b - Enable
                                                     Double packet buffering. This bit does NOT necessarily
                                                     enable double packet buffering but rather allows double
                                                     packet buffering to be determined by the End Point Fifo
                                                     Size and INMAXP size relationship. See Section Error! Reference
                                                     source not found. for details Default is enabled                          */
      __IOM uint32_t DMAReqMode : 1;            /*!< [26..26] The CPU sets this bit to select DMA Request Mode 1
                                                     and clears it to select DMA Request Mode 0. Note: This
                                                     bit must not be cleared either before or in the same cycle
                                                     as the above DMAReqEnab bit is cleared                                    */
      __IOM uint32_t FrcDataTog : 1;            /*!< [27..27] The CPU sets this bit to force the endpoint's IN data
                                                     toggle to switch after each data packet is sent regardless
                                                     of whether an ACK was received. This can be used by Interrupt
                                                     IN endpoints that are used to communicate rate feedback
                                                     for Isochronous endpoints                                                 */
      __IOM uint32_t DMAReqEnab : 1;            /*!< [28..28] The CPU sets this bit to enable the DMA request for
                                                     the IN endpoint.                                                          */
      __IOM uint32_t Mode       : 1;            /*!< [29..29] The CPU sets this bit to enable the endpoint direction
                                                     as IN, and clears it to enable the endpoint direction as
                                                     OUT. Note: Only valid where the endpoint FIFO is used for
                                                     both IN and OUT transactions otherwise ignored                            */
      __IOM uint32_t ISO        : 1;            /*!< [30..30] The CPU sets this bit to enable the IN endpoint for
                                                     Isochronous transfers (ISO mode), and clears it to enable
                                                     the IN endpoint for Bulk/Interrupt transfers                              */
      __IOM uint32_t AutoSet    : 1;            /*!< [31..31] If (as set in InMaxP) is loaded into the IN FIFO. If
                                                     a packet of less than the maximum packet size is loaded,
                                                     InPktRdy will have to be set manually. Note: Should not
                                                     be set for high-bandwidth Isochronous endpoints                           */
    } IDX0_b;
  } ;

  union {
    __IOM uint32_t IDX1;                        /*!< (@ 0x00000014) OutCSRU is a 8-bit register that provides control
                                                                    and status bits for OUT transactions through
                                                                    the currently-selected endpoint. OUTCSRL
                                                                    is a 8-bit register that provides control
                                                                    and status bits for OUT transactions through
                                                                    the currently-selected endpoint. It is reset
                                                                    to 0. Note: Users should be aware that the
                                                                    value returned when the register is read
                                                                    reflects the status attained e.g. as a result
                                                                    of writing to the register. The OutMaxP
                                                                    register defines the maximum amount of data
                                                                    that can be tr                                             */

