AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t MAXPAYLOAD : 11;           /*!< [10..0] Maximum payload transmitted in a single transaction.              */
      __IOM uint32_t PKTSPLITOPTION : 5;        /*!< [15..11] Implementation specific.                                         */
      __IOM uint32_t OutPktRdy  : 1;            /*!< [16..16] This bit is set when a data packet has been received.
                                                     The CPU should clear this bit when the packet has been
                                                     unloaded from the OUT FIFO. An interrupt is generated (if
                                                     enabled) when the bit is set                                              */
      __IOM uint32_t FIFOFull   : 1;            /*!< [17..17] This bit is set when no more packets can be loaded
                                                     into the OUT FIFO.                                                        */
      __IOM uint32_t OverRun    : 1;            /*!< [18..18] This bit is set if into the OUT FIFO. The CPU should
                                                     clear this bit. Note: This bit is only valid when the endpoint
                                                     is operating in ISO mode. In Bulk mode, it always returns
                                                     zero                                                                      */
      __IOM uint32_t DataError  : 1;            /*!< [19..19] This cleared when OutPktRdy is cleared. Note: This
                                                     bit is only valid when the endpoint is operating in ISO
                                                     mode. I Bulk mode, it always returns zero                                 */
      __IOM uint32_t FlushFIFO  : 1;            /*!< [20..20] The CPU writes a 1 to this bit to flush the next packet
                                                     to be read from the endpoint OUT FIFO. The FIFO pointer
                                                     is reset and the OutPktRdy bit (below) is cleared. Note:
                                                     FlushFIFO should only b used when OutPktRdy is set. At
                                                     other times, it may cause data to be corrupted. Note also
                                                     that, if the FIFO i double-buffered, FlushFIFO may need
                                                     to be set twice to completely clear the FIFO                              */
      __IOM uint32_t SendStall  : 1;            /*!< [21..21] The CPU writes a 1 to this bit to issue a STALL handshake
                                                     to a DATA packet. The CPU clears this bit to terminate
                                                     the stall condition. Note: This bit has no effect where
                                                     the endpoint is being used for Isochronous transfers                      */
      __IOM uint32_t SentStall  : 1;            /*!< [22..22] This bit is set when a STALL handshake is transmitted.
                                                     The CPU should clear this bit.                                            */
      __IOM uint32_t ClrDataTog : 1;            /*!< [23..23] The CPU writes a 1 to this bit to reset the endpoint
                                                     data toggle to 0.                                                         */
      __IOM uint32_t IncompRx   : 1;            /*!< [24..24] This bit is set in a high-bandwidth Isochronous transfer
                                                     if because parts of the data were not received. It is cleared
                                                     when OutPktRdy is cleared. Note: In anything other than
                                                     a high-bandwidth Isochronous transfer, this bit will always
                                                     return 0                                                                  */
      __IOM uint32_t DPktBufDis : 1;            /*!< [25..25] This bit is used to control the use of enabled 1b -
                                                     Disable Double packet buffering, regardless of the End
                                                     Point Fifo Size and OUTMAXP size relationship 0b - Enable
                                                     Double packet buffering. This bit does NOT necessarily
                                                     enable double packet buffering but rather allows double
                                                     packet buffering to be determined by the End Point Fifo
                                                     Size and OUTMAXP size relationship. See Section Error!
                                                     Reference source not found. for details Default is enabled                */
      __IOM uint32_t D2         : 1;            /*!< [26..26] Unused, always return 0.                                         */
      __IOM uint32_t DMAReqMode : 1;            /*!< [27..27] Two request is generated for all received packets;
                                                     and DMA Request Mode 1 in which a DMA request (bu no interrupt)
                                                     is generated for OUT packets of size OutMaxP bytes and
                                                     an interrupt (but no DM request) is generated for OUT packets
                                                     of any other size. The CPU sets this bit to select DMA
                                                     Request Mode 1 and clears this bit to select DMA Request
                                                     Mode 0                                                                    */
      __IOM uint32_t DisNye     : 1;            /*!< [28..28] Bulk/Interrupt Transactions: The CPU sets this bit
                                                     to disable the sending of NYET handshakes When set, all
                                                     successfully received OUT packets are ACK'd including at
                                                     the point at which th FIFO becomes full. Note: This bit
                                                     only has any effect in High-speed mode, in which mode it
                                                     should be set for al Interrupt endpoints PID Error ISO
                                                     Transactions: The core sets this bit to indicate a PID
                                                     error in the received packet                                              */
      __IOM uint32_t DMAReqEnab : 1;            /*!< [29..29] The CPU sets this bit to enable the DMA request for
                                                     the OUT endpoint.                                                         */
      __IOM uint32_t ISO        : 1;            /*!< [30..30] The CPU sets this bit to enable the OUT endpoint for
                                                     Isochronous transfers, and clears it to enable the OUT
                                                     endpoint for Bulk/Interrupt transfers                                     */
      __IOM uint32_t AutoClear  : 1;            /*!< [31..31] If OutMaxP bytes has been unloaded from the OUT FIFO.
                                                     When packets of less than the maximu packet size are unloaded,
                                                     OutPktRdy will have to be cleared manually. Note: Should
                                                     not be set for high bandwidth Isochronous endpoints Remainde
                                                     (OutMaxP/4 0 (i.e. OutMaxP = 64 bytes) OUTMAXP OUTMAXP,
                                                     OUTMAXP-1 OUTMAXP-2, OUTMAXP- 3 (i.e. OutMaxP = 63 bytes)
                                                     OUTMAXP+1 OUTMAXP, OUTMAXP-1 Packet Sizes that will clea
                                                     OutPktRdy Actual Byte Rea 2 (i.e. OutMaxP = 62 bytes) OUTMAXP+2
                                                     OUTMAXP, OUTMAXP- 1 (i.e. OutMaxP = 61 by                                 */
    } IDX1_b;
  } ;

  union {
    __IOM uint32_t IDX2;                        /*!< (@ 0x00000018) This register contains the outcount value for
                                                                    number of received bytes in the packet in
                                                                    the OUT FIFO. This register also includes
                                                                    the configurable IN and OUT Endpoint FIFO
                                                                    size.                                                      */

