AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t ENDPTOUTCOUNT : 13;        /*!< [12..0] When Index!=0, OutCount is a 13-bit read-only register
                                                     that holds the number of received data bytes in the packet
                                                     in the OUT FIFO. When Index=0 : 7-bit data for Endpoint
                                                     0 OUT count. (IMPORTANT: The address for the OUTCOUNT register
                                                     is actually the same as COUNT0. However to avoid CMSIS
                                                     conflicts, the address here includes an additional offset
                                                     of 0x1000. Access to this register must take this into
                                                     account.) OutCount is a 13-bit read-only register that
                                                     holds the number of received data bytes in the packet                     */
            uint32_t            : 3;
      __IOM uint32_t INFIFOSZ   : 5;            /*!< [20..16] This is a 5-bit register which controls the size of
                                                     the selected IN endpoint FIFO. BIT4 of this field defines
                                                     whether double-packet buffering supported. When '1', double-packet
                                                     buffering is supported. When '0', only single-packet buffering
                                                     is supported. Bits [3:0] of this field determine maximum
                                                     packet size to be allowed for (before any splitting within
                                                     the FIFO of Bulk/HighBandwidth packets prior to transmission.             */
            uint32_t            : 3;
      __IOM uint32_t OUTFIFOSZ  : 5;            /*!< [28..24] This is a 5-bit register which controls the size of
                                                     the selected OUT endpoint FIFO. BIT4 of this field defines
                                                     whether double-packet buffering supported. When '1', double-packet
                                                     buffering is supported. When '0', only single-packet buffering
                                                     is supported. Bits [3:0] of this field determine maximum
                                                     packet size to be allowed for (before any splitting within
                                                     the FIFO of Bulk/HighBandwidth packets prior to transmission.             */
            uint32_t            : 3;
    } IDX2_b;
  } ;

  union {
    __IOM uint32_t FIFOADD;                     /*!< (@ 0x0000001C) Register which controls the start address of
                                                                    the selected IN and OUT endpoint FIFOs                     */

    struct {
      __IOM uint32_t INFIFOADD  : 13;           /*!< [12..0] INFIFOADD is a 13-bit register which controls the start
                                                     address of the selected IN endpoint FIFO.                                 */
            uint32_t            : 3;
      __IOM uint32_t OUTFIFOADD : 13;           /*!< [28..16] OUTFIFOADD is a 13-bit register which controls the
                                                     start address of the selected OUT endpoint FIFO.                          */
            uint32_t            : 3;
    } FIFOADD_b;
  } ;

  union {
    __IOM uint32_t FIFO0;                       /*!< (@ 0x00000020) Endpoint 0 FIFO register                                   */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Single bitfield register.                                         */
    } FIFO0_b;
  } ;

  union {
    __IOM uint32_t FIFO1;                       /*!< (@ 0x00000024) Endpoint 0 FIFO register                                   */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Single bitfield register.                                         */
    } FIFO1_b;
  } ;

  union {
    __IOM uint32_t FIFO2;                       /*!< (@ 0x00000028) Endpoint 0 FIFO register                                   */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Single bitfield register.                                         */
    } FIFO2_b;
  } ;

  union {
    __IOM uint32_t FIFO3;                       /*!< (@ 0x0000002C) Endpoint 0 FIFO register                                   */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Single bitfield register.                                         */
    } FIFO3_b;
  } ;

  union {
    __IOM uint32_t FIFO4;                       /*!< (@ 0x00000030) Endpoint 0 FIFO register                                   */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Single bitfield register.                                         */
    } FIFO4_b;
  } ;

  union {
    __IOM uint32_t FIFO5;                       /*!< (@ 0x00000034) Endpoint 0 FIFO register                                   */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Single bitfield register.                                         */
    } FIFO5_b;
  } ;
  __IM  uint32_t  RESERVED[13];

  union {
    __IOM uint32_t HWVERS;                      /*!< (@ 0x0000006C) HWVers register is a 16-bit read-only register
                                                                    that returns information about the version
                                                                    of the RTL from which the core hardware
                                                                    was generated, in particular the RTL version
                                                                    number (vxx.yyy).                                          */

