AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t yyy        : 10;           /*!< [9..0] Minor Version Number (Range 0 - 999).                              */
      __IOM uint32_t xx         : 5;            /*!< [14..10] Major Version Number (Range 0 - 31).                             */
      __IOM uint32_t RC         : 1;            /*!< [15..15] Unused                                                           */
            uint32_t            : 16;
    } HWVERS_b;
  } ;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t INFO;                        /*!< (@ 0x00000078) This register contains read-only info of the
                                                                    number of IN and OUT endpoints included
                                                                    in the design, width of the RAM, the ability
                                                                    to reset the musbhsfc via software. There
                                                                    is a soft reset bit for the CLK clock domain
                                                                    and a soft reset bit for the XCLK clock
                                                                    domain, controls the timing of the DMA_REQ
                                                                    outputs. There are two bits provided, one
                                                                    bit applied to all the IN Endpoints and
                                                                    one bit applied to all the OUT Endpoints.                  */

    struct {
      __IOM uint32_t InEndPoints : 4;           /*!< [3..0] The number of                                                      */
      __IOM uint32_t OutEndPoints : 4;          /*!< [7..4] The number of                                                      */
      __IOM uint32_t RamBits    : 4;            /*!< [11..8] The width of the RAM address bus.                                 */
      __IOM uint32_t DMAChains  : 4;            /*!< [15..12] The number of DMA channels implemented in the design             */
      __IOM uint32_t RSTS       : 1;            /*!< [16..16] Soft reset for the CLK domain. cause the output signal
                                                     NRSTO to be asserted low. This bit is self-clearing. For
                                                     reset to actually occur, the output NRSTO must be connected
                                                     to the input NRST                                                         */
      __IOM uint32_t RSTXS      : 1;            /*!< [17..17] Soft reset for the XCLK domain. will cause the output
                                                     signal NRSTXO to be asserted low. This bit is self-clearing.
                                                     For reset t actually occur, the output NRSTXO must be connected
                                                     to the input NRSTX                                                        */
            uint32_t            : 6;
      __IOM uint32_t EDMAOUT    : 1;            /*!< [24..24] 1'b0 : DMA_REQ signal for all OUT Endpoints will be
                                                     de-asserted when MAXP bytes have been read to an endpoint.
                                                     When 1 byte early 1'b1 : DMA_REQ signal for all OUT Endpoints
                                                     will be de-asserted when MAXP-8 bytes have been read to
                                                     an endpoint. When 1 byte early                                            */
      __IOM uint32_t EDMAIN     : 1;            /*!< [25..25] 1'b0 written to an endpoint 1'b1 : DMA_REQ signal for
                                                     all IN Endpoints will be de-asserted when MAXP-8 bytes
                                                     have been written to an endpoint.                                         */
            uint32_t            : 6;
    } INFO_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t TIMEOUT1;                    /*!< (@ 0x00000080) This register holds the configurable chirp timeout
                                                                    value.                                                     */

    struct {
      __IOM uint32_t CTUCH      : 16;           /*!< [15..0] Configurable Chirp Timeout timer; The default value
                                                     of 4074h corresponds to a delay of 1.1ms (60Mhz clock cycles
                                                     * 4 * 0x4074).                                                            */
            uint32_t            : 16;
    } TIMEOUT1_b;
  } ;

  union {
    __IOM uint32_t TIMEOUT2;                    /*!< (@ 0x00000084) This register holds the configurable delay from
                                                                    the end of High Speed resume signal to enable
                                                                    UTM normal operating mode.                                 */

    struct {
      __IOM uint32_t CTHRSTN    : 16;           /*!< [15..0] The delay from the end of High Speed resume signaling
                                                     to enabling UTM normal operating mode. This programmed
                                                     delay is equivalent to the number of 60MHz clock cycles
                                                     * 4. The default value of 0x32 corresponds to a delay of
                                                     3us.                                                                      */
            uint32_t            : 16;
    } TIMEOUT2_b;
  } ;
  __IM  uint32_t  RESERVED3[2014];

  union {
    __IOM uint32_t CLKCTRL;                     /*!< (@ 0x00002000) This register provides optional control for turning
                                                                    off the interface clocks to USB Controller
                                                                    and PHY as well as the reference clock to
                                                                    the USB PHY.                                               */

