AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
    struct {
      __IOM uint32_t PHYREFCLKDIS : 1;          /*!< [0..0] 1'b1 written to this bit will turn of the PHY reference
                                                     clock.                                                                    */
            uint32_t            : 7;
      __IOM uint32_t CTRLAPBCLKDIS : 1;         /*!< [8..8] 1'b1 written to this bit will turn of the Controller
                                                     logic clock.                                                              */
            uint32_t            : 7;
      __IOM uint32_t PHYAPBLCLKDIS : 1;         /*!< [16..16] 1'b1 written to this bit will turn off PHY control
                                                     logic clock.                                                              */
            uint32_t            : 15;
    } CLKCTRL_b;
  } ;

  union {
    __IOM uint32_t SRAMCTRL;                    /*!< (@ 0x00002004) This register provides optional SRAM tuning control.       */

    struct {
      __IOM uint32_t RET1N      : 1;            /*!< [0..0] Retention mode 1 enable, active-LOW                                */
      __IOM uint32_t EMA        : 3;            /*!< [3..1] Extra margin adjustment                                            */
      __IOM uint32_t EMAS       : 1;            /*!< [4..4] Extra margin adjustment sense amplifier pulse                      */
      __IOM uint32_t EMAW       : 2;            /*!< [6..5] Extra margin adjustment for write operations                       */
      __IOM uint32_t RAWLM      : 2;            /*!< [8..7] SRAM Adjustment for margin for this read assist scheme             */
      __IOM uint32_t RAWL       : 1;            /*!< [9..9] SRAM Read assist enable                                            */
      __IOM uint32_t WABLM      : 3;            /*!< [12..10] SRAM No margin adjustment                                        */
      __IOM uint32_t WABL       : 1;            /*!< [13..13] SRAM write assist enable                                         */
      __IOM uint32_t STOV       : 1;            /*!< [14..14] SRAM self-timed override                                         */
            uint32_t            : 17;
    } SRAMCTRL_b;
  } ;
  __IM  uint32_t  RESERVED4[3];

  union {
    __IOM uint32_t UTMISTICKYSTATUS;            /*!< (@ 0x00002014) This read only register provides the results
                                                                    from the PHY OBS port controlled by reg
                                                                    0x20[5:4]. IF any bits are set, the bits
                                                                    are sticky. Clear this register using the
                                                                    OBSCLRSTAT register.                                       */

    struct {
      __IOM uint32_t obsportstciky : 2;         /*!< [1..0] These bits are read only status bits from the PHY OBS
                                                     port                                                                      */
            uint32_t            : 30;
    } UTMISTICKYSTATUS_b;
  } ;

  union {
    __IOM uint32_t OBSCLRSTAT;                  /*!< (@ 0x00002018) This register will clear all the bits in the
                                                                    sticky obs status register.                                */

    struct {
      __IOM uint32_t CLRSTAT    : 1;            /*!< [0..0] Writing a 1 to this bit clears all bits in the UTMISTICKYSTATUS
                                                     register.                                                                 */
            uint32_t            : 31;
    } OBSCLRSTAT_b;
  } ;

  union {
    __IOM uint32_t DPDMPULLDOWN;                /*!< (@ 0x0000201C) Enables a pulldown resistor(15K) on D+ or D-               */

    struct {
      __IOM uint32_t DMPULLDOWN : 1;            /*!< [0..0] Enables a pulldown resistor(15K) on D-                             */
      __IOM uint32_t DPPULLDOWN : 1;            /*!< [1..1] Enables a pulldown resistor(15K) on D+                             */
            uint32_t            : 30;
    } DPDMPULLDOWN_b;
  } ;
} USB_Type;                                     /*!< Size = 8224 (0x2020)                                                      */



/* =========================================================================================================================== */
/* ================                                           VCOMP                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Voltage Comparator (VCOMP)
  */

typedef struct {                                /*!< (@ 0x4000C000) VCOMP Structure                                            */

  union {
    __IOM uint32_t CFG;                         /*!< (@ 0x00000000) The Voltage Comparator Configuration Register
                                                                    contains the software control for selecting
                                                                    beween the 4 options for the positive input
                                                                    as well as the multiple options for the
                                                                    reference input.                                           */

    struct {
      __IOM uint32_t PSEL       : 2;            /*!< [1..0] This bitfield selects the positive input to the comparator.        */
            uint32_t            : 6;
      __IOM uint32_t NSEL       : 2;            /*!< [9..8] This bitfield selects the negative input to the comparator.        */
            uint32_t            : 6;
      __IOM uint32_t LVLSEL     : 4;            /*!< [19..16] When the reference input NSEL is set to NSEL_DAC, this
                                                     bitfield selects the voltage level for the negative input
                                                     to the comparator.                                                        */
            uint32_t            : 12;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< (@ 0x00000004) Status                                                     */

