AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* ==========================================================  CFG  ========================================================== */
#define AUDADC_CFG_CLKSEL_Pos             (24UL)                    /*!< CLKSEL (Bit 24)                                       */
#define AUDADC_CFG_CLKSEL_Msk             (0x3000000UL)             /*!< CLKSEL (Bitfield-Mask: 0x03)                          */
#define AUDADC_CFG_RPTTRIGSEL_Pos         (20UL)                    /*!< RPTTRIGSEL (Bit 20)                                   */
#define AUDADC_CFG_RPTTRIGSEL_Msk         (0x100000UL)              /*!< RPTTRIGSEL (Bitfield-Mask: 0x01)                      */
#define AUDADC_CFG_TRIGPOL_Pos            (19UL)                    /*!< TRIGPOL (Bit 19)                                      */
#define AUDADC_CFG_TRIGPOL_Msk            (0x80000UL)               /*!< TRIGPOL (Bitfield-Mask: 0x01)                         */
#define AUDADC_CFG_TRIGSEL_Pos            (16UL)                    /*!< TRIGSEL (Bit 16)                                      */
#define AUDADC_CFG_TRIGSEL_Msk            (0x70000UL)               /*!< TRIGSEL (Bitfield-Mask: 0x07)                         */
#define AUDADC_CFG_DATAFMT_Pos            (13UL)                    /*!< DATAFMT (Bit 13)                                      */
#define AUDADC_CFG_DATAFMT_Msk            (0x2000UL)                /*!< DATAFMT (Bitfield-Mask: 0x01)                         */
#define AUDADC_CFG_DFIFORDEN_Pos          (12UL)                    /*!< DFIFORDEN (Bit 12)                                    */
#define AUDADC_CFG_DFIFORDEN_Msk          (0x1000UL)                /*!< DFIFORDEN (Bitfield-Mask: 0x01)                       */
#define AUDADC_CFG_CKMODE_Pos             (4UL)                     /*!< CKMODE (Bit 4)                                        */
#define AUDADC_CFG_CKMODE_Msk             (0x10UL)                  /*!< CKMODE (Bitfield-Mask: 0x01)                          */
#define AUDADC_CFG_LPMODE_Pos             (3UL)                     /*!< LPMODE (Bit 3)                                        */
#define AUDADC_CFG_LPMODE_Msk             (0x8UL)                   /*!< LPMODE (Bitfield-Mask: 0x01)                          */
#define AUDADC_CFG_RPTEN_Pos              (2UL)                     /*!< RPTEN (Bit 2)                                         */
#define AUDADC_CFG_RPTEN_Msk              (0x4UL)                   /*!< RPTEN (Bitfield-Mask: 0x01)                           */
#define AUDADC_CFG_ADCEN_Pos              (0UL)                     /*!< ADCEN (Bit 0)                                         */
#define AUDADC_CFG_ADCEN_Msk              (0x1UL)                   /*!< ADCEN (Bitfield-Mask: 0x01)                           */
/* =========================================================  STAT  ========================================================== */
#define AUDADC_STAT_PWDSTAT_Pos           (0UL)                     /*!< PWDSTAT (Bit 0)                                       */
#define AUDADC_STAT_PWDSTAT_Msk           (0x1UL)                   /*!< PWDSTAT (Bitfield-Mask: 0x01)                         */
/* ==========================================================  SWT  ========================================================== */
#define AUDADC_SWT_SWT_Pos                (0UL)                     /*!< SWT (Bit 0)                                           */
#define AUDADC_SWT_SWT_Msk                (0xffUL)                  /*!< SWT (Bitfield-Mask: 0xff)                             */
/* ========================================================  SL0CFG  ========================================================= */
#define AUDADC_SL0CFG_ADSEL0_Pos          (24UL)                    /*!< ADSEL0 (Bit 24)                                       */
#define AUDADC_SL0CFG_ADSEL0_Msk          (0x7000000UL)             /*!< ADSEL0 (Bitfield-Mask: 0x07)                          */
#define AUDADC_SL0CFG_TRKCYC0_Pos         (18UL)                    /*!< TRKCYC0 (Bit 18)                                      */
#define AUDADC_SL0CFG_TRKCYC0_Msk         (0xfc0000UL)              /*!< TRKCYC0 (Bitfield-Mask: 0x3f)                         */
#define AUDADC_SL0CFG_PRMODE0_Pos         (16UL)                    /*!< PRMODE0 (Bit 16)                                      */
#define AUDADC_SL0CFG_PRMODE0_Msk         (0x30000UL)               /*!< PRMODE0 (Bitfield-Mask: 0x03)                         */
#define AUDADC_SL0CFG_CHSEL0_Pos          (8UL)                     /*!< CHSEL0 (Bit 8)                                        */
#define AUDADC_SL0CFG_CHSEL0_Msk          (0xf00UL)                 /*!< CHSEL0 (Bitfield-Mask: 0x0f)                          */
#define AUDADC_SL0CFG_WCEN0_Pos           (1UL)                     /*!< WCEN0 (Bit 1)                                         */
#define AUDADC_SL0CFG_WCEN0_Msk           (0x2UL)                   /*!< WCEN0 (Bitfield-Mask: 0x01)                           */
#define AUDADC_SL0CFG_SLEN0_Pos           (0UL)                     /*!< SLEN0 (Bit 0)                                         */
#define AUDADC_SL0CFG_SLEN0_Msk           (0x1UL)                   /*!< SLEN0 (Bitfield-Mask: 0x01)                           */
/* ========================================================  SL1CFG  ========================================================= */
#define AUDADC_SL1CFG_ADSEL1_Pos          (24UL)                    /*!< ADSEL1 (Bit 24)                                       */
#define AUDADC_SL1CFG_ADSEL1_Msk          (0x7000000UL)             /*!< ADSEL1 (Bitfield-Mask: 0x07)                          */
#define AUDADC_SL1CFG_TRKCYC1_Pos         (18UL)                    /*!< TRKCYC1 (Bit 18)                                      */
#define AUDADC_SL1CFG_TRKCYC1_Msk         (0xfc0000UL)              /*!< TRKCYC1 (Bitfield-Mask: 0x3f)                         */
#define AUDADC_SL1CFG_PRMODE1_Pos         (16UL)                    /*!< PRMODE1 (Bit 16)                                      */
#define AUDADC_SL1CFG_PRMODE1_Msk         (0x30000UL)               /*!< PRMODE1 (Bitfield-Mask: 0x03)                         */
#define AUDADC_SL1CFG_CHSEL1_Pos          (8UL)                     /*!< CHSEL1 (Bit 8)                                        */
#define AUDADC_SL1CFG_CHSEL1_Msk          (0xf00UL)                 /*!< CHSEL1 (Bitfield-Mask: 0x0f)                          */
#define AUDADC_SL1CFG_WCEN1_Pos           (1UL)                     /*!< WCEN1 (Bit 1)                                         */
#define AUDADC_SL1CFG_WCEN1_Msk           (0x2UL)                   /*!< WCEN1 (Bitfield-Mask: 0x01)                           */
#define AUDADC_SL1CFG_SLEN1_Pos           (0UL)                     /*!< SLEN1 (Bit 0)                                         */
#define AUDADC_SL1CFG_SLEN1_Msk           (0x1UL)                   /*!< SLEN1 (Bitfield-Mask: 0x01)                           */
/* ========================================================  SL2CFG  ========================================================= */
#define AUDADC_SL2CFG_ADSEL2_Pos          (24UL)                    /*!< ADSEL2 (Bit 24)                                       */
#define AUDADC_SL2CFG_ADSEL2_Msk          (0x7000000UL)             /*!< ADSEL2 (Bitfield-Mask: 0x07)                          */
#define AUDADC_SL2CFG_TRKCYC2_Pos         (18UL)                    /*!< TRKCYC2 (Bit 18)                                      */
#define AUDADC_SL2CFG_TRKCYC2_Msk         (0xfc0000UL)              /*!< TRKCYC2 (Bitfield-Mask: 0x3f)                         */
#define AUDADC_SL2CFG_PRMODE2_Pos         (16UL)                    /*!< PRMODE2 (Bit 16)                                      */
#define AUDADC_SL2CFG_PRMODE2_Msk         (0x30000UL)               /*!< PRMODE2 (Bitfield-Mask: 0x03)                         */
#define AUDADC_SL2CFG_CHSEL2_Pos          (8UL)                     /*!< CHSEL2 (Bit 8)                                        */
#define AUDADC_SL2CFG_CHSEL2_Msk          (0xf00UL)                 /*!< CHSEL2 (Bitfield-Mask: 0x0f)                          */
#define AUDADC_SL2CFG_WCEN2_Pos           (1UL)                     /*!< WCEN2 (Bit 1)                                         */
#define AUDADC_SL2CFG_WCEN2_Msk           (0x2UL)                   /*!< WCEN2 (Bitfield-Mask: 0x01)                           */
#define AUDADC_SL2CFG_SLEN2_Pos           (0UL)                     /*!< SLEN2 (Bit 0)                                         */
#define AUDADC_SL2CFG_SLEN2_Msk           (0x1UL)                   /*!< SLEN2 (Bitfield-Mask: 0x01)                           */
/* ========================================================  SL3CFG  ========================================================= */
#define AUDADC_SL3CFG_ADSEL3_Pos          (24UL)                    /*!< ADSEL3 (Bit 24)                                       */
#define AUDADC_SL3CFG_ADSEL3_Msk          (0x7000000UL)             /*!< ADSEL3 (Bitfield-Mask: 0x07)                          */
#define AUDADC_SL3CFG_TRKCYC3_Pos         (18UL)                    /*!< TRKCYC3 (Bit 18)                                      */
#define AUDADC_SL3CFG_TRKCYC3_Msk         (0xfc0000UL)              /*!< TRKCYC3 (Bitfield-Mask: 0x3f)                         */
#define AUDADC_SL3CFG_PRMODE3_Pos         (16UL)                    /*!< PRMODE3 (Bit 16)                                      */
#define AUDADC_SL3CFG_PRMODE3_Msk         (0x30000UL)               /*!< PRMODE3 (Bitfield-Mask: 0x03)                         */
#define AUDADC_SL3CFG_CHSEL3_Pos          (8UL)                     /*!< CHSEL3 (Bit 8)                                        */
#define AUDADC_SL3CFG_CHSEL3_Msk          (0xf00UL)                 /*!< CHSEL3 (Bitfield-Mask: 0x0f)                          */
#define AUDADC_SL3CFG_WCEN3_Pos           (1UL)                     /*!< WCEN3 (Bit 1)                                         */
#define AUDADC_SL3CFG_WCEN3_Msk           (0x2UL)                   /*!< WCEN3 (Bitfield-Mask: 0x01)                           */
#define AUDADC_SL3CFG_SLEN3_Pos           (0UL)                     /*!< SLEN3 (Bit 0)                                         */
#define AUDADC_SL3CFG_SLEN3_Msk           (0x1UL)                   /*!< SLEN3 (Bitfield-Mask: 0x01)                           */
/* ========================================================  SL4CFG  ========================================================= */
#define AUDADC_SL4CFG_ADSEL4_Pos          (24UL)                    /*!< ADSEL4 (Bit 24)                                       */
#define AUDADC_SL4CFG_ADSEL4_Msk          (0x7000000UL)             /*!< ADSEL4 (Bitfield-Mask: 0x07)                          */
#define AUDADC_SL4CFG_TRKCYC4_Pos         (18UL)                    /*!< TRKCYC4 (Bit 18)                                      */
#define AUDADC_SL4CFG_TRKCYC4_Msk         (0xfc0000UL)              /*!< TRKCYC4 (Bitfield-Mask: 0x3f)                         */
#define AUDADC_SL4CFG_PRMODE4_Pos         (16UL)                    /*!< PRMODE4 (Bit 16)                                      */
#define AUDADC_SL4CFG_PRMODE4_Msk         (0x30000UL)               /*!< PRMODE4 (Bitfield-Mask: 0x03)                         */
#define AUDADC_SL4CFG_CHSEL4_Pos          (8UL)                     /*!< CHSEL4 (Bit 8)                                        */
#define AUDADC_SL4CFG_CHSEL4_Msk          (0xf00UL)                 /*!< CHSEL4 (Bitfield-Mask: 0x0f)                          */
#define AUDADC_SL4CFG_WCEN4_Pos           (1UL)                     /*!< WCEN4 (Bit 1)                                         */
#define AUDADC_SL4CFG_WCEN4_Msk           (0x2UL)                   /*!< WCEN4 (Bitfield-Mask: 0x01)                           */
#define AUDADC_SL4CFG_SLEN4_Pos           (0UL)                     /*!< SLEN4 (Bit 0)                                         */
#define AUDADC_SL4CFG_SLEN4_Msk           (0x1UL)                   /*!< SLEN4 (Bitfield-Mask: 0x01)                           */
/* ========================================================  SL5CFG  ========================================================= */
#define AUDADC_SL5CFG_ADSEL5_Pos          (24UL)                    /*!< ADSEL5 (Bit 24)                                       */
#define AUDADC_SL5CFG_ADSEL5_Msk          (0x7000000UL)             /*!< ADSEL5 (Bitfield-Mask: 0x07)                          */
#define AUDADC_SL5CFG_TRKCYC5_Pos         (18UL)                    /*!< TRKCYC5 (Bit 18)                                      */
#define AUDADC_SL5CFG_TRKCYC5_Msk         (0xfc0000UL)              /*!< TRKCYC5 (Bitfield-Mask: 0x3f)                         */
#define AUDADC_SL5CFG_PRMODE5_Pos         (16UL)                    /*!< PRMODE5 (Bit 16)                                      */
#define AUDADC_SL5CFG_PRMODE5_Msk         (0x30000UL)               /*!< PRMODE5 (Bitfield-Mask: 0x03)                         */
#define AUDADC_SL5CFG_CHSEL5_Pos          (8UL)                     /*!< CHSEL5 (Bit 8)                                        */
#define AUDADC_SL5CFG_CHSEL5_Msk          (0xf00UL)                 /*!< CHSEL5 (Bitfield-Mask: 0x0f)                          */
#define AUDADC_SL5CFG_WCEN5_Pos           (1UL)                     /*!< WCEN5 (Bit 1)                                         */
#define AUDADC_SL5CFG_WCEN5_Msk           (0x2UL)                   /*!< WCEN5 (Bitfield-Mask: 0x01)                           */
#define AUDADC_SL5CFG_SLEN5_Pos           (0UL)                     /*!< SLEN5 (Bit 0)                                         */
#define AUDADC_SL5CFG_SLEN5_Msk           (0x1UL)                   /*!< SLEN5 (Bitfield-Mask: 0x01)                           */
/* ========================================================  SL6CFG  ========================================================= */
#define AUDADC_SL6CFG_ADSEL6_Pos          (24UL)                    /*!< ADSEL6 (Bit 24)                                       */
#define AUDADC_SL6CFG_ADSEL6_Msk          (0x7000000UL)             /*!< ADSEL6 (Bitfield-Mask: 0x07)                          */
#define AUDADC_SL6CFG_TRKCYC6_Pos         (18UL)                    /*!< TRKCYC6 (Bit 18)                                      */
#define AUDADC_SL6CFG_TRKCYC6_Msk         (0xfc0000UL)              /*!< TRKCYC6 (Bitfield-Mask: 0x3f)                         */
#define AUDADC_SL6CFG_PRMODE6_Pos         (16UL)                    /*!< PRMODE6 (Bit 16)                                      */
#define AUDADC_SL6CFG_PRMODE6_Msk         (0x30000UL)               /*!< PRMODE6 (Bitfield-Mask: 0x03)                         */
#define AUDADC_SL6CFG_CHSEL6_Pos          (8UL)                     /*!< CHSEL6 (Bit 8)                                        */
#define AUDADC_SL6CFG_CHSEL6_Msk          (0xf00UL)                 /*!< CHSEL6 (Bitfield-Mask: 0x0f)                          */
#define AUDADC_SL6CFG_WCEN6_Pos           (1UL)                     /*!< WCEN6 (Bit 1)                                         */
#define AUDADC_SL6CFG_WCEN6_Msk           (0x2UL)                   /*!< WCEN6 (Bitfield-Mask: 0x01)                           */
#define AUDADC_SL6CFG_SLEN6_Pos           (0UL)                     /*!< SLEN6 (Bit 0)                                         */
#define AUDADC_SL6CFG_SLEN6_Msk           (0x1UL)                   /*!< SLEN6 (Bitfield-Mask: 0x01)                           */
/* ========================================================  SL7CFG  ========================================================= */
#define AUDADC_SL7CFG_ADSEL7_Pos          (24UL)                    /*!< ADSEL7 (Bit 24)                                       */
#define AUDADC_SL7CFG_ADSEL7_Msk          (0x7000000UL)             /*!< ADSEL7 (Bitfield-Mask: 0x07)                          */
#define AUDADC_SL7CFG_TRKCYC7_Pos         (18UL)                    /*!< TRKCYC7 (Bit 18)                                      */
#define AUDADC_SL7CFG_TRKCYC7_Msk         (0xfc0000UL)              /*!< TRKCYC7 (Bitfield-Mask: 0x3f)                         */
#define AUDADC_SL7CFG_PRMODE7_Pos         (16UL)                    /*!< PRMODE7 (Bit 16)                                      */
#define AUDADC_SL7CFG_PRMODE7_Msk         (0x30000UL)               /*!< PRMODE7 (Bitfield-Mask: 0x03)                         */
#define AUDADC_SL7CFG_CHSEL7_Pos          (8UL)                     /*!< CHSEL7 (Bit 8)                                        */
#define AUDADC_SL7CFG_CHSEL7_Msk          (0xf00UL)                 /*!< CHSEL7 (Bitfield-Mask: 0x0f)                          */
#define AUDADC_SL7CFG_WCEN7_Pos           (1UL)                     /*!< WCEN7 (Bit 1)                                         */
#define AUDADC_SL7CFG_WCEN7_Msk           (0x2UL)                   /*!< WCEN7 (Bitfield-Mask: 0x01)                           */
#define AUDADC_SL7CFG_SLEN7_Pos           (0UL)                     /*!< SLEN7 (Bit 0)                                         */
#define AUDADC_SL7CFG_SLEN7_Msk           (0x1UL)                   /*!< SLEN7 (Bitfield-Mask: 0x01)                           */
/* =========================================================  WULIM  ========================================================= */
#define AUDADC_WULIM_ULIM_Pos             (0UL)                     /*!< ULIM (Bit 0)                                          */
#define AUDADC_WULIM_ULIM_Msk             (0xfffffUL)               /*!< ULIM (Bitfield-Mask: 0xfffff)                         */
/* =========================================================  WLLIM  ========================================================= */
#define AUDADC_WLLIM_LLIM_Pos             (0UL)                     /*!< LLIM (Bit 0)                                          */
#define AUDADC_WLLIM_LLIM_Msk             (0xfffffUL)               /*!< LLIM (Bitfield-Mask: 0xfffff)                         */
/* ========================================================  SCWLIM  ========================================================= */
#define AUDADC_SCWLIM_SCWLIMEN_Pos        (0UL)                     /*!< SCWLIMEN (Bit 0)                                      */
#define AUDADC_SCWLIM_SCWLIMEN_Msk        (0x1UL)                   /*!< SCWLIMEN (Bitfield-Mask: 0x01)                        */
/* =========================================================  FIFO  ========================================================== */
#define AUDADC_FIFO_RSVD_Pos              (31UL)                    /*!< RSVD (Bit 31)                                         */
#define AUDADC_FIFO_RSVD_Msk              (0x80000000UL)            /*!< RSVD (Bitfield-Mask: 0x01)                            */
#define AUDADC_FIFO_SLOTNUM_Pos           (28UL)                    /*!< SLOTNUM (Bit 28)                                      */
#define AUDADC_FIFO_SLOTNUM_Msk           (0x70000000UL)            /*!< SLOTNUM (Bitfield-Mask: 0x07)                         */
#define AUDADC_FIFO_COUNT_Pos             (20UL)                    /*!< COUNT (Bit 20)                                        */
#define AUDADC_FIFO_COUNT_Msk             (0xff00000UL)             /*!< COUNT (Bitfield-Mask: 0xff)                           */
#define AUDADC_FIFO_DATA_Pos              (0UL)                     /*!< DATA (Bit 0)                                          */
#define AUDADC_FIFO_DATA_Msk              (0xfffffUL)               /*!< DATA (Bitfield-Mask: 0xfffff)                         */
/* ========================================================  FIFOPR  ========================================================= */
#define AUDADC_FIFOPR_RSVDPR_Pos          (31UL)                    /*!< RSVDPR (Bit 31)                                       */
#define AUDADC_FIFOPR_RSVDPR_Msk          (0x80000000UL)            /*!< RSVDPR (Bitfield-Mask: 0x01)                          */
#define AUDADC_FIFOPR_SLOTNUMPR_Pos       (28UL)                    /*!< SLOTNUMPR (Bit 28)                                    */
#define AUDADC_FIFOPR_SLOTNUMPR_Msk       (0x70000000UL)            /*!< SLOTNUMPR (Bitfield-Mask: 0x07)                       */
#define AUDADC_FIFOPR_COUNT_Pos           (20UL)                    /*!< COUNT (Bit 20)                                        */
#define AUDADC_FIFOPR_COUNT_Msk           (0xff00000UL)             /*!< COUNT (Bitfield-Mask: 0xff)                           */
#define AUDADC_FIFOPR_DATA_Pos            (0UL)                     /*!< DATA (Bit 0)                                          */
#define AUDADC_FIFOPR_DATA_Msk            (0xfffffUL)               /*!< DATA (Bitfield-Mask: 0xfffff)                         */
/* =====================================================  INTTRIGTIMER  ====================================================== */
#define AUDADC_INTTRIGTIMER_TIMEREN_Pos   (31UL)                    /*!< TIMEREN (Bit 31)                                      */
#define AUDADC_INTTRIGTIMER_TIMEREN_Msk   (0x80000000UL)            /*!< TIMEREN (Bitfield-Mask: 0x01)                         */
#define AUDADC_INTTRIGTIMER_CLKDIV_Pos    (16UL)                    /*!< CLKDIV (Bit 16)                                       */
#define AUDADC_INTTRIGTIMER_CLKDIV_Msk    (0x70000UL)               /*!< CLKDIV (Bitfield-Mask: 0x07)                          */
#define AUDADC_INTTRIGTIMER_TIMERMAX_Pos  (0UL)                     /*!< TIMERMAX (Bit 0)                                      */
#define AUDADC_INTTRIGTIMER_TIMERMAX_Msk  (0x1fUL)                  /*!< TIMERMAX (Bitfield-Mask: 0x1f)                        */
/* =========================================================  INTEN  ========================================================= */
#define AUDADC_INTEN_DERR_Pos             (7UL)                     /*!< DERR (Bit 7)                                          */
#define AUDADC_INTEN_DERR_Msk             (0x80UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTEN_DCMP_Pos             (6UL)                     /*!< DCMP (Bit 6)                                          */
#define AUDADC_INTEN_DCMP_Msk             (0x40UL)                  /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTEN_WCINC_Pos            (5UL)                     /*!< WCINC (Bit 5)                                         */
#define AUDADC_INTEN_WCINC_Msk            (0x20UL)                  /*!< WCINC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTEN_WCEXC_Pos            (4UL)                     /*!< WCEXC (Bit 4)                                         */
#define AUDADC_INTEN_WCEXC_Msk            (0x10UL)                  /*!< WCEXC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTEN_FIFOOVR2_Pos         (3UL)                     /*!< FIFOOVR2 (Bit 3)                                      */
#define AUDADC_INTEN_FIFOOVR2_Msk         (0x8UL)                   /*!< FIFOOVR2 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTEN_FIFOOVR1_Pos         (2UL)                     /*!< FIFOOVR1 (Bit 2)                                      */
#define AUDADC_INTEN_FIFOOVR1_Msk         (0x4UL)                   /*!< FIFOOVR1 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTEN_SCNCMP_Pos           (1UL)                     /*!< SCNCMP (Bit 1)                                        */
#define AUDADC_INTEN_SCNCMP_Msk           (0x2UL)                   /*!< SCNCMP (Bitfield-Mask: 0x01)                          */
#define AUDADC_INTEN_CNVCMP_Pos           (0UL)                     /*!< CNVCMP (Bit 0)                                        */
#define AUDADC_INTEN_CNVCMP_Msk           (0x1UL)                   /*!< CNVCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSTAT  ======================================================== */
#define AUDADC_INTSTAT_DERR_Pos           (7UL)                     /*!< DERR (Bit 7)                                          */
