AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* =========================================================  FIFO  ========================================================== */
#define DSPI2S0_FIFO_FIFO_Pos             (0UL)                     /*!< FIFO (Bit 0)                                          */
#define DSPI2S0_FIFO_FIFO_Msk             (0xffffffffUL)            /*!< FIFO (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  FIFOPTR  ======================================================== */
#define DSPI2S0_FIFOPTR_FIFO1REM_Pos      (24UL)                    /*!< FIFO1REM (Bit 24)                                     */
#define DSPI2S0_FIFOPTR_FIFO1REM_Msk      (0xff000000UL)            /*!< FIFO1REM (Bitfield-Mask: 0xff)                        */
#define DSPI2S0_FIFOPTR_FIFO1SIZ_Pos      (16UL)                    /*!< FIFO1SIZ (Bit 16)                                     */
#define DSPI2S0_FIFOPTR_FIFO1SIZ_Msk      (0xff0000UL)              /*!< FIFO1SIZ (Bitfield-Mask: 0xff)                        */
#define DSPI2S0_FIFOPTR_FIFO0REM_Pos      (8UL)                     /*!< FIFO0REM (Bit 8)                                      */
#define DSPI2S0_FIFOPTR_FIFO0REM_Msk      (0xff00UL)                /*!< FIFO0REM (Bitfield-Mask: 0xff)                        */
#define DSPI2S0_FIFOPTR_FIFO0SIZ_Pos      (0UL)                     /*!< FIFO0SIZ (Bit 0)                                      */
#define DSPI2S0_FIFOPTR_FIFO0SIZ_Msk      (0xffUL)                  /*!< FIFO0SIZ (Bitfield-Mask: 0xff)                        */
/* ========================================================  FIFOTHR  ======================================================== */
#define DSPI2S0_FIFOTHR_FIFOWTHR_Pos      (8UL)                     /*!< FIFOWTHR (Bit 8)                                      */
#define DSPI2S0_FIFOTHR_FIFOWTHR_Msk      (0x3f00UL)                /*!< FIFOWTHR (Bitfield-Mask: 0x3f)                        */
#define DSPI2S0_FIFOTHR_FIFORTHR_Pos      (0UL)                     /*!< FIFORTHR (Bit 0)                                      */
#define DSPI2S0_FIFOTHR_FIFORTHR_Msk      (0x3fUL)                  /*!< FIFORTHR (Bitfield-Mask: 0x3f)                        */
/* ========================================================  FIFOPOP  ======================================================== */
#define DSPI2S0_FIFOPOP_FIFODOUT_Pos      (0UL)                     /*!< FIFODOUT (Bit 0)                                      */
#define DSPI2S0_FIFOPOP_FIFODOUT_Msk      (0xffffffffUL)            /*!< FIFODOUT (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  FIFOPUSH  ======================================================== */
#define DSPI2S0_FIFOPUSH_FIFODIN_Pos      (0UL)                     /*!< FIFODIN (Bit 0)                                       */
#define DSPI2S0_FIFOPUSH_FIFODIN_Msk      (0xffffffffUL)            /*!< FIFODIN (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  FIFOCTRL  ======================================================== */
#define DSPI2S0_FIFOCTRL_FIFORSTN_Pos     (1UL)                     /*!< FIFORSTN (Bit 1)                                      */
#define DSPI2S0_FIFOCTRL_FIFORSTN_Msk     (0x2UL)                   /*!< FIFORSTN (Bitfield-Mask: 0x01)                        */
#define DSPI2S0_FIFOCTRL_POPWR_Pos        (0UL)                     /*!< POPWR (Bit 0)                                         */
#define DSPI2S0_FIFOCTRL_POPWR_Msk        (0x1UL)                   /*!< POPWR (Bitfield-Mask: 0x01)                           */
/* ========================================================  FIFOLOC  ======================================================== */
#define DSPI2S0_FIFOLOC_FIFORPTR_Pos      (8UL)                     /*!< FIFORPTR (Bit 8)                                      */
#define DSPI2S0_FIFOLOC_FIFORPTR_Msk      (0xf00UL)                 /*!< FIFORPTR (Bitfield-Mask: 0x0f)                        */
#define DSPI2S0_FIFOLOC_FIFOWPTR_Pos      (0UL)                     /*!< FIFOWPTR (Bit 0)                                      */
#define DSPI2S0_FIFOLOC_FIFOWPTR_Msk      (0xfUL)                   /*!< FIFOWPTR (Bitfield-Mask: 0x0f)                        */
/* =========================================================  INTEN  ========================================================= */
#define DSPI2S0_INTEN_CQERR_Pos           (14UL)                    /*!< CQERR (Bit 14)                                        */
#define DSPI2S0_INTEN_CQERR_Msk           (0x4000UL)                /*!< CQERR (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTEN_CQUPD_Pos           (13UL)                    /*!< CQUPD (Bit 13)                                        */
#define DSPI2S0_INTEN_CQUPD_Msk           (0x2000UL)                /*!< CQUPD (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTEN_CQPAUSED_Pos        (12UL)                    /*!< CQPAUSED (Bit 12)                                     */
#define DSPI2S0_INTEN_CQPAUSED_Msk        (0x1000UL)                /*!< CQPAUSED (Bitfield-Mask: 0x01)                        */
#define DSPI2S0_INTEN_DERR_Pos            (11UL)                    /*!< DERR (Bit 11)                                         */
#define DSPI2S0_INTEN_DERR_Msk            (0x800UL)                 /*!< DERR (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTEN_DCMP_Pos            (10UL)                    /*!< DCMP (Bit 10)                                         */
#define DSPI2S0_INTEN_DCMP_Msk            (0x400UL)                 /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTEN_ARB_Pos             (9UL)                     /*!< ARB (Bit 9)                                           */
#define DSPI2S0_INTEN_ARB_Msk             (0x200UL)                 /*!< ARB (Bitfield-Mask: 0x01)                             */
#define DSPI2S0_INTEN_STOP_Pos            (8UL)                     /*!< STOP (Bit 8)                                          */
#define DSPI2S0_INTEN_STOP_Msk            (0x100UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTEN_START_Pos           (7UL)                     /*!< START (Bit 7)                                         */
#define DSPI2S0_INTEN_START_Msk           (0x80UL)                  /*!< START (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTEN_ICMD_Pos            (6UL)                     /*!< ICMD (Bit 6)                                          */
#define DSPI2S0_INTEN_ICMD_Msk            (0x40UL)                  /*!< ICMD (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTEN_IACC_Pos            (5UL)                     /*!< IACC (Bit 5)                                          */
#define DSPI2S0_INTEN_IACC_Msk            (0x20UL)                  /*!< IACC (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTEN_NAK_Pos             (4UL)                     /*!< NAK (Bit 4)                                           */
#define DSPI2S0_INTEN_NAK_Msk             (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define DSPI2S0_INTEN_FOVFL_Pos           (3UL)                     /*!< FOVFL (Bit 3)                                         */
#define DSPI2S0_INTEN_FOVFL_Msk           (0x8UL)                   /*!< FOVFL (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTEN_FUNDFL_Pos          (2UL)                     /*!< FUNDFL (Bit 2)                                        */
#define DSPI2S0_INTEN_FUNDFL_Msk          (0x4UL)                   /*!< FUNDFL (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_INTEN_THR_Pos             (1UL)                     /*!< THR (Bit 1)                                           */
#define DSPI2S0_INTEN_THR_Msk             (0x2UL)                   /*!< THR (Bitfield-Mask: 0x01)                             */
#define DSPI2S0_INTEN_CMDCMP_Pos          (0UL)                     /*!< CMDCMP (Bit 0)                                        */
#define DSPI2S0_INTEN_CMDCMP_Msk          (0x1UL)                   /*!< CMDCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSTAT  ======================================================== */
#define DSPI2S0_INTSTAT_CQERR_Pos         (14UL)                    /*!< CQERR (Bit 14)                                        */
#define DSPI2S0_INTSTAT_CQERR_Msk         (0x4000UL)                /*!< CQERR (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTSTAT_CQUPD_Pos         (13UL)                    /*!< CQUPD (Bit 13)                                        */
#define DSPI2S0_INTSTAT_CQUPD_Msk         (0x2000UL)                /*!< CQUPD (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTSTAT_CQPAUSED_Pos      (12UL)                    /*!< CQPAUSED (Bit 12)                                     */
#define DSPI2S0_INTSTAT_CQPAUSED_Msk      (0x1000UL)                /*!< CQPAUSED (Bitfield-Mask: 0x01)                        */
#define DSPI2S0_INTSTAT_DERR_Pos          (11UL)                    /*!< DERR (Bit 11)                                         */
#define DSPI2S0_INTSTAT_DERR_Msk          (0x800UL)                 /*!< DERR (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTSTAT_DCMP_Pos          (10UL)                    /*!< DCMP (Bit 10)                                         */
#define DSPI2S0_INTSTAT_DCMP_Msk          (0x400UL)                 /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTSTAT_ARB_Pos           (9UL)                     /*!< ARB (Bit 9)                                           */
#define DSPI2S0_INTSTAT_ARB_Msk           (0x200UL)                 /*!< ARB (Bitfield-Mask: 0x01)                             */
#define DSPI2S0_INTSTAT_STOP_Pos          (8UL)                     /*!< STOP (Bit 8)                                          */
#define DSPI2S0_INTSTAT_STOP_Msk          (0x100UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTSTAT_START_Pos         (7UL)                     /*!< START (Bit 7)                                         */
#define DSPI2S0_INTSTAT_START_Msk         (0x80UL)                  /*!< START (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTSTAT_ICMD_Pos          (6UL)                     /*!< ICMD (Bit 6)                                          */
#define DSPI2S0_INTSTAT_ICMD_Msk          (0x40UL)                  /*!< ICMD (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTSTAT_IACC_Pos          (5UL)                     /*!< IACC (Bit 5)                                          */
#define DSPI2S0_INTSTAT_IACC_Msk          (0x20UL)                  /*!< IACC (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTSTAT_NAK_Pos           (4UL)                     /*!< NAK (Bit 4)                                           */
#define DSPI2S0_INTSTAT_NAK_Msk           (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define DSPI2S0_INTSTAT_FOVFL_Pos         (3UL)                     /*!< FOVFL (Bit 3)                                         */
#define DSPI2S0_INTSTAT_FOVFL_Msk         (0x8UL)                   /*!< FOVFL (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTSTAT_FUNDFL_Pos        (2UL)                     /*!< FUNDFL (Bit 2)                                        */
#define DSPI2S0_INTSTAT_FUNDFL_Msk        (0x4UL)                   /*!< FUNDFL (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_INTSTAT_THR_Pos           (1UL)                     /*!< THR (Bit 1)                                           */
#define DSPI2S0_INTSTAT_THR_Msk           (0x2UL)                   /*!< THR (Bitfield-Mask: 0x01)                             */
#define DSPI2S0_INTSTAT_CMDCMP_Pos        (0UL)                     /*!< CMDCMP (Bit 0)                                        */
#define DSPI2S0_INTSTAT_CMDCMP_Msk        (0x1UL)                   /*!< CMDCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTCLR  ========================================================= */
#define DSPI2S0_INTCLR_CQERR_Pos          (14UL)                    /*!< CQERR (Bit 14)                                        */
#define DSPI2S0_INTCLR_CQERR_Msk          (0x4000UL)                /*!< CQERR (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTCLR_CQUPD_Pos          (13UL)                    /*!< CQUPD (Bit 13)                                        */
#define DSPI2S0_INTCLR_CQUPD_Msk          (0x2000UL)                /*!< CQUPD (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTCLR_CQPAUSED_Pos       (12UL)                    /*!< CQPAUSED (Bit 12)                                     */
#define DSPI2S0_INTCLR_CQPAUSED_Msk       (0x1000UL)                /*!< CQPAUSED (Bitfield-Mask: 0x01)                        */
#define DSPI2S0_INTCLR_DERR_Pos           (11UL)                    /*!< DERR (Bit 11)                                         */
#define DSPI2S0_INTCLR_DERR_Msk           (0x800UL)                 /*!< DERR (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTCLR_DCMP_Pos           (10UL)                    /*!< DCMP (Bit 10)                                         */
#define DSPI2S0_INTCLR_DCMP_Msk           (0x400UL)                 /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTCLR_ARB_Pos            (9UL)                     /*!< ARB (Bit 9)                                           */
#define DSPI2S0_INTCLR_ARB_Msk            (0x200UL)                 /*!< ARB (Bitfield-Mask: 0x01)                             */
#define DSPI2S0_INTCLR_STOP_Pos           (8UL)                     /*!< STOP (Bit 8)                                          */
#define DSPI2S0_INTCLR_STOP_Msk           (0x100UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTCLR_START_Pos          (7UL)                     /*!< START (Bit 7)                                         */
#define DSPI2S0_INTCLR_START_Msk          (0x80UL)                  /*!< START (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTCLR_ICMD_Pos           (6UL)                     /*!< ICMD (Bit 6)                                          */
#define DSPI2S0_INTCLR_ICMD_Msk           (0x40UL)                  /*!< ICMD (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTCLR_IACC_Pos           (5UL)                     /*!< IACC (Bit 5)                                          */
#define DSPI2S0_INTCLR_IACC_Msk           (0x20UL)                  /*!< IACC (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTCLR_NAK_Pos            (4UL)                     /*!< NAK (Bit 4)                                           */
#define DSPI2S0_INTCLR_NAK_Msk            (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define DSPI2S0_INTCLR_FOVFL_Pos          (3UL)                     /*!< FOVFL (Bit 3)                                         */
#define DSPI2S0_INTCLR_FOVFL_Msk          (0x8UL)                   /*!< FOVFL (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTCLR_FUNDFL_Pos         (2UL)                     /*!< FUNDFL (Bit 2)                                        */
#define DSPI2S0_INTCLR_FUNDFL_Msk         (0x4UL)                   /*!< FUNDFL (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_INTCLR_THR_Pos            (1UL)                     /*!< THR (Bit 1)                                           */
#define DSPI2S0_INTCLR_THR_Msk            (0x2UL)                   /*!< THR (Bitfield-Mask: 0x01)                             */
#define DSPI2S0_INTCLR_CMDCMP_Pos         (0UL)                     /*!< CMDCMP (Bit 0)                                        */
#define DSPI2S0_INTCLR_CMDCMP_Msk         (0x1UL)                   /*!< CMDCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSET  ========================================================= */
#define DSPI2S0_INTSET_CQERR_Pos          (14UL)                    /*!< CQERR (Bit 14)                                        */
#define DSPI2S0_INTSET_CQERR_Msk          (0x4000UL)                /*!< CQERR (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTSET_CQUPD_Pos          (13UL)                    /*!< CQUPD (Bit 13)                                        */
#define DSPI2S0_INTSET_CQUPD_Msk          (0x2000UL)                /*!< CQUPD (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTSET_CQPAUSED_Pos       (12UL)                    /*!< CQPAUSED (Bit 12)                                     */
#define DSPI2S0_INTSET_CQPAUSED_Msk       (0x1000UL)                /*!< CQPAUSED (Bitfield-Mask: 0x01)                        */
#define DSPI2S0_INTSET_DERR_Pos           (11UL)                    /*!< DERR (Bit 11)                                         */
#define DSPI2S0_INTSET_DERR_Msk           (0x800UL)                 /*!< DERR (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTSET_DCMP_Pos           (10UL)                    /*!< DCMP (Bit 10)                                         */
#define DSPI2S0_INTSET_DCMP_Msk           (0x400UL)                 /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTSET_ARB_Pos            (9UL)                     /*!< ARB (Bit 9)                                           */
#define DSPI2S0_INTSET_ARB_Msk            (0x200UL)                 /*!< ARB (Bitfield-Mask: 0x01)                             */
#define DSPI2S0_INTSET_STOP_Pos           (8UL)                     /*!< STOP (Bit 8)                                          */
#define DSPI2S0_INTSET_STOP_Msk           (0x100UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTSET_START_Pos          (7UL)                     /*!< START (Bit 7)                                         */
#define DSPI2S0_INTSET_START_Msk          (0x80UL)                  /*!< START (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTSET_ICMD_Pos           (6UL)                     /*!< ICMD (Bit 6)                                          */
#define DSPI2S0_INTSET_ICMD_Msk           (0x40UL)                  /*!< ICMD (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTSET_IACC_Pos           (5UL)                     /*!< IACC (Bit 5)                                          */
#define DSPI2S0_INTSET_IACC_Msk           (0x20UL)                  /*!< IACC (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_INTSET_NAK_Pos            (4UL)                     /*!< NAK (Bit 4)                                           */
#define DSPI2S0_INTSET_NAK_Msk            (0x10UL)                  /*!< NAK (Bitfield-Mask: 0x01)                             */
#define DSPI2S0_INTSET_FOVFL_Pos          (3UL)                     /*!< FOVFL (Bit 3)                                         */
#define DSPI2S0_INTSET_FOVFL_Msk          (0x8UL)                   /*!< FOVFL (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_INTSET_FUNDFL_Pos         (2UL)                     /*!< FUNDFL (Bit 2)                                        */
#define DSPI2S0_INTSET_FUNDFL_Msk         (0x4UL)                   /*!< FUNDFL (Bitfield-Mask: 0x01)                          */
#define DSPI2S0_INTSET_THR_Pos            (1UL)                     /*!< THR (Bit 1)                                           */
#define DSPI2S0_INTSET_THR_Msk            (0x2UL)                   /*!< THR (Bitfield-Mask: 0x01)                             */
#define DSPI2S0_INTSET_CMDCMP_Pos         (0UL)                     /*!< CMDCMP (Bit 0)                                        */
#define DSPI2S0_INTSET_CMDCMP_Msk         (0x1UL)                   /*!< CMDCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  CLKCFG  ========================================================= */
#define DSPI2S0_CLKCFG_TOTPER_Pos         (24UL)                    /*!< TOTPER (Bit 24)                                       */
#define DSPI2S0_CLKCFG_TOTPER_Msk         (0xff000000UL)            /*!< TOTPER (Bitfield-Mask: 0xff)                          */
#define DSPI2S0_CLKCFG_LOWPER_Pos         (16UL)                    /*!< LOWPER (Bit 16)                                       */
#define DSPI2S0_CLKCFG_LOWPER_Msk         (0xff0000UL)              /*!< LOWPER (Bitfield-Mask: 0xff)                          */
#define DSPI2S0_CLKCFG_DIVEN_Pos          (12UL)                    /*!< DIVEN (Bit 12)                                        */
#define DSPI2S0_CLKCFG_DIVEN_Msk          (0x1000UL)                /*!< DIVEN (Bitfield-Mask: 0x01)                           */
#define DSPI2S0_CLKCFG_DIV3_Pos           (11UL)                    /*!< DIV3 (Bit 11)                                         */
#define DSPI2S0_CLKCFG_DIV3_Msk           (0x800UL)                 /*!< DIV3 (Bitfield-Mask: 0x01)                            */
#define DSPI2S0_CLKCFG_FSEL_Pos           (8UL)                     /*!< FSEL (Bit 8)                                          */
#define DSPI2S0_CLKCFG_FSEL_Msk           (0x700UL)                 /*!< FSEL (Bitfield-Mask: 0x07)                            */
#define DSPI2S0_CLKCFG_IOCLKEN_Pos        (0UL)                     /*!< IOCLKEN (Bit 0)                                       */
#define DSPI2S0_CLKCFG_IOCLKEN_Msk        (0x1UL)                   /*!< IOCLKEN (Bitfield-Mask: 0x01)                         */
/* ======================================================  SUBMODCTRL  ======================================================= */
#define DSPI2S0_SUBMODCTRL_SMOD1TYPE_Pos  (5UL)                     /*!< SMOD1TYPE (Bit 5)                                     */
#define DSPI2S0_SUBMODCTRL_SMOD1TYPE_Msk  (0xe0UL)                  /*!< SMOD1TYPE (Bitfield-Mask: 0x07)                       */
#define DSPI2S0_SUBMODCTRL_SMOD1EN_Pos    (4UL)                     /*!< SMOD1EN (Bit 4)                                       */
#define DSPI2S0_SUBMODCTRL_SMOD1EN_Msk    (0x10UL)                  /*!< SMOD1EN (Bitfield-Mask: 0x01)                         */
#define DSPI2S0_SUBMODCTRL_SMOD0TYPE_Pos  (1UL)                     /*!< SMOD0TYPE (Bit 1)                                     */
#define DSPI2S0_SUBMODCTRL_SMOD0TYPE_Msk  (0xeUL)                   /*!< SMOD0TYPE (Bitfield-Mask: 0x07)                       */
#define DSPI2S0_SUBMODCTRL_SMOD0EN_Pos    (0UL)                     /*!< SMOD0EN (Bit 0)                                       */
#define DSPI2S0_SUBMODCTRL_SMOD0EN_Msk    (0x1UL)                   /*!< SMOD0EN (Bitfield-Mask: 0x01)                         */
/* ==========================================================  CMD  ========================================================== */
#define DSPI2S0_CMD_OFFSETLO_Pos          (24UL)                    /*!< OFFSETLO (Bit 24)                                     */
#define DSPI2S0_CMD_OFFSETLO_Msk          (0xff000000UL)            /*!< OFFSETLO (Bitfield-Mask: 0xff)                        */
#define DSPI2S0_CMD_CMDSEL_Pos            (20UL)                    /*!< CMDSEL (Bit 20)                                       */
#define DSPI2S0_CMD_CMDSEL_Msk            (0x300000UL)              /*!< CMDSEL (Bitfield-Mask: 0x03)                          */
