AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* ======================================================  HCIVERSION  ======================================================= */
#define I3C_HCIVERSION_VERSION_Pos        (0UL)                     /*!< VERSION (Bit 0)                                       */
#define I3C_HCIVERSION_VERSION_Msk        (0xffffffffUL)            /*!< VERSION (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  HCCONTROL  ======================================================= */
#define I3C_HCCONTROL_BUSENABLE_Pos       (31UL)                    /*!< BUSENABLE (Bit 31)                                    */
#define I3C_HCCONTROL_BUSENABLE_Msk       (0x80000000UL)            /*!< BUSENABLE (Bitfield-Mask: 0x01)                       */
#define I3C_HCCONTROL_RESUME_Pos          (30UL)                    /*!< RESUME (Bit 30)                                       */
#define I3C_HCCONTROL_RESUME_Msk          (0x40000000UL)            /*!< RESUME (Bitfield-Mask: 0x01)                          */
#define I3C_HCCONTROL_ABORT_Pos           (29UL)                    /*!< ABORT (Bit 29)                                        */
#define I3C_HCCONTROL_ABORT_Msk           (0x20000000UL)            /*!< ABORT (Bitfield-Mask: 0x01)                           */
#define I3C_HCCONTROL_HOTJOINCTRL_Pos     (8UL)                     /*!< HOTJOINCTRL (Bit 8)                                   */
#define I3C_HCCONTROL_HOTJOINCTRL_Msk     (0x100UL)                 /*!< HOTJOINCTRL (Bitfield-Mask: 0x01)                     */
#define I3C_HCCONTROL_I2CSLAVEPRESENT_Pos (7UL)                     /*!< I2CSLAVEPRESENT (Bit 7)                               */
#define I3C_HCCONTROL_I2CSLAVEPRESENT_Msk (0x80UL)                  /*!< I2CSLAVEPRESENT (Bitfield-Mask: 0x01)                 */
#define I3C_HCCONTROL_IBAINCLUDE_Pos      (0UL)                     /*!< IBAINCLUDE (Bit 0)                                    */
#define I3C_HCCONTROL_IBAINCLUDE_Msk      (0x1UL)                   /*!< IBAINCLUDE (Bitfield-Mask: 0x01)                      */
/* ======================================================  DEVICEADDR  ======================================================= */
#define I3C_DEVICEADDR_DYNAMICADDRVALID_Pos (31UL)                  /*!< DYNAMICADDRVALID (Bit 31)                             */
#define I3C_DEVICEADDR_DYNAMICADDRVALID_Msk (0x80000000UL)          /*!< DYNAMICADDRVALID (Bitfield-Mask: 0x01)                */
#define I3C_DEVICEADDR_DYNAMICADDR_Pos    (16UL)                    /*!< DYNAMICADDR (Bit 16)                                  */
#define I3C_DEVICEADDR_DYNAMICADDR_Msk    (0x7f0000UL)              /*!< DYNAMICADDR (Bitfield-Mask: 0x7f)                     */
/* ====================================================  HCCAPABILITIES  ===================================================== */
#define I3C_HCCAPABILITIES_HDRTSEN_Pos    (7UL)                     /*!< HDRTSEN (Bit 7)                                       */
#define I3C_HCCAPABILITIES_HDRTSEN_Msk    (0x80UL)                  /*!< HDRTSEN (Bitfield-Mask: 0x01)                         */
#define I3C_HCCAPABILITIES_HDRDDREN_Pos   (6UL)                     /*!< HDRDDREN (Bit 6)                                      */
#define I3C_HCCAPABILITIES_HDRDDREN_Msk   (0x40UL)                  /*!< HDRDDREN (Bitfield-Mask: 0x01)                        */
#define I3C_HCCAPABILITIES_NONCURRENTMASTERCAP_Pos (5UL)            /*!< NONCURRENTMASTERCAP (Bit 5)                           */
#define I3C_HCCAPABILITIES_NONCURRENTMASTERCAP_Msk (0x20UL)         /*!< NONCURRENTMASTERCAP (Bitfield-Mask: 0x01)             */
#define I3C_HCCAPABILITIES_AUTOCOMMAND_Pos (3UL)                    /*!< AUTOCOMMAND (Bit 3)                                   */
#define I3C_HCCAPABILITIES_AUTOCOMMAND_Msk (0x8UL)                  /*!< AUTOCOMMAND (Bitfield-Mask: 0x01)                     */
#define I3C_HCCAPABILITIES_COMBOCOMMAND_Pos (2UL)                   /*!< COMBOCOMMAND (Bit 2)                                  */
#define I3C_HCCAPABILITIES_COMBOCOMMAND_Msk (0x4UL)                 /*!< COMBOCOMMAND (Bitfield-Mask: 0x01)                    */
/* =======================================================  RESETCTRL  ======================================================= */
#define I3C_RESETCTRL_IBIQUEUERST_Pos     (5UL)                     /*!< IBIQUEUERST (Bit 5)                                   */
#define I3C_RESETCTRL_IBIQUEUERST_Msk     (0x20UL)                  /*!< IBIQUEUERST (Bitfield-Mask: 0x01)                     */
#define I3C_RESETCTRL_RXFIFORST_Pos       (4UL)                     /*!< RXFIFORST (Bit 4)                                     */
#define I3C_RESETCTRL_RXFIFORST_Msk       (0x10UL)                  /*!< RXFIFORST (Bitfield-Mask: 0x01)                       */
#define I3C_RESETCTRL_TXFIFORST_Pos       (3UL)                     /*!< TXFIFORST (Bit 3)                                     */
#define I3C_RESETCTRL_TXFIFORST_Msk       (0x8UL)                   /*!< TXFIFORST (Bitfield-Mask: 0x01)                       */
#define I3C_RESETCTRL_RESPQUEUERST_Pos    (2UL)                     /*!< RESPQUEUERST (Bit 2)                                  */
#define I3C_RESETCTRL_RESPQUEUERST_Msk    (0x4UL)                   /*!< RESPQUEUERST (Bitfield-Mask: 0x01)                    */
#define I3C_RESETCTRL_CMDQUEUERST_Pos     (1UL)                     /*!< CMDQUEUERST (Bit 1)                                   */
#define I3C_RESETCTRL_CMDQUEUERST_Msk     (0x2UL)                   /*!< CMDQUEUERST (Bitfield-Mask: 0x01)                     */
#define I3C_RESETCTRL_SOFTRST_Pos         (0UL)                     /*!< SOFTRST (Bit 0)                                       */
#define I3C_RESETCTRL_SOFTRST_Msk         (0x1UL)                   /*!< SOFTRST (Bitfield-Mask: 0x01)                         */
/* =====================================================  PRESENTSTATE  ====================================================== */
#define I3C_PRESENTSTATE_CURRENTMASTER_Pos (2UL)                    /*!< CURRENTMASTER (Bit 2)                                 */
#define I3C_PRESENTSTATE_CURRENTMASTER_Msk (0x4UL)                  /*!< CURRENTMASTER (Bitfield-Mask: 0x01)                   */
/* ======================================================  INTRSTATUS  ======================================================= */
#define I3C_INTRSTATUS_HCINTERNALERRSTAT_Pos (10UL)                 /*!< HCINTERNALERRSTAT (Bit 10)                            */
#define I3C_INTRSTATUS_HCINTERNALERRSTAT_Msk (0x400UL)              /*!< HCINTERNALERRSTAT (Bitfield-Mask: 0x01)               */
/* ===================================================  INTRSTATUSENABLE  ==================================================== */
#define I3C_INTRSTATUSENABLE_HCINTERNALERRSTATEN_Pos (10UL)         /*!< HCINTERNALERRSTATEN (Bit 10)                          */
#define I3C_INTRSTATUSENABLE_HCINTERNALERRSTATEN_Msk (0x400UL)      /*!< HCINTERNALERRSTATEN (Bitfield-Mask: 0x01)             */
/* ===================================================  INTRSIGNALENABLE  ==================================================== */
#define I3C_INTRSIGNALENABLE_HCINTERNALERRSIGNALEN_Pos (10UL)       /*!< HCINTERNALERRSIGNALEN (Bit 10)                        */
#define I3C_INTRSIGNALENABLE_HCINTERNALERRSIGNALEN_Msk (0x400UL)    /*!< HCINTERNALERRSIGNALEN (Bitfield-Mask: 0x01)           */
/* =======================================================  INTRFORCE  ======================================================= */
#define I3C_INTRFORCE_HCINTERNALERRFORCE_Pos (10UL)                 /*!< HCINTERNALERRFORCE (Bit 10)                           */
#define I3C_INTRFORCE_HCINTERNALERRFORCE_Msk (0x400UL)              /*!< HCINTERNALERRFORCE (Bitfield-Mask: 0x01)              */
/* ===================================================  DATSECTIONOFFSET  ==================================================== */
#define I3C_DATSECTIONOFFSET_TABLESIZE_Pos (12UL)                   /*!< TABLESIZE (Bit 12)                                    */
#define I3C_DATSECTIONOFFSET_TABLESIZE_Msk (0x7f000UL)              /*!< TABLESIZE (Bitfield-Mask: 0x7f)                       */
#define I3C_DATSECTIONOFFSET_TABLEOFFSET_Pos (0UL)                  /*!< TABLEOFFSET (Bit 0)                                   */
#define I3C_DATSECTIONOFFSET_TABLEOFFSET_Msk (0xfffUL)              /*!< TABLEOFFSET (Bitfield-Mask: 0xfff)                    */
/* ===================================================  DCTSECTIONOFFSET  ==================================================== */
#define I3C_DCTSECTIONOFFSET_TABLEINDEX_Pos (19UL)                  /*!< TABLEINDEX (Bit 19)                                   */
#define I3C_DCTSECTIONOFFSET_TABLEINDEX_Msk (0xf80000UL)            /*!< TABLEINDEX (Bitfield-Mask: 0x1f)                      */
#define I3C_DCTSECTIONOFFSET_TABLESIZE_Pos (12UL)                   /*!< TABLESIZE (Bit 12)                                    */
#define I3C_DCTSECTIONOFFSET_TABLESIZE_Msk (0x7f000UL)              /*!< TABLESIZE (Bitfield-Mask: 0x7f)                       */
#define I3C_DCTSECTIONOFFSET_TABLEOFFSET_Pos (0UL)                  /*!< TABLEOFFSET (Bit 0)                                   */
#define I3C_DCTSECTIONOFFSET_TABLEOFFSET_Msk (0xfffUL)              /*!< TABLEOFFSET (Bitfield-Mask: 0xfff)                    */
/* ===============================================  RINGHEADERSSECTIONOFFSET  ================================================ */
#define I3C_RINGHEADERSSECTIONOFFSET_SECTIONOFFSET_Pos (0UL)        /*!< SECTIONOFFSET (Bit 0)                                 */
#define I3C_RINGHEADERSSECTIONOFFSET_SECTIONOFFSET_Msk (0xffffUL)   /*!< SECTIONOFFSET (Bitfield-Mask: 0xffff)                 */
/* ===================================================  PIOSECTIONOFFSET  ==================================================== */
#define I3C_PIOSECTIONOFFSET_SECTIONOFFSET_Pos (0UL)                /*!< SECTIONOFFSET (Bit 0)                                 */
#define I3C_PIOSECTIONOFFSET_SECTIONOFFSET_Msk (0xffffUL)           /*!< SECTIONOFFSET (Bitfield-Mask: 0xffff)                 */
/* =================================================  EXTCAPSSECTIONOFFSET  ================================================== */
#define I3C_EXTCAPSSECTIONOFFSET_SECTIONOFFSET_Pos (0UL)            /*!< SECTIONOFFSET (Bit 0)                                 */
#define I3C_EXTCAPSSECTIONOFFSET_SECTIONOFFSET_Msk (0xffffUL)       /*!< SECTIONOFFSET (Bitfield-Mask: 0xffff)                 */
/* =====================================================  IBINOTIFYCTRL  ===================================================== */
#define I3C_IBINOTIFYCTRL_NOTIFYSIRREJECTED_Pos (3UL)               /*!< NOTIFYSIRREJECTED (Bit 3)                             */
#define I3C_IBINOTIFYCTRL_NOTIFYSIRREJECTED_Msk (0x8UL)             /*!< NOTIFYSIRREJECTED (Bitfield-Mask: 0x01)               */
#define I3C_IBINOTIFYCTRL_NOTIFYMRREJECTED_Pos (1UL)                /*!< NOTIFYMRREJECTED (Bit 1)                              */
#define I3C_IBINOTIFYCTRL_NOTIFYMRREJECTED_Msk (0x2UL)              /*!< NOTIFYMRREJECTED (Bitfield-Mask: 0x01)                */
#define I3C_IBINOTIFYCTRL_NOTIFYHJREJECTED_Pos (0UL)                /*!< NOTIFYHJREJECTED (Bit 0)                              */
#define I3C_IBINOTIFYCTRL_NOTIFYHJREJECTED_Msk (0x1UL)              /*!< NOTIFYHJREJECTED (Bitfield-Mask: 0x01)                */
/* =========================================================  DAT0  ========================================================== */
#define I3C_DAT0_DEVICE_Pos               (31UL)                    /*!< DEVICE (Bit 31)                                       */
#define I3C_DAT0_DEVICE_Msk               (0x80000000UL)            /*!< DEVICE (Bitfield-Mask: 0x01)                          */
#define I3C_DAT0_DEVNACKRETRYCNT_Pos      (29UL)                    /*!< DEVNACKRETRYCNT (Bit 29)                              */
#define I3C_DAT0_DEVNACKRETRYCNT_Msk      (0x60000000UL)            /*!< DEVNACKRETRYCNT (Bitfield-Mask: 0x03)                 */
#define I3C_DAT0_RINGID_Pos               (26UL)                    /*!< RINGID (Bit 26)                                       */
#define I3C_DAT0_RINGID_Msk               (0x1c000000UL)            /*!< RINGID (Bitfield-Mask: 0x07)                          */
#define I3C_DAT0_DYNAMICADDRESS_Pos       (16UL)                    /*!< DYNAMICADDRESS (Bit 16)                               */
#define I3C_DAT0_DYNAMICADDRESS_Msk       (0xff0000UL)              /*!< DYNAMICADDRESS (Bitfield-Mask: 0xff)                  */
#define I3C_DAT0_TS_Pos                   (15UL)                    /*!< TS (Bit 15)                                           */
#define I3C_DAT0_TS_Msk                   (0x8000UL)                /*!< TS (Bitfield-Mask: 0x01)                              */
#define I3C_DAT0_MRREJECT_Pos             (14UL)                    /*!< MRREJECT (Bit 14)                                     */
#define I3C_DAT0_MRREJECT_Msk             (0x4000UL)                /*!< MRREJECT (Bitfield-Mask: 0x01)                        */
#define I3C_DAT0_SIRREJECT_Pos            (13UL)                    /*!< SIRREJECT (Bit 13)                                    */
#define I3C_DAT0_SIRREJECT_Msk            (0x2000UL)                /*!< SIRREJECT (Bitfield-Mask: 0x01)                       */
#define I3C_DAT0_IBIPAYLOAD_Pos           (12UL)                    /*!< IBIPAYLOAD (Bit 12)                                   */
#define I3C_DAT0_IBIPAYLOAD_Msk           (0x1000UL)                /*!< IBIPAYLOAD (Bitfield-Mask: 0x01)                      */
#define I3C_DAT0_STATICADDRESS_Pos        (0UL)                     /*!< STATICADDRESS (Bit 0)                                 */
#define I3C_DAT0_STATICADDRESS_Msk        (0x7fUL)                  /*!< STATICADDRESS (Bitfield-Mask: 0x7f)                   */
/* =========================================================  DAT1  ========================================================== */
#define I3C_DAT1_AUTOCMDHDRCODE_Pos       (19UL)                    /*!< AUTOCMDHDRCODE (Bit 19)                               */
#define I3C_DAT1_AUTOCMDHDRCODE_Msk       (0x7f80000UL)             /*!< AUTOCMDHDRCODE (Bitfield-Mask: 0xff)                  */
#define I3C_DAT1_AUTOCMDMODE_Pos          (16UL)                    /*!< AUTOCMDMODE (Bit 16)                                  */
#define I3C_DAT1_AUTOCMDMODE_Msk          (0x70000UL)               /*!< AUTOCMDMODE (Bitfield-Mask: 0x07)                     */
#define I3C_DAT1_AUTOCMDVALUE_Pos         (8UL)                     /*!< AUTOCMDVALUE (Bit 8)                                  */
#define I3C_DAT1_AUTOCMDVALUE_Msk         (0xff00UL)                /*!< AUTOCMDVALUE (Bitfield-Mask: 0xff)                    */
#define I3C_DAT1_AUTOCMDMASK_Pos          (0UL)                     /*!< AUTOCMDMASK (Bit 0)                                   */
#define I3C_DAT1_AUTOCMDMASK_Msk          (0xffUL)                  /*!< AUTOCMDMASK (Bitfield-Mask: 0xff)                     */
/* =========================================================  DCT0  ========================================================== */
#define I3C_DCT0_PID_Pos                  (0UL)                     /*!< PID (Bit 0)                                           */
#define I3C_DCT0_PID_Msk                  (0xffffffffUL)            /*!< PID (Bitfield-Mask: 0xffffffff)                       */
/* =========================================================  DCT1  ========================================================== */
#define I3C_DCT1_PID_Pos                  (0UL)                     /*!< PID (Bit 0)                                           */
#define I3C_DCT1_PID_Msk                  (0xffffUL)                /*!< PID (Bitfield-Mask: 0xffff)                           */
/* =========================================================  DCT2  ========================================================== */
#define I3C_DCT2_BCR_Pos                  (8UL)                     /*!< BCR (Bit 8)                                           */
#define I3C_DCT2_BCR_Msk                  (0xff00UL)                /*!< BCR (Bitfield-Mask: 0xff)                             */
#define I3C_DCT2_DCR_Pos                  (0UL)                     /*!< DCR (Bit 0)                                           */
#define I3C_DCT2_DCR_Msk                  (0xffUL)                  /*!< DCR (Bitfield-Mask: 0xff)                             */
/* =========================================================  DCT3  ========================================================== */
#define I3C_DCT3_DYNAMICADDRESS_Pos       (0UL)                     /*!< DYNAMICADDRESS (Bit 0)                                */
#define I3C_DCT3_DYNAMICADDRESS_Msk       (0xffUL)                  /*!< DYNAMICADDRESS (Bitfield-Mask: 0xff)                  */
/* ======================================================  RHSCONTROL  ======================================================= */
#define I3C_RHSCONTROL_PREAMBLESIZE_Pos   (24UL)                    /*!< PREAMBLESIZE (Bit 24)                                 */
#define I3C_RHSCONTROL_PREAMBLESIZE_Msk   (0xff000000UL)            /*!< PREAMBLESIZE (Bitfield-Mask: 0xff)                    */
#define I3C_RHSCONTROL_HEADERSIZE_Pos     (16UL)                    /*!< HEADERSIZE (Bit 16)                                   */
#define I3C_RHSCONTROL_HEADERSIZE_Msk     (0xff0000UL)              /*!< HEADERSIZE (Bitfield-Mask: 0xff)                      */
#define I3C_RHSCONTROL_MAXHEADERCOUNT_Pos (4UL)                     /*!< MAXHEADERCOUNT (Bit 4)                                */
#define I3C_RHSCONTROL_MAXHEADERCOUNT_Msk (0xf0UL)                  /*!< MAXHEADERCOUNT (Bitfield-Mask: 0x0f)                  */
#define I3C_RHSCONTROL_HEADERENMASK_Pos   (0UL)                     /*!< HEADERENMASK (Bit 0)                                  */
#define I3C_RHSCONTROL_HEADERENMASK_Msk   (0xfUL)                   /*!< HEADERENMASK (Bitfield-Mask: 0x0f)                    */
/* =======================================================  RH0OFFSET  ======================================================= */
#define I3C_RH0OFFSET_OFFSET_Pos          (0UL)                     /*!< OFFSET (Bit 0)                                        */
#define I3C_RH0OFFSET_OFFSET_Msk          (0xffffffffUL)            /*!< OFFSET (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  RH1OFFSET  ======================================================= */
#define I3C_RH1OFFSET_OFFSET_Pos          (0UL)                     /*!< OFFSET (Bit 0)                                        */
#define I3C_RH1OFFSET_OFFSET_Msk          (0xffffffffUL)            /*!< OFFSET (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  RH2OFFSET  ======================================================= */
#define I3C_RH2OFFSET_OFFSET_Pos          (0UL)                     /*!< OFFSET (Bit 0)                                        */
#define I3C_RH2OFFSET_OFFSET_Msk          (0xffffffffUL)            /*!< OFFSET (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  RH3OFFSET  ======================================================= */
#define I3C_RH3OFFSET_OFFSET_Pos          (0UL)                     /*!< OFFSET (Bit 0)                                        */
#define I3C_RH3OFFSET_OFFSET_Msk          (0xffffffffUL)            /*!< OFFSET (Bitfield-Mask: 0xffffffff)                    */
/* ===================================================  COMMANDQUEUEPORT  ==================================================== */
#define I3C_COMMANDQUEUEPORT_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define I3C_COMMANDQUEUEPORT_DATA_Msk     (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */
/* ===================================================  RESPONSEQUEUEPORT  =================================================== */
#define I3C_RESPONSEQUEUEPORT_DATA_Pos    (0UL)                     /*!< DATA (Bit 0)                                          */
#define I3C_RESPONSEQUEUEPORT_DATA_Msk    (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */
/* =====================================================  XFERDATAPORT  ====================================================== */
#define I3C_XFERDATAPORT_DATA_Pos         (0UL)                     /*!< DATA (Bit 0)                                          */
#define I3C_XFERDATAPORT_DATA_Msk         (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  IBIPORT  ======================================================== */
#define I3C_IBIPORT_IBIDATA_Pos           (0UL)                     /*!< IBIDATA (Bit 0)                                       */
#define I3C_IBIPORT_IBIDATA_Msk           (0xffffffffUL)            /*!< IBIDATA (Bitfield-Mask: 0xffffffff)                   */
/* =====================================================  QUEUETHLDCTRL  ===================================================== */
#define I3C_QUEUETHLDCTRL_IBISTATUSTHLD_Pos (24UL)                  /*!< IBISTATUSTHLD (Bit 24)                                */
#define I3C_QUEUETHLDCTRL_IBISTATUSTHLD_Msk (0xff000000UL)          /*!< IBISTATUSTHLD (Bitfield-Mask: 0xff)                   */
#define I3C_QUEUETHLDCTRL_IBIDATATHLD_Pos (16UL)                    /*!< IBIDATATHLD (Bit 16)                                  */
#define I3C_QUEUETHLDCTRL_IBIDATATHLD_Msk (0xff0000UL)              /*!< IBIDATATHLD (Bitfield-Mask: 0xff)                     */
#define I3C_QUEUETHLDCTRL_RESPBUFTHLD_Pos (8UL)                     /*!< RESPBUFTHLD (Bit 8)                                   */
#define I3C_QUEUETHLDCTRL_RESPBUFTHLD_Msk (0xff00UL)                /*!< RESPBUFTHLD (Bitfield-Mask: 0xff)                     */
#define I3C_QUEUETHLDCTRL_CMDEMPTYBUFTHLD_Pos (0UL)                 /*!< CMDEMPTYBUFTHLD (Bit 0)                               */
#define I3C_QUEUETHLDCTRL_CMDEMPTYBUFTHLD_Msk (0xffUL)              /*!< CMDEMPTYBUFTHLD (Bitfield-Mask: 0xff)                 */
/* ==================================================  DATABUFFERTHLDCTRL  =================================================== */
#define I3C_DATABUFFERTHLDCTRL_RXSTARTTHLD_Pos (24UL)               /*!< RXSTARTTHLD (Bit 24)                                  */
#define I3C_DATABUFFERTHLDCTRL_RXSTARTTHLD_Msk (0x7000000UL)        /*!< RXSTARTTHLD (Bitfield-Mask: 0x07)                     */
#define I3C_DATABUFFERTHLDCTRL_TXSTARTTHLD_Pos (16UL)               /*!< TXSTARTTHLD (Bit 16)                                  */
#define I3C_DATABUFFERTHLDCTRL_TXSTARTTHLD_Msk (0x70000UL)          /*!< TXSTARTTHLD (Bitfield-Mask: 0x07)                     */
#define I3C_DATABUFFERTHLDCTRL_RXBUFTHLD_Pos (8UL)                  /*!< RXBUFTHLD (Bit 8)                                     */
#define I3C_DATABUFFERTHLDCTRL_RXBUFTHLD_Msk (0x700UL)              /*!< RXBUFTHLD (Bitfield-Mask: 0x07)                       */
#define I3C_DATABUFFERTHLDCTRL_TXBUFTHLD_Pos (0UL)                  /*!< TXBUFTHLD (Bit 0)                                     */
#define I3C_DATABUFFERTHLDCTRL_TXBUFTHLD_Msk (0x7UL)                /*!< TXBUFTHLD (Bitfield-Mask: 0x07)                       */
/* =====================================================  QUEUESIZECTRL  ===================================================== */
#define I3C_QUEUESIZECTRL_TXDATABUFFERSIZE_Pos (24UL)               /*!< TXDATABUFFERSIZE (Bit 24)                             */
#define I3C_QUEUESIZECTRL_TXDATABUFFERSIZE_Msk (0xff000000UL)       /*!< TXDATABUFFERSIZE (Bitfield-Mask: 0xff)                */
