AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* =======================================================  SCRATCH0  ======================================================== */
#define MCUCTRL_SCRATCH0_SCRATCH0_Pos     (0UL)                     /*!< SCRATCH0 (Bit 0)                                      */
#define MCUCTRL_SCRATCH0_SCRATCH0_Msk     (0xffffffffUL)            /*!< SCRATCH0 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  SCRATCH1  ======================================================== */
#define MCUCTRL_SCRATCH1_SCRATCH1_Pos     (0UL)                     /*!< SCRATCH1 (Bit 0)                                      */
#define MCUCTRL_SCRATCH1_SCRATCH1_Msk     (0xffffffffUL)            /*!< SCRATCH1 (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  DBGR1  ========================================================= */
#define MCUCTRL_DBGR1_ONETO8_Pos          (0UL)                     /*!< ONETO8 (Bit 0)                                        */
#define MCUCTRL_DBGR1_ONETO8_Msk          (0xffffffffUL)            /*!< ONETO8 (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  DBGR2  ========================================================= */
#define MCUCTRL_DBGR2_COOLCODE_Pos        (0UL)                     /*!< COOLCODE (Bit 0)                                      */
#define MCUCTRL_DBGR2_COOLCODE_Msk        (0xffffffffUL)            /*!< COOLCODE (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  PMUENABLE  ======================================================= */
#define MCUCTRL_PMUENABLE_ENABLE_Pos      (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define MCUCTRL_PMUENABLE_ENABLE_Msk      (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* ========================================================  DBGCTRL  ======================================================== */
#define MCUCTRL_DBGCTRL_DBGDSP1OCDHALTONRST_Pos (17UL)              /*!< DBGDSP1OCDHALTONRST (Bit 17)                          */
#define MCUCTRL_DBGCTRL_DBGDSP1OCDHALTONRST_Msk (0x20000UL)         /*!< DBGDSP1OCDHALTONRST (Bitfield-Mask: 0x01)             */
#define MCUCTRL_DBGCTRL_DBGDSP0OCDHALTONRST_Pos (16UL)              /*!< DBGDSP0OCDHALTONRST (Bit 16)                          */
#define MCUCTRL_DBGCTRL_DBGDSP0OCDHALTONRST_Msk (0x10000UL)         /*!< DBGDSP0OCDHALTONRST (Bitfield-Mask: 0x01)             */
#define MCUCTRL_DBGCTRL_DBGTSCLKSEL_Pos   (12UL)                    /*!< DBGTSCLKSEL (Bit 12)                                  */
#define MCUCTRL_DBGCTRL_DBGTSCLKSEL_Msk   (0x7000UL)                /*!< DBGTSCLKSEL (Bitfield-Mask: 0x07)                     */
#define MCUCTRL_DBGCTRL_DBGDSP1TRACEEN_Pos (11UL)                   /*!< DBGDSP1TRACEEN (Bit 11)                               */
#define MCUCTRL_DBGCTRL_DBGDSP1TRACEEN_Msk (0x800UL)                /*!< DBGDSP1TRACEEN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_DBGCTRL_DBGDSP0TRACEEN_Pos (10UL)                   /*!< DBGDSP0TRACEEN (Bit 10)                               */
#define MCUCTRL_DBGCTRL_DBGDSP0TRACEEN_Msk (0x400UL)                /*!< DBGDSP0TRACEEN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_DBGCTRL_DBGETMTRACEEN_Pos (9UL)                     /*!< DBGETMTRACEEN (Bit 9)                                 */
#define MCUCTRL_DBGCTRL_DBGETMTRACEEN_Msk (0x200UL)                 /*!< DBGETMTRACEEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_DBGCTRL_DBGETBENABLE_Pos  (8UL)                     /*!< DBGETBENABLE (Bit 8)                                  */
#define MCUCTRL_DBGCTRL_DBGETBENABLE_Msk  (0x100UL)                 /*!< DBGETBENABLE (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_DBGCTRL_DBGCLKSEL_Pos     (5UL)                     /*!< DBGCLKSEL (Bit 5)                                     */
#define MCUCTRL_DBGCTRL_DBGCLKSEL_Msk     (0xe0UL)                  /*!< DBGCLKSEL (Bitfield-Mask: 0x07)                       */
#define MCUCTRL_DBGCTRL_DBGTPIUENABLE_Pos (4UL)                     /*!< DBGTPIUENABLE (Bit 4)                                 */
#define MCUCTRL_DBGCTRL_DBGTPIUENABLE_Msk (0x10UL)                  /*!< DBGTPIUENABLE (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_DBGCTRL_CM4CLKSEL_Pos     (1UL)                     /*!< CM4CLKSEL (Bit 1)                                     */
#define MCUCTRL_DBGCTRL_CM4CLKSEL_Msk     (0xeUL)                   /*!< CM4CLKSEL (Bitfield-Mask: 0x07)                       */
#define MCUCTRL_DBGCTRL_CM4TPIUENABLE_Pos (0UL)                     /*!< CM4TPIUENABLE (Bit 0)                                 */
#define MCUCTRL_DBGCTRL_CM4TPIUENABLE_Msk (0x1UL)                   /*!< CM4TPIUENABLE (Bitfield-Mask: 0x01)                   */
/* ======================================================  OTAPOINTER  ======================================================= */
#define MCUCTRL_OTAPOINTER_OTAPOINTER_Pos (2UL)                     /*!< OTAPOINTER (Bit 2)                                    */
#define MCUCTRL_OTAPOINTER_OTAPOINTER_Msk (0xfffffffcUL)            /*!< OTAPOINTER (Bitfield-Mask: 0x3fffffff)                */
#define MCUCTRL_OTAPOINTER_OTASBLUPDATE_Pos (1UL)                   /*!< OTASBLUPDATE (Bit 1)                                  */
#define MCUCTRL_OTAPOINTER_OTASBLUPDATE_Msk (0x2UL)                 /*!< OTASBLUPDATE (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_OTAPOINTER_OTAVALID_Pos   (0UL)                     /*!< OTAVALID (Bit 0)                                      */
#define MCUCTRL_OTAPOINTER_OTAVALID_Msk   (0x1UL)                   /*!< OTAVALID (Bitfield-Mask: 0x01)                        */
/* ======================================================  APBDMACTRL  ======================================================= */
#define MCUCTRL_APBDMACTRL_HYSTERESIS_Pos (8UL)                     /*!< HYSTERESIS (Bit 8)                                    */
#define MCUCTRL_APBDMACTRL_HYSTERESIS_Msk (0xff00UL)                /*!< HYSTERESIS (Bitfield-Mask: 0xff)                      */
#define MCUCTRL_APBDMACTRL_DECODEABORT_Pos (1UL)                    /*!< DECODEABORT (Bit 1)                                   */
#define MCUCTRL_APBDMACTRL_DECODEABORT_Msk (0x2UL)                  /*!< DECODEABORT (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_APBDMACTRL_DMAENABLE_Pos  (0UL)                     /*!< DMAENABLE (Bit 0)                                     */
#define MCUCTRL_APBDMACTRL_DMAENABLE_Msk  (0x1UL)                   /*!< DMAENABLE (Bitfield-Mask: 0x01)                       */
/* ======================================================  KEXTCLKSEL  ======================================================= */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Pos (0UL)                     /*!< KEXTCLKSEL (Bit 0)                                    */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Msk (0xffffffffUL)            /*!< KEXTCLKSEL (Bitfield-Mask: 0xffffffff)                */
/* =======================================================  SIMOBUCK4  ======================================================= */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVINPREFSEL_Pos (28UL)        /*!< SIMOBUCKVDDCLVINPREFSEL (Bit 28)                      */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVINPREFSEL_Msk (0x10000000UL) /*!< SIMOBUCKVDDCLVINPREFSEL (Bitfield-Mask: 0x01)        */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTLOWTONTRIM_Pos (24UL)    /*!< SIMOBUCKVDDCLVACTLOWTONTRIM (Bit 24)                  */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTLOWTONTRIM_Msk (0xf000000UL) /*!< SIMOBUCKVDDCLVACTLOWTONTRIM (Bitfield-Mask: 0x0f) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTLOWTOFFTRIM_Pos (19UL)   /*!< SIMOBUCKVDDCLVACTLOWTOFFTRIM (Bit 19)                 */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTLOWTOFFTRIM_Msk (0xf80000UL) /*!< SIMOBUCKVDDCLVACTLOWTOFFTRIM (Bitfield-Mask: 0x1f) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTLOWTOFFTRIMFINE_Pos (15UL) /*!< SIMOBUCKVDDCLVACTLOWTOFFTRIMFINE (Bit 15)           */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTLOWTOFFTRIMFINE_Msk (0x78000UL) /*!< SIMOBUCKVDDCLVACTLOWTOFFTRIMFINE (Bitfield-Mask: 0x0f) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTHIGHTONTRIM_Pos (11UL)   /*!< SIMOBUCKVDDCLVACTHIGHTONTRIM (Bit 11)                 */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTHIGHTONTRIM_Msk (0x7800UL) /*!< SIMOBUCKVDDCLVACTHIGHTONTRIM (Bitfield-Mask: 0x0f)  */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTHIGHTOFFTRIM_Pos (6UL)   /*!< SIMOBUCKVDDCLVACTHIGHTOFFTRIM (Bit 6)                 */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTHIGHTOFFTRIM_Msk (0x7c0UL) /*!< SIMOBUCKVDDCLVACTHIGHTOFFTRIM (Bitfield-Mask: 0x1f) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTHIGHTOFFTRIMFINE_Pos (2UL) /*!< SIMOBUCKVDDCLVACTHIGHTOFFTRIMFINE (Bit 2)           */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTHIGHTOFFTRIMFINE_Msk (0x3cUL) /*!< SIMOBUCKVDDCLVACTHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTDRVSTRTRIM_Pos (0UL)     /*!< SIMOBUCKVDDCLVACTDRVSTRTRIM (Bit 0)                   */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKVDDCLVACTDRVSTRTRIM_Msk (0x3UL)   /*!< SIMOBUCKVDDCLVACTDRVSTRTRIM (Bitfield-Mask: 0x03)     */
/* ======================================================  SIMOBUCK15  ======================================================= */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKZXCOMPOFFSETTRIM_Pos (24UL)      /*!< SIMOBUCKZXCOMPOFFSETTRIM (Bit 24)                     */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKZXCOMPOFFSETTRIM_Msk (0x1f000000UL) /*!< SIMOBUCKZXCOMPOFFSETTRIM (Bitfield-Mask: 0x1f)     */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDCRXCOMPTRIMEN_Pos (23UL)      /*!< SIMOBUCKVDDCRXCOMPTRIMEN (Bit 23)                     */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDCRXCOMPTRIMEN_Msk (0x800000UL) /*!< SIMOBUCKVDDCRXCOMPTRIMEN (Bitfield-Mask: 0x01)       */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDFRXCOMPTRIMEN_Pos (22UL)      /*!< SIMOBUCKVDDFRXCOMPTRIMEN (Bit 22)                     */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDFRXCOMPTRIMEN_Msk (0x400000UL) /*!< SIMOBUCKVDDFRXCOMPTRIMEN (Bitfield-Mask: 0x01)       */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDSRXCOMPTRIMEN_Pos (21UL)      /*!< SIMOBUCKVDDSRXCOMPTRIMEN (Bit 21)                     */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDSRXCOMPTRIMEN_Msk (0x200000UL) /*!< SIMOBUCKVDDSRXCOMPTRIMEN (Bitfield-Mask: 0x01)       */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDCLVRXCOMPTRIMEN_Pos (20UL)    /*!< SIMOBUCKVDDCLVRXCOMPTRIMEN (Bit 20)                   */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDCLVRXCOMPTRIMEN_Msk (0x100000UL) /*!< SIMOBUCKVDDCLVRXCOMPTRIMEN (Bitfield-Mask: 0x01)   */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDCBRNOUTTRIM_Pos (10UL)        /*!< SIMOBUCKVDDCBRNOUTTRIM (Bit 10)                       */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDCBRNOUTTRIM_Msk (0xffc00UL)   /*!< SIMOBUCKVDDCBRNOUTTRIM (Bitfield-Mask: 0x3ff)         */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDCCOMPTRIMPLUS_Pos (5UL)       /*!< SIMOBUCKVDDCCOMPTRIMPLUS (Bit 5)                      */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDCCOMPTRIMPLUS_Msk (0x3e0UL)   /*!< SIMOBUCKVDDCCOMPTRIMPLUS (Bitfield-Mask: 0x1f)        */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDCCOMPTRIMMINUS_Pos (0UL)      /*!< SIMOBUCKVDDCCOMPTRIMMINUS (Bit 0)                     */
#define MCUCTRL_SIMOBUCK15_SIMOBUCKVDDCCOMPTRIMMINUS_Msk (0x1fUL)   /*!< SIMOBUCKVDDCCOMPTRIMMINUS (Bitfield-Mask: 0x1f)       */
/* ========================================================  PWRSW0  ========================================================= */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1OVERRIDE_Pos (23UL)             /*!< PWRSWVDDMDSP1OVERRIDE (Bit 23)                        */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1OVERRIDE_Msk (0x800000UL)       /*!< PWRSWVDDMDSP1OVERRIDE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1STATSEL_Pos (22UL)              /*!< PWRSWVDDMDSP1STATSEL (Bit 22)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1STATSEL_Msk (0x400000UL)        /*!< PWRSWVDDMDSP1STATSEL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1DYNSEL_Pos (21UL)               /*!< PWRSWVDDMDSP1DYNSEL (Bit 21)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1DYNSEL_Msk (0x200000UL)         /*!< PWRSWVDDMDSP1DYNSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0OVERRIDE_Pos (20UL)             /*!< PWRSWVDDMDSP0OVERRIDE (Bit 20)                        */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0OVERRIDE_Msk (0x100000UL)       /*!< PWRSWVDDMDSP0OVERRIDE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0STATSEL_Pos (19UL)              /*!< PWRSWVDDMDSP0STATSEL (Bit 19)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0STATSEL_Msk (0x80000UL)         /*!< PWRSWVDDMDSP0STATSEL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0DYNSEL_Pos (18UL)               /*!< PWRSWVDDMDSP0DYNSEL (Bit 18)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0DYNSEL_Msk (0x40000UL)          /*!< PWRSWVDDMDSP0DYNSEL (Bitfield-Mask: 0x01)             */
/* ========================================================  PWRSW1  ========================================================= */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSORVAL_Pos (31UL)                /*!< SHORTVDDFVDDSORVAL (Bit 31)                           */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSORVAL_Msk (0x80000000UL)        /*!< SHORTVDDFVDDSORVAL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSOREN_Pos (30UL)                 /*!< SHORTVDDFVDDSOREN (Bit 30)                            */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSOREN_Msk (0x40000000UL)         /*!< SHORTVDDFVDDSOREN (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVORVAL_Pos (29UL)              /*!< SHORTVDDCVDDCLVORVAL (Bit 29)                         */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVORVAL_Msk (0x20000000UL)      /*!< SHORTVDDCVDDCLVORVAL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVOREN_Pos (28UL)               /*!< SHORTVDDCVDDCLVOREN (Bit 28)                          */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVOREN_Msk (0x10000000UL)       /*!< SHORTVDDCVDDCLVOREN (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW1_FORCEVDDRMOFF_Pos  (27UL)                    /*!< FORCEVDDRMOFF (Bit 27)                                */
#define MCUCTRL_PWRSW1_FORCEVDDRMOFF_Msk  (0x8000000UL)             /*!< FORCEVDDRMOFF (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_FORCEVDDRMVDDS_Pos (26UL)                    /*!< FORCEVDDRMVDDS (Bit 26)                               */
#define MCUCTRL_PWRSW1_FORCEVDDRMVDDS_Msk (0x4000000UL)             /*!< FORCEVDDRMVDDS (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_PWRSW1_USEVDDF4VDDRCPUINHP_Pos (25UL)               /*!< USEVDDF4VDDRCPUINHP (Bit 25)                          */
#define MCUCTRL_PWRSW1_USEVDDF4VDDRCPUINHP_Msk (0x2000000UL)        /*!< USEVDDF4VDDRCPUINHP (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW1_DIGPWRSWOVRDRVSEL_Pos (23UL)                 /*!< DIGPWRSWOVRDRVSEL (Bit 23)                            */
#define MCUCTRL_PWRSW1_DIGPWRSWOVRDRVSEL_Msk (0x1800000UL)          /*!< DIGPWRSWOVRDRVSEL (Bitfield-Mask: 0x03)               */
#define MCUCTRL_PWRSW1_DIGPWRSWOVRDRVEN_Pos (22UL)                  /*!< DIGPWRSWOVRDRVEN (Bit 22)                             */
#define MCUCTRL_PWRSW1_DIGPWRSWOVRDRVEN_Msk (0x400000UL)            /*!< DIGPWRSWOVRDRVEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW1_PWRSWOVRDRVEN_Pos  (21UL)                    /*!< PWRSWOVRDRVEN (Bit 21)                                */
#define MCUCTRL_PWRSW1_PWRSWOVRDRVEN_Msk  (0x200000UL)              /*!< PWRSWOVRDRVEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_PWRSWCOMPPDNB_Pos  (20UL)                    /*!< PWRSWCOMPPDNB (Bit 20)                                */
#define MCUCTRL_PWRSW1_PWRSWCOMPPDNB_Msk  (0x100000UL)              /*!< PWRSWCOMPPDNB (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_PWRSWVDDLOVERRIDE_Pos (19UL)                 /*!< PWRSWVDDLOVERRIDE (Bit 19)                            */
#define MCUCTRL_PWRSW1_PWRSWVDDLOVERRIDE_Msk (0x80000UL)            /*!< PWRSWVDDLOVERRIDE (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_PWRSWVDDLPGN_Pos   (18UL)                    /*!< PWRSWVDDLPGN (Bit 18)                                 */
#define MCUCTRL_PWRSW1_PWRSWVDDLPGN_Msk   (0x40000UL)               /*!< PWRSWVDDLPGN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_PWRSW1_PWRSWVDDRMOVERRIDE_Pos (17UL)                /*!< PWRSWVDDRMOVERRIDE (Bit 17)                           */
#define MCUCTRL_PWRSW1_PWRSWVDDRMOVERRIDE_Msk (0x20000UL)           /*!< PWRSWVDDRMOVERRIDE (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_Pos (16UL)                 /*!< PWRSWVDDRMSTATSEL (Bit 16)                            */
#define MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_Msk (0x10000UL)            /*!< PWRSWVDDRMSTATSEL (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_PWRSWVDDRMPGN_Pos  (15UL)                    /*!< PWRSWVDDRMPGN (Bit 15)                                */
#define MCUCTRL_PWRSW1_PWRSWVDDRMPGN_Msk  (0x8000UL)                /*!< PWRSWVDDRMPGN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_PWRSWVDDRMDYNSEL_Pos (14UL)                  /*!< PWRSWVDDRMDYNSEL (Bit 14)                             */
#define MCUCTRL_PWRSW1_PWRSWVDDRMDYNSEL_Msk (0x4000UL)              /*!< PWRSWVDDRMDYNSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW1_PWRSWVDDRLOVERRIDE_Pos (13UL)                /*!< PWRSWVDDRLOVERRIDE (Bit 13)                           */
#define MCUCTRL_PWRSW1_PWRSWVDDRLOVERRIDE_Msk (0x2000UL)            /*!< PWRSWVDDRLOVERRIDE (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_Pos (12UL)                 /*!< PWRSWVDDRLSTATSEL (Bit 12)                            */
#define MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_Msk (0x1000UL)             /*!< PWRSWVDDRLSTATSEL (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_PWRSWVDDRLPGN_Pos  (11UL)                    /*!< PWRSWVDDRLPGN (Bit 11)                                */
#define MCUCTRL_PWRSW1_PWRSWVDDRLPGN_Msk  (0x800UL)                 /*!< PWRSWVDDRLPGN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_PWRSWVDDRLDYNSEL_Pos (10UL)                  /*!< PWRSWVDDRLDYNSEL (Bit 10)                             */
#define MCUCTRL_PWRSW1_PWRSWVDDRLDYNSEL_Msk (0x400UL)               /*!< PWRSWVDDRLDYNSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1OVERRIDE_Pos (9UL)              /*!< PWRSWVDDRDSP1OVERRIDE (Bit 9)                         */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1OVERRIDE_Msk (0x200UL)          /*!< PWRSWVDDRDSP1OVERRIDE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1STATSEL_Pos (8UL)               /*!< PWRSWVDDRDSP1STATSEL (Bit 8)                          */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1STATSEL_Msk (0x100UL)           /*!< PWRSWVDDRDSP1STATSEL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1PGN_Pos (7UL)                   /*!< PWRSWVDDRDSP1PGN (Bit 7)                              */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1PGN_Msk (0x80UL)                /*!< PWRSWVDDRDSP1PGN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1DYNSEL_Pos (5UL)                /*!< PWRSWVDDRDSP1DYNSEL (Bit 5)                           */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP1DYNSEL_Msk (0x60UL)             /*!< PWRSWVDDRDSP1DYNSEL (Bitfield-Mask: 0x03)             */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0OVERRIDE_Pos (4UL)              /*!< PWRSWVDDRDSP0OVERRIDE (Bit 4)                         */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0OVERRIDE_Msk (0x10UL)           /*!< PWRSWVDDRDSP0OVERRIDE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0STATSEL_Pos (3UL)               /*!< PWRSWVDDRDSP0STATSEL (Bit 3)                          */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0STATSEL_Msk (0x8UL)             /*!< PWRSWVDDRDSP0STATSEL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0PGN_Pos (2UL)                   /*!< PWRSWVDDRDSP0PGN (Bit 2)                              */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0PGN_Msk (0x4UL)                 /*!< PWRSWVDDRDSP0PGN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0DYNSEL_Pos (0UL)                /*!< PWRSWVDDRDSP0DYNSEL (Bit 0)                           */
#define MCUCTRL_PWRSW1_PWRSWVDDRDSP0DYNSEL_Msk (0x3UL)              /*!< PWRSWVDDRDSP0DYNSEL (Bitfield-Mask: 0x03)             */
/* ======================================================  FLASHWPROT0  ====================================================== */
#define MCUCTRL_FLASHWPROT0_FW0BITS_Pos   (0UL)                     /*!< FW0BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT0_FW0BITS_Msk   (0xffffffffUL)            /*!< FW0BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT1  ====================================================== */
#define MCUCTRL_FLASHWPROT1_FW1BITS_Pos   (0UL)                     /*!< FW1BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT1_FW1BITS_Msk   (0xffffffffUL)            /*!< FW1BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT2  ====================================================== */
#define MCUCTRL_FLASHWPROT2_FW2BITS_Pos   (0UL)                     /*!< FW2BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT2_FW2BITS_Msk   (0xffffffffUL)            /*!< FW2BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT3  ====================================================== */
#define MCUCTRL_FLASHWPROT3_FW3BITS_Pos   (0UL)                     /*!< FW3BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT3_FW3BITS_Msk   (0xffffffffUL)            /*!< FW3BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT0  ====================================================== */
#define MCUCTRL_FLASHRPROT0_FR0BITS_Pos   (0UL)                     /*!< FR0BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT0_FR0BITS_Msk   (0xffffffffUL)            /*!< FR0BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT1  ====================================================== */
#define MCUCTRL_FLASHRPROT1_FR1BITS_Pos   (0UL)                     /*!< FR1BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT1_FR1BITS_Msk   (0xffffffffUL)            /*!< FR1BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT2  ====================================================== */
#define MCUCTRL_FLASHRPROT2_FR2BITS_Pos   (0UL)                     /*!< FR2BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT2_FR2BITS_Msk   (0xffffffffUL)            /*!< FR2BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT3  ====================================================== */
#define MCUCTRL_FLASHRPROT3_FR3BITS_Pos   (0UL)                     /*!< FR3BITS (Bit 0)                                       */
