AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
#define MCUCTRL_FLASHRPROT3_FR3BITS_Msk   (0xffffffffUL)            /*!< FR3BITS (Bitfield-Mask: 0xffffffff)                   */
/* =====================================================  DMASRAMWPROT0  ===================================================== */
#define MCUCTRL_DMASRAMWPROT0_DMAWPROT0_Pos (0UL)                   /*!< DMAWPROT0 (Bit 0)                                     */
#define MCUCTRL_DMASRAMWPROT0_DMAWPROT0_Msk (0xffffffffUL)          /*!< DMAWPROT0 (Bitfield-Mask: 0xffffffff)                 */
/* =====================================================  DMASRAMWPROT1  ===================================================== */
#define MCUCTRL_DMASRAMWPROT1_DMAWPROT1_Pos (0UL)                   /*!< DMAWPROT1 (Bit 0)                                     */
#define MCUCTRL_DMASRAMWPROT1_DMAWPROT1_Msk (0xffffUL)              /*!< DMAWPROT1 (Bitfield-Mask: 0xffff)                     */
/* =====================================================  DMASRAMRPROT0  ===================================================== */
#define MCUCTRL_DMASRAMRPROT0_DMARPROT0_Pos (0UL)                   /*!< DMARPROT0 (Bit 0)                                     */
#define MCUCTRL_DMASRAMRPROT0_DMARPROT0_Msk (0xffffffffUL)          /*!< DMARPROT0 (Bitfield-Mask: 0xffffffff)                 */
/* =====================================================  DMASRAMRPROT1  ===================================================== */
#define MCUCTRL_DMASRAMRPROT1_DMARPROT1_Pos (0UL)                   /*!< DMARPROT1 (Bit 0)                                     */
#define MCUCTRL_DMASRAMRPROT1_DMARPROT1_Msk (0xffffUL)              /*!< DMARPROT1 (Bitfield-Mask: 0xffff)                     */
/* ========================================================  AUDIO1  ========================================================= */
#define MCUCTRL_AUDIO1_MICBIASPDNB_Pos    (12UL)                    /*!< MICBIASPDNB (Bit 12)                                  */
#define MCUCTRL_AUDIO1_MICBIASPDNB_Msk    (0x1000UL)                /*!< MICBIASPDNB (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_AUDIO1_MICBIASVOLTAGETRIM_Pos (6UL)                 /*!< MICBIASVOLTAGETRIM (Bit 6)                            */
#define MCUCTRL_AUDIO1_MICBIASVOLTAGETRIM_Msk (0xfc0UL)             /*!< MICBIASVOLTAGETRIM (Bitfield-Mask: 0x3f)              */
/* =====================================================  PGAADCIFCTRL  ====================================================== */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFVCOMPSEL_Pos (13UL)            /*!< PGAADCIFVCOMPSEL (Bit 13)                             */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFVCOMPSEL_Msk (0x6000UL)        /*!< PGAADCIFVCOMPSEL (Bitfield-Mask: 0x03)                */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFVCOMPEN_Pos (12UL)             /*!< PGAADCIFVCOMPEN (Bit 12)                              */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFVCOMPEN_Msk (0x1000UL)         /*!< PGAADCIFVCOMPEN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFTESTPADSEL_Pos (9UL)           /*!< PGAADCIFTESTPADSEL (Bit 9)                            */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFTESTPADSEL_Msk (0xe00UL)       /*!< PGAADCIFTESTPADSEL (Bitfield-Mask: 0x07)              */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFTESTPADEN_Pos (8UL)            /*!< PGAADCIFTESTPADEN (Bit 8)                             */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFTESTPADEN_Msk (0x100UL)        /*!< PGAADCIFTESTPADEN (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFCHBPDNB_Pos (6UL)              /*!< PGAADCIFCHBPDNB (Bit 6)                               */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFCHBPDNB_Msk (0xc0UL)           /*!< PGAADCIFCHBPDNB (Bitfield-Mask: 0x03)                 */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFCHBACTIVE_Pos (4UL)            /*!< PGAADCIFCHBACTIVE (Bit 4)                             */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFCHBACTIVE_Msk (0x30UL)         /*!< PGAADCIFCHBACTIVE (Bitfield-Mask: 0x03)               */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFCHAPDNB_Pos (2UL)              /*!< PGAADCIFCHAPDNB (Bit 2)                               */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFCHAPDNB_Msk (0xcUL)            /*!< PGAADCIFCHAPDNB (Bitfield-Mask: 0x03)                 */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFCHAACTIVE_Pos (0UL)            /*!< PGAADCIFCHAACTIVE (Bit 0)                             */
#define MCUCTRL_PGAADCIFCTRL_PGAADCIFCHAACTIVE_Msk (0x3UL)          /*!< PGAADCIFCHAACTIVE (Bitfield-Mask: 0x03)               */
/* =======================================================  PGACTRL1  ======================================================== */
#define MCUCTRL_PGACTRL1_VCOMPSELPGA_Pos  (29UL)                    /*!< VCOMPSELPGA (Bit 29)                                  */
#define MCUCTRL_PGACTRL1_VCOMPSELPGA_Msk  (0x20000000UL)            /*!< VCOMPSELPGA (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_PGACTRL1_PGAVREFGENQUICKSTARTEN_Pos (28UL)          /*!< PGAVREFGENQUICKSTARTEN (Bit 28)                       */
#define MCUCTRL_PGACTRL1_PGAVREFGENQUICKSTARTEN_Msk (0x10000000UL)  /*!< PGAVREFGENQUICKSTARTEN (Bitfield-Mask: 0x01)          */
#define MCUCTRL_PGACTRL1_PGAVREFGENPDNB_Pos (27UL)                  /*!< PGAVREFGENPDNB (Bit 27)                               */
#define MCUCTRL_PGACTRL1_PGAVREFGENPDNB_Msk (0x8000000UL)           /*!< PGAVREFGENPDNB (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_PGACTRL1_PGAIREFGENPDNB_Pos (26UL)                  /*!< PGAIREFGENPDNB (Bit 26)                               */
#define MCUCTRL_PGACTRL1_PGAIREFGENPDNB_Msk (0x4000000UL)           /*!< PGAIREFGENPDNB (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_PGACTRL1_PGACHAVCMGENQCHARGEEN_Pos (25UL)           /*!< PGACHAVCMGENQCHARGEEN (Bit 25)                        */
#define MCUCTRL_PGACTRL1_PGACHAVCMGENQCHARGEEN_Msk (0x2000000UL)    /*!< PGACHAVCMGENQCHARGEEN (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PGACTRL1_PGACHAVCMGENPDNB_Pos (24UL)                /*!< PGACHAVCMGENPDNB (Bit 24)                             */
#define MCUCTRL_PGACTRL1_PGACHAVCMGENPDNB_Msk (0x1000000UL)         /*!< PGACHAVCMGENPDNB (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PGACTRL1_PGACHAOPAMPOUTPDNB_Pos (22UL)              /*!< PGACHAOPAMPOUTPDNB (Bit 22)                           */
#define MCUCTRL_PGACTRL1_PGACHAOPAMPOUTPDNB_Msk (0xc00000UL)        /*!< PGACHAOPAMPOUTPDNB (Bitfield-Mask: 0x03)              */
#define MCUCTRL_PGACTRL1_PGACHAOPAMPINPDNB_Pos (20UL)               /*!< PGACHAOPAMPINPDNB (Bit 20)                            */
#define MCUCTRL_PGACTRL1_PGACHAOPAMPINPDNB_Msk (0x300000UL)         /*!< PGACHAOPAMPINPDNB (Bitfield-Mask: 0x03)               */
#define MCUCTRL_PGACTRL1_PGACHABYPASSEN_Pos (18UL)                  /*!< PGACHABYPASSEN (Bit 18)                               */
#define MCUCTRL_PGACTRL1_PGACHABYPASSEN_Msk (0xc0000UL)             /*!< PGACHABYPASSEN (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_PGACTRL1_PGACHA1GAIN2SEL_Pos (13UL)                 /*!< PGACHA1GAIN2SEL (Bit 13)                              */
#define MCUCTRL_PGACTRL1_PGACHA1GAIN2SEL_Msk (0x3e000UL)            /*!< PGACHA1GAIN2SEL (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_PGACTRL1_PGACHA1GAIN2DIV2SEL_Pos (12UL)             /*!< PGACHA1GAIN2DIV2SEL (Bit 12)                          */
#define MCUCTRL_PGACTRL1_PGACHA1GAIN2DIV2SEL_Msk (0x1000UL)         /*!< PGACHA1GAIN2DIV2SEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PGACTRL1_PGACHA1GAIN1SEL_Pos (9UL)                  /*!< PGACHA1GAIN1SEL (Bit 9)                               */
#define MCUCTRL_PGACTRL1_PGACHA1GAIN1SEL_Msk (0xe00UL)              /*!< PGACHA1GAIN1SEL (Bitfield-Mask: 0x07)                 */
#define MCUCTRL_PGACTRL1_PGACHA0GAIN2SEL_Pos (4UL)                  /*!< PGACHA0GAIN2SEL (Bit 4)                               */
#define MCUCTRL_PGACTRL1_PGACHA0GAIN2SEL_Msk (0x1f0UL)              /*!< PGACHA0GAIN2SEL (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_PGACTRL1_PGACHA0GAIN2DIV2SEL_Pos (3UL)              /*!< PGACHA0GAIN2DIV2SEL (Bit 3)                           */
#define MCUCTRL_PGACTRL1_PGACHA0GAIN2DIV2SEL_Msk (0x8UL)            /*!< PGACHA0GAIN2DIV2SEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PGACTRL1_PGACHA0GAIN1SEL_Pos (0UL)                  /*!< PGACHA0GAIN1SEL (Bit 0)                               */
#define MCUCTRL_PGACTRL1_PGACHA0GAIN1SEL_Msk (0x7UL)                /*!< PGACHA0GAIN1SEL (Bitfield-Mask: 0x07)                 */
/* =======================================================  PGACTRL2  ======================================================== */
#define MCUCTRL_PGACTRL2_PGACHBVCMGENQCHARGEEN_Pos (25UL)           /*!< PGACHBVCMGENQCHARGEEN (Bit 25)                        */
#define MCUCTRL_PGACTRL2_PGACHBVCMGENQCHARGEEN_Msk (0x2000000UL)    /*!< PGACHBVCMGENQCHARGEEN (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PGACTRL2_PGACHBVCMGENPDNB_Pos (24UL)                /*!< PGACHBVCMGENPDNB (Bit 24)                             */
#define MCUCTRL_PGACTRL2_PGACHBVCMGENPDNB_Msk (0x1000000UL)         /*!< PGACHBVCMGENPDNB (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PGACTRL2_PGACHBOPAMPOUTPDNB_Pos (22UL)              /*!< PGACHBOPAMPOUTPDNB (Bit 22)                           */
#define MCUCTRL_PGACTRL2_PGACHBOPAMPOUTPDNB_Msk (0xc00000UL)        /*!< PGACHBOPAMPOUTPDNB (Bitfield-Mask: 0x03)              */
#define MCUCTRL_PGACTRL2_PGACHBOPAMPINPDNB_Pos (20UL)               /*!< PGACHBOPAMPINPDNB (Bit 20)                            */
#define MCUCTRL_PGACTRL2_PGACHBOPAMPINPDNB_Msk (0x300000UL)         /*!< PGACHBOPAMPINPDNB (Bitfield-Mask: 0x03)               */
#define MCUCTRL_PGACTRL2_PGACHBBYPASSEN_Pos (18UL)                  /*!< PGACHBBYPASSEN (Bit 18)                               */
#define MCUCTRL_PGACTRL2_PGACHBBYPASSEN_Msk (0xc0000UL)             /*!< PGACHBBYPASSEN (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_PGACTRL2_PGACHB1GAIN2SEL_Pos (13UL)                 /*!< PGACHB1GAIN2SEL (Bit 13)                              */
#define MCUCTRL_PGACTRL2_PGACHB1GAIN2SEL_Msk (0x3e000UL)            /*!< PGACHB1GAIN2SEL (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_PGACTRL2_PGACHB1GAIN2DIV2SEL_Pos (12UL)             /*!< PGACHB1GAIN2DIV2SEL (Bit 12)                          */
#define MCUCTRL_PGACTRL2_PGACHB1GAIN2DIV2SEL_Msk (0x1000UL)         /*!< PGACHB1GAIN2DIV2SEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PGACTRL2_PGACHB1GAIN1SEL_Pos (9UL)                  /*!< PGACHB1GAIN1SEL (Bit 9)                               */
#define MCUCTRL_PGACTRL2_PGACHB1GAIN1SEL_Msk (0xe00UL)              /*!< PGACHB1GAIN1SEL (Bitfield-Mask: 0x07)                 */
#define MCUCTRL_PGACTRL2_PGACHB0GAIN2SEL_Pos (4UL)                  /*!< PGACHB0GAIN2SEL (Bit 4)                               */
#define MCUCTRL_PGACTRL2_PGACHB0GAIN2SEL_Msk (0x1f0UL)              /*!< PGACHB0GAIN2SEL (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_PGACTRL2_PGACHB0GAIN2DIV2SEL_Pos (3UL)              /*!< PGACHB0GAIN2DIV2SEL (Bit 3)                           */
#define MCUCTRL_PGACTRL2_PGACHB0GAIN2DIV2SEL_Msk (0x8UL)            /*!< PGACHB0GAIN2DIV2SEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PGACTRL2_PGACHB0GAIN1SEL_Pos (0UL)                  /*!< PGACHB0GAIN1SEL (Bit 0)                               */
#define MCUCTRL_PGACTRL2_PGACHB0GAIN1SEL_Msk (0x7UL)                /*!< PGACHB0GAIN1SEL (Bitfield-Mask: 0x07)                 */
/* =====================================================  AUDADCPWRDLY  ====================================================== */
#define MCUCTRL_AUDADCPWRDLY_AUDADCPWR1_Pos (8UL)                   /*!< AUDADCPWR1 (Bit 8)                                    */
#define MCUCTRL_AUDADCPWRDLY_AUDADCPWR1_Msk (0xff00UL)              /*!< AUDADCPWR1 (Bitfield-Mask: 0xff)                      */
#define MCUCTRL_AUDADCPWRDLY_AUDADCPWR0_Pos (0UL)                   /*!< AUDADCPWR0 (Bit 0)                                    */
#define MCUCTRL_AUDADCPWRDLY_AUDADCPWR0_Msk (0xffUL)                /*!< AUDADCPWR0 (Bitfield-Mask: 0xff)                      */


/* =========================================================================================================================== */
/* ================                                          MEMCPY0                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
#define MEMCPY0_CTRL_HASH_Pos             (8UL)                     /*!< HASH (Bit 8)                                          */
#define MEMCPY0_CTRL_HASH_Msk             (0xf00UL)                 /*!< HASH (Bitfield-Mask: 0x0f)                            */
#define MEMCPY0_CTRL_FUNCTION_Pos         (4UL)                     /*!< FUNCTION (Bit 4)                                      */
#define MEMCPY0_CTRL_FUNCTION_Msk         (0xf0UL)                  /*!< FUNCTION (Bitfield-Mask: 0x0f)                        */
#define MEMCPY0_CTRL_DSTSTATIC_Pos        (3UL)                     /*!< DSTSTATIC (Bit 3)                                     */
#define MEMCPY0_CTRL_DSTSTATIC_Msk        (0x8UL)                   /*!< DSTSTATIC (Bitfield-Mask: 0x01)                       */
#define MEMCPY0_CTRL_SRCSTATIC_Pos        (2UL)                     /*!< SRCSTATIC (Bit 2)                                     */
#define MEMCPY0_CTRL_SRCSTATIC_Msk        (0x4UL)                   /*!< SRCSTATIC (Bitfield-Mask: 0x01)                       */
#define MEMCPY0_CTRL_PRIORITY_Pos         (1UL)                     /*!< PRIORITY (Bit 1)                                      */
#define MEMCPY0_CTRL_PRIORITY_Msk         (0x2UL)                   /*!< PRIORITY (Bitfield-Mask: 0x01)                        */
#define MEMCPY0_CTRL_ENABLE_Pos           (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define MEMCPY0_CTRL_ENABLE_Msk           (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* ========================================================  STATUS  ========================================================= */
#define MEMCPY0_STATUS_ERR_Pos            (2UL)                     /*!< ERR (Bit 2)                                           */
#define MEMCPY0_STATUS_ERR_Msk            (0x4UL)                   /*!< ERR (Bitfield-Mask: 0x01)                             */
#define MEMCPY0_STATUS_CPL_Pos            (1UL)                     /*!< CPL (Bit 1)                                           */
#define MEMCPY0_STATUS_CPL_Msk            (0x2UL)                   /*!< CPL (Bitfield-Mask: 0x01)                             */
#define MEMCPY0_STATUS_TIP_Pos            (0UL)                     /*!< TIP (Bit 0)                                           */
#define MEMCPY0_STATUS_TIP_Msk            (0x1UL)                   /*!< TIP (Bitfield-Mask: 0x01)                             */
/* ========================================================  SRCADDR  ======================================================== */
#define MEMCPY0_SRCADDR_SRCADDR_Pos       (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define MEMCPY0_SRCADDR_SRCADDR_Msk       (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  TARGADDR  ======================================================== */
#define MEMCPY0_TARGADDR_TARGADDR_Pos     (0UL)                     /*!< TARGADDR (Bit 0)                                      */
#define MEMCPY0_TARGADDR_TARGADDR_Msk     (0xffffffffUL)            /*!< TARGADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  TOTCOUNT  ======================================================== */
#define MEMCPY0_TOTCOUNT_TOTCOUNT_Pos     (0UL)                     /*!< TOTCOUNT (Bit 0)                                      */
#define MEMCPY0_TOTCOUNT_TOTCOUNT_Msk     (0xffffffUL)              /*!< TOTCOUNT (Bitfield-Mask: 0xffffff)                    */
/* ========================================================  BCOUNT  ========================================================= */
#define MEMCPY0_BCOUNT_BCOUNT_Pos         (0UL)                     /*!< BCOUNT (Bit 0)                                        */
#define MEMCPY0_BCOUNT_BCOUNT_Msk         (0xffUL)                  /*!< BCOUNT (Bitfield-Mask: 0xff)                          */
/* ========================================================  CURSRC  ========================================================= */
#define MEMCPY0_CURSRC_CURSRC_Pos         (0UL)                     /*!< CURSRC (Bit 0)                                        */
#define MEMCPY0_CURSRC_CURSRC_Msk         (0xffffffffUL)            /*!< CURSRC (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  CURDST  ========================================================= */
#define MEMCPY0_CURDST_CURDST_Pos         (0UL)                     /*!< CURDST (Bit 0)                                        */
#define MEMCPY0_CURDST_CURDST_Msk         (0xffffffffUL)            /*!< CURDST (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  CURCOUNT  ======================================================== */
#define MEMCPY0_CURCOUNT_CURCOUNT_Pos     (0UL)                     /*!< CURCOUNT (Bit 0)                                      */
#define MEMCPY0_CURCOUNT_CURCOUNT_Msk     (0xffffffUL)              /*!< CURCOUNT (Bitfield-Mask: 0xffffff)                    */


/* =========================================================================================================================== */
/* ================                                           MRAM                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  STATUS  ========================================================= */
#define MRAM_STATUS_ADDRERROR_Pos         (1UL)                     /*!< ADDRERROR (Bit 1)                                     */
#define MRAM_STATUS_ADDRERROR_Msk         (0x2UL)                   /*!< ADDRERROR (Bitfield-Mask: 0x01)                       */
#define MRAM_STATUS_BUSY_Pos              (0UL)                     /*!< BUSY (Bit 0)                                          */
#define MRAM_STATUS_BUSY_Msk              (0x1UL)                   /*!< BUSY (Bitfield-Mask: 0x01)                            */
/* =========================================================  CTRL  ========================================================== */
#define MRAM_CTRL_GENCMD_Pos              (3UL)                     /*!< GENCMD (Bit 3)                                        */
#define MRAM_CTRL_GENCMD_Msk              (0x8UL)                   /*!< GENCMD (Bitfield-Mask: 0x01)                          */
#define MRAM_CTRL_PROGRAM_Pos             (2UL)                     /*!< PROGRAM (Bit 2)                                       */
#define MRAM_CTRL_PROGRAM_Msk             (0x4UL)                   /*!< PROGRAM (Bitfield-Mask: 0x01)                         */
#define MRAM_CTRL_CLRLOAD_Pos             (1UL)                     /*!< CLRLOAD (Bit 1)                                       */
#define MRAM_CTRL_CLRLOAD_Msk             (0x2UL)                   /*!< CLRLOAD (Bitfield-Mask: 0x01)                         */
#define MRAM_CTRL_LOAD_Pos                (0UL)                     /*!< LOAD (Bit 0)                                          */
#define MRAM_CTRL_LOAD_Msk                (0x1UL)                   /*!< LOAD (Bitfield-Mask: 0x01)                            */
/* ========================================================  ACCESS  ========================================================= */
#define MRAM_ACCESS_ACCESS_Pos            (0UL)                     /*!< ACCESS (Bit 0)                                        */
#define MRAM_ACCESS_ACCESS_Msk            (0xffffffffUL)            /*!< ACCESS (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  TMCCTRL  ======================================================== */
#define MRAM_TMCCTRL_TMCOVERRIDE_Pos      (4UL)                     /*!< TMCOVERRIDE (Bit 4)                                   */
#define MRAM_TMCCTRL_TMCOVERRIDE_Msk      (0x10UL)                  /*!< TMCOVERRIDE (Bitfield-Mask: 0x01)                     */
#define MRAM_TMCCTRL_TMCSLP_Pos           (3UL)                     /*!< TMCSLP (Bit 3)                                        */
#define MRAM_TMCCTRL_TMCSLP_Msk           (0x8UL)                   /*!< TMCSLP (Bitfield-Mask: 0x01)                          */
#define MRAM_TMCCTRL_TMCPD_Pos            (2UL)                     /*!< TMCPD (Bit 2)                                         */
#define MRAM_TMCCTRL_TMCPD_Msk            (0x4UL)                   /*!< TMCPD (Bitfield-Mask: 0x01)                           */
#define MRAM_TMCCTRL_TMCLPR_Pos           (1UL)                     /*!< TMCLPR (Bit 1)                                        */
#define MRAM_TMCCTRL_TMCLPR_Msk           (0x2UL)                   /*!< TMCLPR (Bitfield-Mask: 0x01)                          */
#define MRAM_TMCCTRL_TMCRST_Pos           (0UL)                     /*!< TMCRST (Bit 0)                                        */
#define MRAM_TMCCTRL_TMCRST_Msk           (0x1UL)                   /*!< TMCRST (Bitfield-Mask: 0x01)                          */
/* ========================================================  TMCCMD  ========================================================= */
#define MRAM_TMCCMD_TMCSRAMDMA_Pos        (24UL)                    /*!< TMCSRAMDMA (Bit 24)                                   */
#define MRAM_TMCCMD_TMCSRAMDMA_Msk        (0x1000000UL)             /*!< TMCSRAMDMA (Bitfield-Mask: 0x01)                      */
#define MRAM_TMCCMD_TMCINFO1_Pos          (23UL)                    /*!< TMCINFO1 (Bit 23)                                     */
#define MRAM_TMCCMD_TMCINFO1_Msk          (0x800000UL)              /*!< TMCINFO1 (Bitfield-Mask: 0x01)                        */
#define MRAM_TMCCMD_TMCINFO0_Pos          (22UL)                    /*!< TMCINFO0 (Bit 22)                                     */
#define MRAM_TMCCMD_TMCINFO0_Msk          (0x400000UL)              /*!< TMCINFO0 (Bitfield-Mask: 0x01)                        */
#define MRAM_TMCCMD_TMCXADR_Pos           (10UL)                    /*!< TMCXADR (Bit 10)                                      */
#define MRAM_TMCCMD_TMCXADR_Msk           (0x3ffc00UL)              /*!< TMCXADR (Bitfield-Mask: 0xfff)                        */
#define MRAM_TMCCMD_TMCYADR_Pos           (5UL)                     /*!< TMCYADR (Bit 5)                                       */
#define MRAM_TMCCMD_TMCYADR_Msk           (0x3e0UL)                 /*!< TMCYADR (Bitfield-Mask: 0x1f)                         */
#define MRAM_TMCCMD_TMCCMD_Pos            (0UL)                     /*!< TMCCMD (Bit 0)                                        */
#define MRAM_TMCCMD_TMCCMD_Msk            (0x1fUL)                  /*!< TMCCMD (Bitfield-Mask: 0x1f)                          */


