AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
#define MSPI0_DEV1CFG_CPOL1_Pos           (15UL)                    /*!< CPOL1 (Bit 15)                                        */
#define MSPI0_DEV1CFG_CPOL1_Msk           (0x8000UL)                /*!< CPOL1 (Bitfield-Mask: 0x01)                           */
#define MSPI0_DEV1CFG_CPHA1_Pos           (14UL)                    /*!< CPHA1 (Bit 14)                                        */
#define MSPI0_DEV1CFG_CPHA1_Msk           (0x4000UL)                /*!< CPHA1 (Bitfield-Mask: 0x01)                           */
#define MSPI0_DEV1CFG_TURNAROUND1_Pos     (8UL)                     /*!< TURNAROUND1 (Bit 8)                                   */
#define MSPI0_DEV1CFG_TURNAROUND1_Msk     (0x3f00UL)                /*!< TURNAROUND1 (Bitfield-Mask: 0x3f)                     */
#define MSPI0_DEV1CFG_SEPIO1_Pos          (7UL)                     /*!< SEPIO1 (Bit 7)                                        */
#define MSPI0_DEV1CFG_SEPIO1_Msk          (0x80UL)                  /*!< SEPIO1 (Bitfield-Mask: 0x01)                          */
#define MSPI0_DEV1CFG_ISIZE1_Pos          (6UL)                     /*!< ISIZE1 (Bit 6)                                        */
#define MSPI0_DEV1CFG_ISIZE1_Msk          (0x40UL)                  /*!< ISIZE1 (Bitfield-Mask: 0x01)                          */
#define MSPI0_DEV1CFG_ASIZE1_Pos          (4UL)                     /*!< ASIZE1 (Bit 4)                                        */
#define MSPI0_DEV1CFG_ASIZE1_Msk          (0x30UL)                  /*!< ASIZE1 (Bitfield-Mask: 0x03)                          */
#define MSPI0_DEV1CFG_DEVCFG1_Pos         (0UL)                     /*!< DEVCFG1 (Bit 0)                                       */
#define MSPI0_DEV1CFG_DEVCFG1_Msk         (0xfUL)                   /*!< DEVCFG1 (Bitfield-Mask: 0x0f)                         */
/* ========================================================  DEV1DDR  ======================================================== */
#define MSPI0_DEV1DDR_TXDQSDELAY1_Pos     (16UL)                    /*!< TXDQSDELAY1 (Bit 16)                                  */
#define MSPI0_DEV1DDR_TXDQSDELAY1_Msk     (0x1f0000UL)              /*!< TXDQSDELAY1 (Bitfield-Mask: 0x1f)                     */
#define MSPI0_DEV1DDR_RXDQSDELAY1_Pos     (8UL)                     /*!< RXDQSDELAY1 (Bit 8)                                   */
#define MSPI0_DEV1DDR_RXDQSDELAY1_Msk     (0x1f00UL)                /*!< RXDQSDELAY1 (Bitfield-Mask: 0x1f)                     */
#define MSPI0_DEV1DDR_ENABLEFINEDELAY1_Pos (6UL)                    /*!< ENABLEFINEDELAY1 (Bit 6)                              */
#define MSPI0_DEV1DDR_ENABLEFINEDELAY1_Msk (0x40UL)                 /*!< ENABLEFINEDELAY1 (Bitfield-Mask: 0x01)                */
#define MSPI0_DEV1DDR_OVERRIDEDDRCLKOUTDELAY1_Pos (5UL)             /*!< OVERRIDEDDRCLKOUTDELAY1 (Bit 5)                       */
#define MSPI0_DEV1DDR_OVERRIDEDDRCLKOUTDELAY1_Msk (0x20UL)          /*!< OVERRIDEDDRCLKOUTDELAY1 (Bitfield-Mask: 0x01)         */
#define MSPI0_DEV1DDR_OVERRIDERXDQSDELAY1_Pos (4UL)                 /*!< OVERRIDERXDQSDELAY1 (Bit 4)                           */
#define MSPI0_DEV1DDR_OVERRIDERXDQSDELAY1_Msk (0x10UL)              /*!< OVERRIDERXDQSDELAY1 (Bitfield-Mask: 0x01)             */
#define MSPI0_DEV1DDR_DQSSYNCNEG1_Pos     (3UL)                     /*!< DQSSYNCNEG1 (Bit 3)                                   */
#define MSPI0_DEV1DDR_DQSSYNCNEG1_Msk     (0x8UL)                   /*!< DQSSYNCNEG1 (Bitfield-Mask: 0x01)                     */
#define MSPI0_DEV1DDR_ENABLEDQS1_Pos      (2UL)                     /*!< ENABLEDQS1 (Bit 2)                                    */
#define MSPI0_DEV1DDR_ENABLEDQS1_Msk      (0x4UL)                   /*!< ENABLEDQS1 (Bitfield-Mask: 0x01)                      */
#define MSPI0_DEV1DDR_QUADDDR1_Pos        (1UL)                     /*!< QUADDDR1 (Bit 1)                                      */
#define MSPI0_DEV1DDR_QUADDDR1_Msk        (0x2UL)                   /*!< QUADDDR1 (Bitfield-Mask: 0x01)                        */
#define MSPI0_DEV1DDR_EMULATEDDR1_Pos     (0UL)                     /*!< EMULATEDDR1 (Bit 0)                                   */
#define MSPI0_DEV1DDR_EMULATEDDR1_Msk     (0x1UL)                   /*!< EMULATEDDR1 (Bitfield-Mask: 0x01)                     */
/* ========================================================  DEV1XIP  ======================================================== */
#define MSPI0_DEV1XIP_XIPENWLAT1_Pos      (12UL)                    /*!< XIPENWLAT1 (Bit 12)                                   */
#define MSPI0_DEV1XIP_XIPENWLAT1_Msk      (0x1000UL)                /*!< XIPENWLAT1 (Bitfield-Mask: 0x01)                      */
#define MSPI0_DEV1XIP_XIPENDCX1_Pos       (11UL)                    /*!< XIPENDCX1 (Bit 11)                                    */
#define MSPI0_DEV1XIP_XIPENDCX1_Msk       (0x800UL)                 /*!< XIPENDCX1 (Bitfield-Mask: 0x01)                       */
#define MSPI0_DEV1XIP_XIPMIXED1_Pos       (8UL)                     /*!< XIPMIXED1 (Bit 8)                                     */
#define MSPI0_DEV1XIP_XIPMIXED1_Msk       (0x700UL)                 /*!< XIPMIXED1 (Bitfield-Mask: 0x07)                       */
#define MSPI0_DEV1XIP_XIPSENDI1_Pos       (7UL)                     /*!< XIPSENDI1 (Bit 7)                                     */
#define MSPI0_DEV1XIP_XIPSENDI1_Msk       (0x80UL)                  /*!< XIPSENDI1 (Bitfield-Mask: 0x01)                       */
#define MSPI0_DEV1XIP_XIPSENDA1_Pos       (6UL)                     /*!< XIPSENDA1 (Bit 6)                                     */
#define MSPI0_DEV1XIP_XIPSENDA1_Msk       (0x40UL)                  /*!< XIPSENDA1 (Bitfield-Mask: 0x01)                       */
#define MSPI0_DEV1XIP_XIPENTURN1_Pos      (5UL)                     /*!< XIPENTURN1 (Bit 5)                                    */
#define MSPI0_DEV1XIP_XIPENTURN1_Msk      (0x20UL)                  /*!< XIPENTURN1 (Bitfield-Mask: 0x01)                      */
#define MSPI0_DEV1XIP_XIPBIGENDIAN1_Pos   (4UL)                     /*!< XIPBIGENDIAN1 (Bit 4)                                 */
#define MSPI0_DEV1XIP_XIPBIGENDIAN1_Msk   (0x10UL)                  /*!< XIPBIGENDIAN1 (Bitfield-Mask: 0x01)                   */
#define MSPI0_DEV1XIP_XIPACK1_Pos         (2UL)                     /*!< XIPACK1 (Bit 2)                                       */
#define MSPI0_DEV1XIP_XIPACK1_Msk         (0xcUL)                   /*!< XIPACK1 (Bitfield-Mask: 0x03)                         */
#define MSPI0_DEV1XIP_XIPEN1_Pos          (0UL)                     /*!< XIPEN1 (Bit 0)                                        */
#define MSPI0_DEV1XIP_XIPEN1_Msk          (0x1UL)                   /*!< XIPEN1 (Bitfield-Mask: 0x01)                          */
/* =======================================================  DEV1INSTR  ======================================================= */
#define MSPI0_DEV1INSTR_READINSTR1_Pos    (16UL)                    /*!< READINSTR1 (Bit 16)                                   */
#define MSPI0_DEV1INSTR_READINSTR1_Msk    (0xffff0000UL)            /*!< READINSTR1 (Bitfield-Mask: 0xffff)                    */
#define MSPI0_DEV1INSTR_WRITEINSTR1_Pos   (0UL)                     /*!< WRITEINSTR1 (Bit 0)                                   */
#define MSPI0_DEV1INSTR_WRITEINSTR1_Msk   (0xffffUL)                /*!< WRITEINSTR1 (Bitfield-Mask: 0xffff)                   */
/* =====================================================  DEV1BOUNDARY  ====================================================== */
#define MSPI0_DEV1BOUNDARY_DMABOUND1_Pos  (12UL)                    /*!< DMABOUND1 (Bit 12)                                    */
#define MSPI0_DEV1BOUNDARY_DMABOUND1_Msk  (0xf000UL)                /*!< DMABOUND1 (Bitfield-Mask: 0x0f)                       */
#define MSPI0_DEV1BOUNDARY_DMATIMELIMIT1_Pos (0UL)                  /*!< DMATIMELIMIT1 (Bit 0)                                 */
#define MSPI0_DEV1BOUNDARY_DMATIMELIMIT1_Msk (0xfffUL)              /*!< DMATIMELIMIT1 (Bitfield-Mask: 0xfff)                  */
/* ====================================================  DEV1SCRAMBLING  ===================================================== */
#define MSPI0_DEV1SCRAMBLING_SCRENABLE1_Pos (31UL)                  /*!< SCRENABLE1 (Bit 31)                                   */
#define MSPI0_DEV1SCRAMBLING_SCRENABLE1_Msk (0x80000000UL)          /*!< SCRENABLE1 (Bitfield-Mask: 0x01)                      */
#define MSPI0_DEV1SCRAMBLING_SCREND1_Pos  (16UL)                    /*!< SCREND1 (Bit 16)                                      */
#define MSPI0_DEV1SCRAMBLING_SCREND1_Msk  (0x3ff0000UL)             /*!< SCREND1 (Bitfield-Mask: 0x3ff)                        */
#define MSPI0_DEV1SCRAMBLING_SCRSTART1_Pos (0UL)                    /*!< SCRSTART1 (Bit 0)                                     */
#define MSPI0_DEV1SCRAMBLING_SCRSTART1_Msk (0x3ffUL)                /*!< SCRSTART1 (Bitfield-Mask: 0x3ff)                      */
/* ========================================================  DMACFG  ========================================================= */
#define MSPI0_DMACFG_DMAPWROFF_Pos        (18UL)                    /*!< DMAPWROFF (Bit 18)                                    */
#define MSPI0_DMACFG_DMAPWROFF_Msk        (0x40000UL)               /*!< DMAPWROFF (Bitfield-Mask: 0x01)                       */
#define MSPI0_DMACFG_DMAPRI_Pos           (4UL)                     /*!< DMAPRI (Bit 4)                                        */
#define MSPI0_DMACFG_DMAPRI_Msk           (0x30UL)                  /*!< DMAPRI (Bitfield-Mask: 0x03)                          */
#define MSPI0_DMACFG_DMADEV_Pos           (3UL)                     /*!< DMADEV (Bit 3)                                        */
#define MSPI0_DMACFG_DMADEV_Msk           (0x8UL)                   /*!< DMADEV (Bitfield-Mask: 0x01)                          */
#define MSPI0_DMACFG_DMADIR_Pos           (2UL)                     /*!< DMADIR (Bit 2)                                        */
#define MSPI0_DMACFG_DMADIR_Msk           (0x4UL)                   /*!< DMADIR (Bitfield-Mask: 0x01)                          */
#define MSPI0_DMACFG_DMAEN_Pos            (0UL)                     /*!< DMAEN (Bit 0)                                         */
#define MSPI0_DMACFG_DMAEN_Msk            (0x3UL)                   /*!< DMAEN (Bitfield-Mask: 0x03)                           */
/* ========================================================  DMASTAT  ======================================================== */
#define MSPI0_DMASTAT_SCRERR_Pos          (3UL)                     /*!< SCRERR (Bit 3)                                        */
#define MSPI0_DMASTAT_SCRERR_Msk          (0x8UL)                   /*!< SCRERR (Bitfield-Mask: 0x01)                          */
#define MSPI0_DMASTAT_DMAERR_Pos          (2UL)                     /*!< DMAERR (Bit 2)                                        */
#define MSPI0_DMASTAT_DMAERR_Msk          (0x4UL)                   /*!< DMAERR (Bitfield-Mask: 0x01)                          */
#define MSPI0_DMASTAT_DMACPL_Pos          (1UL)                     /*!< DMACPL (Bit 1)                                        */
#define MSPI0_DMASTAT_DMACPL_Msk          (0x2UL)                   /*!< DMACPL (Bitfield-Mask: 0x01)                          */
#define MSPI0_DMASTAT_DMATIP_Pos          (0UL)                     /*!< DMATIP (Bit 0)                                        */
#define MSPI0_DMASTAT_DMATIP_Msk          (0x1UL)                   /*!< DMATIP (Bitfield-Mask: 0x01)                          */
/* ======================================================  DMATARGADDR  ====================================================== */
#define MSPI0_DMATARGADDR_TARGADDR_Pos    (0UL)                     /*!< TARGADDR (Bit 0)                                      */
#define MSPI0_DMATARGADDR_TARGADDR_Msk    (0xffffffffUL)            /*!< TARGADDR (Bitfield-Mask: 0xffffffff)                  */
/* ======================================================  DMADEVADDR  ======================================================= */
#define MSPI0_DMADEVADDR_DEVADDR_Pos      (0UL)                     /*!< DEVADDR (Bit 0)                                       */
#define MSPI0_DMADEVADDR_DEVADDR_Msk      (0xffffffffUL)            /*!< DEVADDR (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  DMATOTCOUNT  ====================================================== */
#define MSPI0_DMATOTCOUNT_TOTCOUNT_Pos    (0UL)                     /*!< TOTCOUNT (Bit 0)                                      */
#define MSPI0_DMATOTCOUNT_TOTCOUNT_Msk    (0xffffffUL)              /*!< TOTCOUNT (Bitfield-Mask: 0xffffff)                    */
/* =======================================================  DMABCOUNT  ======================================================= */
#define MSPI0_DMABCOUNT_BCOUNT_Pos        (0UL)                     /*!< BCOUNT (Bit 0)                                        */
#define MSPI0_DMABCOUNT_BCOUNT_Msk        (0xffUL)                  /*!< BCOUNT (Bitfield-Mask: 0xff)                          */
/* =======================================================  DMATHRESH  ======================================================= */
#define MSPI0_DMATHRESH_DMARXTHRESH_Pos   (8UL)                     /*!< DMARXTHRESH (Bit 8)                                   */
#define MSPI0_DMATHRESH_DMARXTHRESH_Msk   (0x1f00UL)                /*!< DMARXTHRESH (Bitfield-Mask: 0x1f)                     */
#define MSPI0_DMATHRESH_DMATXTHRESH_Pos   (0UL)                     /*!< DMATXTHRESH (Bit 0)                                   */
#define MSPI0_DMATHRESH_DMATXTHRESH_Msk   (0x1fUL)                  /*!< DMATXTHRESH (Bitfield-Mask: 0x1f)                     */
/* =========================================================  INTEN  ========================================================= */
#define MSPI0_INTEN_SCRERR_Pos            (12UL)                    /*!< SCRERR (Bit 12)                                       */
#define MSPI0_INTEN_SCRERR_Msk            (0x1000UL)                /*!< SCRERR (Bitfield-Mask: 0x01)                          */
#define MSPI0_INTEN_CQERR_Pos             (11UL)                    /*!< CQERR (Bit 11)                                        */
#define MSPI0_INTEN_CQERR_Msk             (0x800UL)                 /*!< CQERR (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTEN_CQPAUSED_Pos          (10UL)                    /*!< CQPAUSED (Bit 10)                                     */
#define MSPI0_INTEN_CQPAUSED_Msk          (0x400UL)                 /*!< CQPAUSED (Bitfield-Mask: 0x01)                        */
#define MSPI0_INTEN_CQUPD_Pos             (9UL)                     /*!< CQUPD (Bit 9)                                         */
#define MSPI0_INTEN_CQUPD_Msk             (0x200UL)                 /*!< CQUPD (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTEN_CQCMP_Pos             (8UL)                     /*!< CQCMP (Bit 8)                                         */
#define MSPI0_INTEN_CQCMP_Msk             (0x100UL)                 /*!< CQCMP (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTEN_DERR_Pos              (7UL)                     /*!< DERR (Bit 7)                                          */
#define MSPI0_INTEN_DERR_Msk              (0x80UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define MSPI0_INTEN_DCMP_Pos              (6UL)                     /*!< DCMP (Bit 6)                                          */
#define MSPI0_INTEN_DCMP_Msk              (0x40UL)                  /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define MSPI0_INTEN_RXF_Pos               (5UL)                     /*!< RXF (Bit 5)                                           */
#define MSPI0_INTEN_RXF_Msk               (0x20UL)                  /*!< RXF (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTEN_RXO_Pos               (4UL)                     /*!< RXO (Bit 4)                                           */
#define MSPI0_INTEN_RXO_Msk               (0x10UL)                  /*!< RXO (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTEN_RXU_Pos               (3UL)                     /*!< RXU (Bit 3)                                           */
#define MSPI0_INTEN_RXU_Msk               (0x8UL)                   /*!< RXU (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTEN_TXO_Pos               (2UL)                     /*!< TXO (Bit 2)                                           */
#define MSPI0_INTEN_TXO_Msk               (0x4UL)                   /*!< TXO (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTEN_TXE_Pos               (1UL)                     /*!< TXE (Bit 1)                                           */
#define MSPI0_INTEN_TXE_Msk               (0x2UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTEN_CMDCMP_Pos            (0UL)                     /*!< CMDCMP (Bit 0)                                        */
#define MSPI0_INTEN_CMDCMP_Msk            (0x1UL)                   /*!< CMDCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSTAT  ======================================================== */
#define MSPI0_INTSTAT_SCRERR_Pos          (12UL)                    /*!< SCRERR (Bit 12)                                       */
#define MSPI0_INTSTAT_SCRERR_Msk          (0x1000UL)                /*!< SCRERR (Bitfield-Mask: 0x01)                          */
#define MSPI0_INTSTAT_CQERR_Pos           (11UL)                    /*!< CQERR (Bit 11)                                        */
#define MSPI0_INTSTAT_CQERR_Msk           (0x800UL)                 /*!< CQERR (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTSTAT_CQPAUSED_Pos        (10UL)                    /*!< CQPAUSED (Bit 10)                                     */
#define MSPI0_INTSTAT_CQPAUSED_Msk        (0x400UL)                 /*!< CQPAUSED (Bitfield-Mask: 0x01)                        */
#define MSPI0_INTSTAT_CQUPD_Pos           (9UL)                     /*!< CQUPD (Bit 9)                                         */
#define MSPI0_INTSTAT_CQUPD_Msk           (0x200UL)                 /*!< CQUPD (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTSTAT_CQCMP_Pos           (8UL)                     /*!< CQCMP (Bit 8)                                         */
#define MSPI0_INTSTAT_CQCMP_Msk           (0x100UL)                 /*!< CQCMP (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTSTAT_DERR_Pos            (7UL)                     /*!< DERR (Bit 7)                                          */
#define MSPI0_INTSTAT_DERR_Msk            (0x80UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define MSPI0_INTSTAT_DCMP_Pos            (6UL)                     /*!< DCMP (Bit 6)                                          */
#define MSPI0_INTSTAT_DCMP_Msk            (0x40UL)                  /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define MSPI0_INTSTAT_RXF_Pos             (5UL)                     /*!< RXF (Bit 5)                                           */
#define MSPI0_INTSTAT_RXF_Msk             (0x20UL)                  /*!< RXF (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTSTAT_RXO_Pos             (4UL)                     /*!< RXO (Bit 4)                                           */
#define MSPI0_INTSTAT_RXO_Msk             (0x10UL)                  /*!< RXO (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTSTAT_RXU_Pos             (3UL)                     /*!< RXU (Bit 3)                                           */
#define MSPI0_INTSTAT_RXU_Msk             (0x8UL)                   /*!< RXU (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTSTAT_TXO_Pos             (2UL)                     /*!< TXO (Bit 2)                                           */
#define MSPI0_INTSTAT_TXO_Msk             (0x4UL)                   /*!< TXO (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTSTAT_TXE_Pos             (1UL)                     /*!< TXE (Bit 1)                                           */
#define MSPI0_INTSTAT_TXE_Msk             (0x2UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTSTAT_CMDCMP_Pos          (0UL)                     /*!< CMDCMP (Bit 0)                                        */
#define MSPI0_INTSTAT_CMDCMP_Msk          (0x1UL)                   /*!< CMDCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTCLR  ========================================================= */
#define MSPI0_INTCLR_SCRERR_Pos           (12UL)                    /*!< SCRERR (Bit 12)                                       */
#define MSPI0_INTCLR_SCRERR_Msk           (0x1000UL)                /*!< SCRERR (Bitfield-Mask: 0x01)                          */
#define MSPI0_INTCLR_CQERR_Pos            (11UL)                    /*!< CQERR (Bit 11)                                        */
#define MSPI0_INTCLR_CQERR_Msk            (0x800UL)                 /*!< CQERR (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTCLR_CQPAUSED_Pos         (10UL)                    /*!< CQPAUSED (Bit 10)                                     */
#define MSPI0_INTCLR_CQPAUSED_Msk         (0x400UL)                 /*!< CQPAUSED (Bitfield-Mask: 0x01)                        */
#define MSPI0_INTCLR_CQUPD_Pos            (9UL)                     /*!< CQUPD (Bit 9)                                         */
#define MSPI0_INTCLR_CQUPD_Msk            (0x200UL)                 /*!< CQUPD (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTCLR_CQCMP_Pos            (8UL)                     /*!< CQCMP (Bit 8)                                         */
#define MSPI0_INTCLR_CQCMP_Msk            (0x100UL)                 /*!< CQCMP (Bitfield-Mask: 0x01)                           */
#define MSPI0_INTCLR_DERR_Pos             (7UL)                     /*!< DERR (Bit 7)                                          */
#define MSPI0_INTCLR_DERR_Msk             (0x80UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define MSPI0_INTCLR_DCMP_Pos             (6UL)                     /*!< DCMP (Bit 6)                                          */
#define MSPI0_INTCLR_DCMP_Msk             (0x40UL)                  /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define MSPI0_INTCLR_RXF_Pos              (5UL)                     /*!< RXF (Bit 5)                                           */
#define MSPI0_INTCLR_RXF_Msk              (0x20UL)                  /*!< RXF (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTCLR_RXO_Pos              (4UL)                     /*!< RXO (Bit 4)                                           */
#define MSPI0_INTCLR_RXO_Msk              (0x10UL)                  /*!< RXO (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTCLR_RXU_Pos              (3UL)                     /*!< RXU (Bit 3)                                           */
#define MSPI0_INTCLR_RXU_Msk              (0x8UL)                   /*!< RXU (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTCLR_TXO_Pos              (2UL)                     /*!< TXO (Bit 2)                                           */
#define MSPI0_INTCLR_TXO_Msk              (0x4UL)                   /*!< TXO (Bitfield-Mask: 0x01)                             */
#define MSPI0_INTCLR_TXE_Pos              (1UL)                     /*!< TXE (Bit 1)                                           */
