AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
#define PWRCTRL_PWRWEIGHTULP0_WTULPMCU_Pos (0UL)                    /*!< WTULPMCU (Bit 0)                                      */
#define PWRCTRL_PWRWEIGHTULP0_WTULPMCU_Msk (0xfUL)                  /*!< WTULPMCU (Bitfield-Mask: 0x0f)                        */
/* =====================================================  PWRWEIGHTULP1  ===================================================== */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM7_Pos (28UL)                  /*!< WTULPIOM7 (Bit 28)                                    */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM7_Msk (0xf0000000UL)          /*!< WTULPIOM7 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM6_Pos (24UL)                  /*!< WTULPIOM6 (Bit 24)                                    */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM6_Msk (0xf000000UL)           /*!< WTULPIOM6 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM5_Pos (20UL)                  /*!< WTULPIOM5 (Bit 20)                                    */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM5_Msk (0xf00000UL)            /*!< WTULPIOM5 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM4_Pos (16UL)                  /*!< WTULPIOM4 (Bit 16)                                    */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM4_Msk (0xf0000UL)             /*!< WTULPIOM4 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM3_Pos (12UL)                  /*!< WTULPIOM3 (Bit 12)                                    */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM3_Msk (0xf000UL)              /*!< WTULPIOM3 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM2_Pos (8UL)                   /*!< WTULPIOM2 (Bit 8)                                     */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM2_Msk (0xf00UL)               /*!< WTULPIOM2 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM1_Pos (4UL)                   /*!< WTULPIOM1 (Bit 4)                                     */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM1_Msk (0xf0UL)                /*!< WTULPIOM1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM0_Pos (0UL)                   /*!< WTULPIOM0 (Bit 0)                                     */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM0_Msk (0xfUL)                 /*!< WTULPIOM0 (Bitfield-Mask: 0x0f)                       */
/* =====================================================  PWRWEIGHTULP2  ===================================================== */
#define PWRCTRL_PWRWEIGHTULP2_WTULPUSB_Pos (28UL)                   /*!< WTULPUSB (Bit 28)                                     */
#define PWRCTRL_PWRWEIGHTULP2_WTULPUSB_Msk (0xf0000000UL)           /*!< WTULPUSB (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTULP2_WTULPSDIO_Pos (24UL)                  /*!< WTULPSDIO (Bit 24)                                    */
#define PWRCTRL_PWRWEIGHTULP2_WTULPSDIO_Msk (0xf000000UL)           /*!< WTULPSDIO (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP2_WTULPCRYPTO_Pos (20UL)                /*!< WTULPCRYPTO (Bit 20)                                  */
#define PWRCTRL_PWRWEIGHTULP2_WTULPCRYPTO_Msk (0xf00000UL)          /*!< WTULPCRYPTO (Bitfield-Mask: 0x0f)                     */
#define PWRCTRL_PWRWEIGHTULP2_WTULPDISP_Pos (16UL)                  /*!< WTULPDISP (Bit 16)                                    */
#define PWRCTRL_PWRWEIGHTULP2_WTULPDISP_Msk (0xf0000UL)             /*!< WTULPDISP (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP2_WTULPGFX_Pos (12UL)                   /*!< WTULPGFX (Bit 12)                                     */
#define PWRCTRL_PWRWEIGHTULP2_WTULPGFX_Msk (0xf000UL)               /*!< WTULPGFX (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTULP2_WTULPMSPI1_Pos (8UL)                  /*!< WTULPMSPI1 (Bit 8)                                    */
#define PWRCTRL_PWRWEIGHTULP2_WTULPMSPI1_Msk (0xf00UL)              /*!< WTULPMSPI1 (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTULP2_WTULPMSPI0_Pos (4UL)                  /*!< WTULPMSPI0 (Bit 4)                                    */
#define PWRCTRL_PWRWEIGHTULP2_WTULPMSPI0_Msk (0xf0UL)               /*!< WTULPMSPI0 (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTULP2_WTULPADC_Pos (0UL)                    /*!< WTULPADC (Bit 0)                                      */
#define PWRCTRL_PWRWEIGHTULP2_WTULPADC_Msk (0xfUL)                  /*!< WTULPADC (Bitfield-Mask: 0x0f)                        */
/* =====================================================  PWRWEIGHTULP3  ===================================================== */
#define PWRCTRL_PWRWEIGHTULP3_WTULPMSPI2_Pos (28UL)                 /*!< WTULPMSPI2 (Bit 28)                                   */
#define PWRCTRL_PWRWEIGHTULP3_WTULPMSPI2_Msk (0xf0000000UL)         /*!< WTULPMSPI2 (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTULP3_WTULPI3C1_Pos (24UL)                  /*!< WTULPI3C1 (Bit 24)                                    */
#define PWRCTRL_PWRWEIGHTULP3_WTULPI3C1_Msk (0xf000000UL)           /*!< WTULPI3C1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP3_WTULPI3C0_Pos (20UL)                  /*!< WTULPI3C0 (Bit 20)                                    */
#define PWRCTRL_PWRWEIGHTULP3_WTULPI3C0_Msk (0xf00000UL)            /*!< WTULPI3C0 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP3_WTULPAUDADC_Pos (16UL)                /*!< WTULPAUDADC (Bit 16)                                  */
#define PWRCTRL_PWRWEIGHTULP3_WTULPAUDADC_Msk (0xf0000UL)           /*!< WTULPAUDADC (Bitfield-Mask: 0x0f)                     */
#define PWRCTRL_PWRWEIGHTULP3_WTULPAUDPB_Pos (12UL)                 /*!< WTULPAUDPB (Bit 12)                                   */
#define PWRCTRL_PWRWEIGHTULP3_WTULPAUDPB_Msk (0xf000UL)             /*!< WTULPAUDPB (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTULP3_WTULPAUDREC_Pos (8UL)                 /*!< WTULPAUDREC (Bit 8)                                   */
#define PWRCTRL_PWRWEIGHTULP3_WTULPAUDREC_Msk (0xf00UL)             /*!< WTULPAUDREC (Bitfield-Mask: 0x0f)                     */
#define PWRCTRL_PWRWEIGHTULP3_WTULPDBG_Pos (4UL)                    /*!< WTULPDBG (Bit 4)                                      */
#define PWRCTRL_PWRWEIGHTULP3_WTULPDBG_Msk (0xf0UL)                 /*!< WTULPDBG (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTULP3_WTULPDSPA_Pos (0UL)                   /*!< WTULPDSPA (Bit 0)                                     */
#define PWRCTRL_PWRWEIGHTULP3_WTULPDSPA_Msk (0xfUL)                 /*!< WTULPDSPA (Bitfield-Mask: 0x0f)                       */
/* =====================================================  PWRWEIGHTULP4  ===================================================== */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM3_Pos (28UL)                  /*!< WTULPPDM3 (Bit 28)                                    */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM3_Msk (0xf0000000UL)          /*!< WTULPPDM3 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM2_Pos (24UL)                  /*!< WTULPPDM2 (Bit 24)                                    */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM2_Msk (0xf000000UL)           /*!< WTULPPDM2 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM1_Pos (20UL)                  /*!< WTULPPDM1 (Bit 20)                                    */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM1_Msk (0xf00000UL)            /*!< WTULPPDM1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM0_Pos (16UL)                  /*!< WTULPPDM0 (Bit 16)                                    */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM0_Msk (0xf0000UL)             /*!< WTULPPDM0 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP4_WTULPI2S3_Pos (12UL)                  /*!< WTULPI2S3 (Bit 12)                                    */
#define PWRCTRL_PWRWEIGHTULP4_WTULPI2S3_Msk (0xf000UL)              /*!< WTULPI2S3 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP4_WTULPI2S2_Pos (8UL)                   /*!< WTULPI2S2 (Bit 8)                                     */
#define PWRCTRL_PWRWEIGHTULP4_WTULPI2S2_Msk (0xf00UL)               /*!< WTULPI2S2 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP4_WTULPI2S1_Pos (4UL)                   /*!< WTULPI2S1 (Bit 4)                                     */
#define PWRCTRL_PWRWEIGHTULP4_WTULPI2S1_Msk (0xf0UL)                /*!< WTULPI2S1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP4_WTULPI2S0_Pos (0UL)                   /*!< WTULPI2S0 (Bit 0)                                     */
#define PWRCTRL_PWRWEIGHTULP4_WTULPI2S0_Msk (0xfUL)                 /*!< WTULPI2S0 (Bitfield-Mask: 0x0f)                       */
/* =====================================================  PWRWEIGHTULP5  ===================================================== */
#define PWRCTRL_PWRWEIGHTULP5_WTULPUSBPHY_Pos (4UL)                 /*!< WTULPUSBPHY (Bit 4)                                   */
#define PWRCTRL_PWRWEIGHTULP5_WTULPUSBPHY_Msk (0xf0UL)              /*!< WTULPUSBPHY (Bitfield-Mask: 0x0f)                     */
#define PWRCTRL_PWRWEIGHTULP5_WTULPDISPPHY_Pos (0UL)                /*!< WTULPDISPPHY (Bit 0)                                  */
#define PWRCTRL_PWRWEIGHTULP5_WTULPDISPPHY_Msk (0xfUL)              /*!< WTULPDISPPHY (Bitfield-Mask: 0x0f)                    */
/* =====================================================  PWRWEIGHTLP0  ====================================================== */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART3_Pos (28UL)                   /*!< WTLPUART3 (Bit 28)                                    */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART3_Msk (0xf0000000UL)           /*!< WTLPUART3 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART2_Pos (24UL)                   /*!< WTLPUART2 (Bit 24)                                    */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART2_Msk (0xf000000UL)            /*!< WTLPUART2 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART1_Pos (20UL)                   /*!< WTLPUART1 (Bit 20)                                    */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART1_Msk (0xf00000UL)             /*!< WTLPUART1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART0_Pos (16UL)                   /*!< WTLPUART0 (Bit 16)                                    */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART0_Msk (0xf0000UL)              /*!< WTLPUART0 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP0_WTLPIOS_Pos  (12UL)                    /*!< WTLPIOS (Bit 12)                                      */
#define PWRCTRL_PWRWEIGHTLP0_WTLPIOS_Msk  (0xf000UL)                /*!< WTLPIOS (Bitfield-Mask: 0x0f)                         */
#define PWRCTRL_PWRWEIGHTLP0_WTLPDSP1_Pos (8UL)                     /*!< WTLPDSP1 (Bit 8)                                      */
#define PWRCTRL_PWRWEIGHTLP0_WTLPDSP1_Msk (0xf00UL)                 /*!< WTLPDSP1 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP0_WTLPDSP0_Pos (4UL)                     /*!< WTLPDSP0 (Bit 4)                                      */
#define PWRCTRL_PWRWEIGHTLP0_WTLPDSP0_Msk (0xf0UL)                  /*!< WTLPDSP0 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP0_WTLPMCU_Pos  (0UL)                     /*!< WTLPMCU (Bit 0)                                       */
#define PWRCTRL_PWRWEIGHTLP0_WTLPMCU_Msk  (0xfUL)                   /*!< WTLPMCU (Bitfield-Mask: 0x0f)                         */
/* =====================================================  PWRWEIGHTLP1  ====================================================== */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM7_Pos (28UL)                    /*!< WTLPIOM7 (Bit 28)                                     */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM7_Msk (0xf0000000UL)            /*!< WTLPIOM7 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM6_Pos (24UL)                    /*!< WTLPIOM6 (Bit 24)                                     */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM6_Msk (0xf000000UL)             /*!< WTLPIOM6 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM5_Pos (20UL)                    /*!< WTLPIOM5 (Bit 20)                                     */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM5_Msk (0xf00000UL)              /*!< WTLPIOM5 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM4_Pos (16UL)                    /*!< WTLPIOM4 (Bit 16)                                     */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM4_Msk (0xf0000UL)               /*!< WTLPIOM4 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM3_Pos (12UL)                    /*!< WTLPIOM3 (Bit 12)                                     */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM3_Msk (0xf000UL)                /*!< WTLPIOM3 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM2_Pos (8UL)                     /*!< WTLPIOM2 (Bit 8)                                      */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM2_Msk (0xf00UL)                 /*!< WTLPIOM2 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM1_Pos (4UL)                     /*!< WTLPIOM1 (Bit 4)                                      */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM1_Msk (0xf0UL)                  /*!< WTLPIOM1 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM0_Pos (0UL)                     /*!< WTLPIOM0 (Bit 0)                                      */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM0_Msk (0xfUL)                   /*!< WTLPIOM0 (Bitfield-Mask: 0x0f)                        */
/* =====================================================  PWRWEIGHTLP2  ====================================================== */
#define PWRCTRL_PWRWEIGHTLP2_WTLPUSB_Pos  (28UL)                    /*!< WTLPUSB (Bit 28)                                      */
#define PWRCTRL_PWRWEIGHTLP2_WTLPUSB_Msk  (0xf0000000UL)            /*!< WTLPUSB (Bitfield-Mask: 0x0f)                         */
#define PWRCTRL_PWRWEIGHTLP2_WTLPSDIO_Pos (24UL)                    /*!< WTLPSDIO (Bit 24)                                     */
#define PWRCTRL_PWRWEIGHTLP2_WTLPSDIO_Msk (0xf000000UL)             /*!< WTLPSDIO (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP2_WTLPCRYPTO_Pos (20UL)                  /*!< WTLPCRYPTO (Bit 20)                                   */
#define PWRCTRL_PWRWEIGHTLP2_WTLPCRYPTO_Msk (0xf00000UL)            /*!< WTLPCRYPTO (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTLP2_WTLPDISP_Pos (16UL)                    /*!< WTLPDISP (Bit 16)                                     */
#define PWRCTRL_PWRWEIGHTLP2_WTLPDISP_Msk (0xf0000UL)               /*!< WTLPDISP (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP2_WTLPGFX_Pos  (12UL)                    /*!< WTLPGFX (Bit 12)                                      */
#define PWRCTRL_PWRWEIGHTLP2_WTLPGFX_Msk  (0xf000UL)                /*!< WTLPGFX (Bitfield-Mask: 0x0f)                         */
#define PWRCTRL_PWRWEIGHTLP2_WTLPMSPI1_Pos (8UL)                    /*!< WTLPMSPI1 (Bit 8)                                     */
#define PWRCTRL_PWRWEIGHTLP2_WTLPMSPI1_Msk (0xf00UL)                /*!< WTLPMSPI1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP2_WTLPMSPI0_Pos (4UL)                    /*!< WTLPMSPI0 (Bit 4)                                     */
#define PWRCTRL_PWRWEIGHTLP2_WTLPMSPI0_Msk (0xf0UL)                 /*!< WTLPMSPI0 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP2_WTLPADC_Pos  (0UL)                     /*!< WTLPADC (Bit 0)                                       */
#define PWRCTRL_PWRWEIGHTLP2_WTLPADC_Msk  (0xfUL)                   /*!< WTLPADC (Bitfield-Mask: 0x0f)                         */
/* =====================================================  PWRWEIGHTLP3  ====================================================== */
#define PWRCTRL_PWRWEIGHTLP3_WTLPMSPI2_Pos (28UL)                   /*!< WTLPMSPI2 (Bit 28)                                    */
#define PWRCTRL_PWRWEIGHTLP3_WTLPMSPI2_Msk (0xf0000000UL)           /*!< WTLPMSPI2 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP3_WTLPI3C1_Pos (24UL)                    /*!< WTLPI3C1 (Bit 24)                                     */
#define PWRCTRL_PWRWEIGHTLP3_WTLPI3C1_Msk (0xf000000UL)             /*!< WTLPI3C1 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP3_WTLPI3C0_Pos (20UL)                    /*!< WTLPI3C0 (Bit 20)                                     */
#define PWRCTRL_PWRWEIGHTLP3_WTLPI3C0_Msk (0xf00000UL)              /*!< WTLPI3C0 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP3_WTLPAUDADC_Pos (16UL)                  /*!< WTLPAUDADC (Bit 16)                                   */
#define PWRCTRL_PWRWEIGHTLP3_WTLPAUDADC_Msk (0xf0000UL)             /*!< WTLPAUDADC (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTLP3_WTLPAUDPB_Pos (12UL)                   /*!< WTLPAUDPB (Bit 12)                                    */
#define PWRCTRL_PWRWEIGHTLP3_WTLPAUDPB_Msk (0xf000UL)               /*!< WTLPAUDPB (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP3_WTLPAUDREC_Pos (8UL)                   /*!< WTLPAUDREC (Bit 8)                                    */
#define PWRCTRL_PWRWEIGHTLP3_WTLPAUDREC_Msk (0xf00UL)               /*!< WTLPAUDREC (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTLP3_WTLPDBG_Pos  (4UL)                     /*!< WTLPDBG (Bit 4)                                       */
#define PWRCTRL_PWRWEIGHTLP3_WTLPDBG_Msk  (0xf0UL)                  /*!< WTLPDBG (Bitfield-Mask: 0x0f)                         */
#define PWRCTRL_PWRWEIGHTLP3_WTLPDSPA_Pos (0UL)                     /*!< WTLPDSPA (Bit 0)                                      */
#define PWRCTRL_PWRWEIGHTLP3_WTLPDSPA_Msk (0xfUL)                   /*!< WTLPDSPA (Bitfield-Mask: 0x0f)                        */
/* =====================================================  PWRWEIGHTLP4  ====================================================== */
#define PWRCTRL_PWRWEIGHTLP4_WTLPPDM3_Pos (28UL)                    /*!< WTLPPDM3 (Bit 28)                                     */
#define PWRCTRL_PWRWEIGHTLP4_WTLPPDM3_Msk (0xf0000000UL)            /*!< WTLPPDM3 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP4_WTLPPDM2_Pos (24UL)                    /*!< WTLPPDM2 (Bit 24)                                     */
#define PWRCTRL_PWRWEIGHTLP4_WTLPPDM2_Msk (0xf000000UL)             /*!< WTLPPDM2 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP4_WTLPPDM1_Pos (20UL)                    /*!< WTLPPDM1 (Bit 20)                                     */
#define PWRCTRL_PWRWEIGHTLP4_WTLPPDM1_Msk (0xf00000UL)              /*!< WTLPPDM1 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP4_WTLPPDM0_Pos (16UL)                    /*!< WTLPPDM0 (Bit 16)                                     */
#define PWRCTRL_PWRWEIGHTLP4_WTLPPDM0_Msk (0xf0000UL)               /*!< WTLPPDM0 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP4_WTLPI2S3_Pos (12UL)                    /*!< WTLPI2S3 (Bit 12)                                     */
#define PWRCTRL_PWRWEIGHTLP4_WTLPI2S3_Msk (0xf000UL)                /*!< WTLPI2S3 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP4_WTLPI2S2_Pos (8UL)                     /*!< WTLPI2S2 (Bit 8)                                      */
#define PWRCTRL_PWRWEIGHTLP4_WTLPI2S2_Msk (0xf00UL)                 /*!< WTLPI2S2 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP4_WTLPI2S1_Pos (4UL)                     /*!< WTLPI2S1 (Bit 4)                                      */
#define PWRCTRL_PWRWEIGHTLP4_WTLPI2S1_Msk (0xf0UL)                  /*!< WTLPI2S1 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP4_WTLPI2S0_Pos (0UL)                     /*!< WTLPI2S0 (Bit 0)                                      */
#define PWRCTRL_PWRWEIGHTLP4_WTLPI2S0_Msk (0xfUL)                   /*!< WTLPI2S0 (Bitfield-Mask: 0x0f)                        */
/* =====================================================  PWRWEIGHTLP5  ====================================================== */
#define PWRCTRL_PWRWEIGHTLP5_WTLPUSBPHY_Pos (4UL)                   /*!< WTLPUSBPHY (Bit 4)                                    */
#define PWRCTRL_PWRWEIGHTLP5_WTLPUSBPHY_Msk (0xf0UL)                /*!< WTLPUSBPHY (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTLP5_WTLPDISPPHY_Pos (0UL)                  /*!< WTLPDISPPHY (Bit 0)                                   */
#define PWRCTRL_PWRWEIGHTLP5_WTLPDISPPHY_Msk (0xfUL)                /*!< WTLPDISPPHY (Bitfield-Mask: 0x0f)                     */
/* =====================================================  PWRWEIGHTHP0  ====================================================== */
#define PWRCTRL_PWRWEIGHTHP0_WTHPUART3_Pos (28UL)                   /*!< WTHPUART3 (Bit 28)                                    */
#define PWRCTRL_PWRWEIGHTHP0_WTHPUART3_Msk (0xf0000000UL)           /*!< WTHPUART3 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTHP0_WTHPUART2_Pos (24UL)                   /*!< WTHPUART2 (Bit 24)                                    */
#define PWRCTRL_PWRWEIGHTHP0_WTHPUART2_Msk (0xf000000UL)            /*!< WTHPUART2 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTHP0_WTHPUART1_Pos (20UL)                   /*!< WTHPUART1 (Bit 20)                                    */
#define PWRCTRL_PWRWEIGHTHP0_WTHPUART1_Msk (0xf00000UL)             /*!< WTHPUART1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTHP0_WTHPUART0_Pos (16UL)                   /*!< WTHPUART0 (Bit 16)                                    */
#define PWRCTRL_PWRWEIGHTHP0_WTHPUART0_Msk (0xf0000UL)              /*!< WTHPUART0 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTHP0_WTHPIOS_Pos  (12UL)                    /*!< WTHPIOS (Bit 12)                                      */
#define PWRCTRL_PWRWEIGHTHP0_WTHPIOS_Msk  (0xf000UL)                /*!< WTHPIOS (Bitfield-Mask: 0x0f)                         */
#define PWRCTRL_PWRWEIGHTHP0_WTHPDSP1_Pos (8UL)                     /*!< WTHPDSP1 (Bit 8)                                      */
#define PWRCTRL_PWRWEIGHTHP0_WTHPDSP1_Msk (0xf00UL)                 /*!< WTHPDSP1 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP0_WTHPDSP0_Pos (4UL)                     /*!< WTHPDSP0 (Bit 4)                                      */
#define PWRCTRL_PWRWEIGHTHP0_WTHPDSP0_Msk (0xf0UL)                  /*!< WTHPDSP0 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP0_WTHPMCU_Pos  (0UL)                     /*!< WTHPMCU (Bit 0)                                       */
#define PWRCTRL_PWRWEIGHTHP0_WTHPMCU_Msk  (0xfUL)                   /*!< WTHPMCU (Bitfield-Mask: 0x0f)                         */
/* =====================================================  PWRWEIGHTHP1  ====================================================== */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM7_Pos (28UL)                    /*!< WTHPIOM7 (Bit 28)                                     */
