AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM7_Msk (0xf0000000UL)            /*!< WTHPIOM7 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM6_Pos (24UL)                    /*!< WTHPIOM6 (Bit 24)                                     */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM6_Msk (0xf000000UL)             /*!< WTHPIOM6 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM5_Pos (20UL)                    /*!< WTHPIOM5 (Bit 20)                                     */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM5_Msk (0xf00000UL)              /*!< WTHPIOM5 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM4_Pos (16UL)                    /*!< WTHPIOM4 (Bit 16)                                     */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM4_Msk (0xf0000UL)               /*!< WTHPIOM4 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM3_Pos (12UL)                    /*!< WTHPIOM3 (Bit 12)                                     */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM3_Msk (0xf000UL)                /*!< WTHPIOM3 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM2_Pos (8UL)                     /*!< WTHPIOM2 (Bit 8)                                      */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM2_Msk (0xf00UL)                 /*!< WTHPIOM2 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM1_Pos (4UL)                     /*!< WTHPIOM1 (Bit 4)                                      */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM1_Msk (0xf0UL)                  /*!< WTHPIOM1 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM0_Pos (0UL)                     /*!< WTHPIOM0 (Bit 0)                                      */
#define PWRCTRL_PWRWEIGHTHP1_WTHPIOM0_Msk (0xfUL)                   /*!< WTHPIOM0 (Bitfield-Mask: 0x0f)                        */
/* =====================================================  PWRWEIGHTHP2  ====================================================== */
#define PWRCTRL_PWRWEIGHTHP2_WTHPUSB_Pos  (28UL)                    /*!< WTHPUSB (Bit 28)                                      */
#define PWRCTRL_PWRWEIGHTHP2_WTHPUSB_Msk  (0xf0000000UL)            /*!< WTHPUSB (Bitfield-Mask: 0x0f)                         */
#define PWRCTRL_PWRWEIGHTHP2_WTHPSDIO_Pos (24UL)                    /*!< WTHPSDIO (Bit 24)                                     */
#define PWRCTRL_PWRWEIGHTHP2_WTHPSDIO_Msk (0xf000000UL)             /*!< WTHPSDIO (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP2_WTHPCRYPTO_Pos (20UL)                  /*!< WTHPCRYPTO (Bit 20)                                   */
#define PWRCTRL_PWRWEIGHTHP2_WTHPCRYPTO_Msk (0xf00000UL)            /*!< WTHPCRYPTO (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTHP2_WTHPDISP_Pos (16UL)                    /*!< WTHPDISP (Bit 16)                                     */
#define PWRCTRL_PWRWEIGHTHP2_WTHPDISP_Msk (0xf0000UL)               /*!< WTHPDISP (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP2_WTHPGFX_Pos  (12UL)                    /*!< WTHPGFX (Bit 12)                                      */
#define PWRCTRL_PWRWEIGHTHP2_WTHPGFX_Msk  (0xf000UL)                /*!< WTHPGFX (Bitfield-Mask: 0x0f)                         */
#define PWRCTRL_PWRWEIGHTHP2_WTHPMSPI1_Pos (8UL)                    /*!< WTHPMSPI1 (Bit 8)                                     */
#define PWRCTRL_PWRWEIGHTHP2_WTHPMSPI1_Msk (0xf00UL)                /*!< WTHPMSPI1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTHP2_WTHPMSPI0_Pos (4UL)                    /*!< WTHPMSPI0 (Bit 4)                                     */
#define PWRCTRL_PWRWEIGHTHP2_WTHPMSPI0_Msk (0xf0UL)                 /*!< WTHPMSPI0 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTHP2_WTHPADC_Pos  (0UL)                     /*!< WTHPADC (Bit 0)                                       */
#define PWRCTRL_PWRWEIGHTHP2_WTHPADC_Msk  (0xfUL)                   /*!< WTHPADC (Bitfield-Mask: 0x0f)                         */
/* =====================================================  PWRWEIGHTHP3  ====================================================== */
#define PWRCTRL_PWRWEIGHTHP3_WTHPMSPI2_Pos (28UL)                   /*!< WTHPMSPI2 (Bit 28)                                    */
#define PWRCTRL_PWRWEIGHTHP3_WTHPMSPI2_Msk (0xf0000000UL)           /*!< WTHPMSPI2 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTHP3_WTHPI3C1_Pos (24UL)                    /*!< WTHPI3C1 (Bit 24)                                     */
#define PWRCTRL_PWRWEIGHTHP3_WTHPI3C1_Msk (0xf000000UL)             /*!< WTHPI3C1 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP3_WTHPI3C0_Pos (20UL)                    /*!< WTHPI3C0 (Bit 20)                                     */
#define PWRCTRL_PWRWEIGHTHP3_WTHPI3C0_Msk (0xf00000UL)              /*!< WTHPI3C0 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP3_WTHPAUDADC_Pos (16UL)                  /*!< WTHPAUDADC (Bit 16)                                   */
#define PWRCTRL_PWRWEIGHTHP3_WTHPAUDADC_Msk (0xf0000UL)             /*!< WTHPAUDADC (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTHP3_WTHPAUDPB_Pos (12UL)                   /*!< WTHPAUDPB (Bit 12)                                    */
#define PWRCTRL_PWRWEIGHTHP3_WTHPAUDPB_Msk (0xf000UL)               /*!< WTHPAUDPB (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTHP3_WTHPAUDREC_Pos (8UL)                   /*!< WTHPAUDREC (Bit 8)                                    */
#define PWRCTRL_PWRWEIGHTHP3_WTHPAUDREC_Msk (0xf00UL)               /*!< WTHPAUDREC (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTHP3_WTHPDBG_Pos  (4UL)                     /*!< WTHPDBG (Bit 4)                                       */
#define PWRCTRL_PWRWEIGHTHP3_WTHPDBG_Msk  (0xf0UL)                  /*!< WTHPDBG (Bitfield-Mask: 0x0f)                         */
#define PWRCTRL_PWRWEIGHTHP3_WTHPDSPA_Pos (0UL)                     /*!< WTHPDSPA (Bit 0)                                      */
#define PWRCTRL_PWRWEIGHTHP3_WTHPDSPA_Msk (0xfUL)                   /*!< WTHPDSPA (Bitfield-Mask: 0x0f)                        */
/* =====================================================  PWRWEIGHTHP4  ====================================================== */
#define PWRCTRL_PWRWEIGHTHP4_WTHPPDM3_Pos (28UL)                    /*!< WTHPPDM3 (Bit 28)                                     */
#define PWRCTRL_PWRWEIGHTHP4_WTHPPDM3_Msk (0xf0000000UL)            /*!< WTHPPDM3 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP4_WTHPPDM2_Pos (24UL)                    /*!< WTHPPDM2 (Bit 24)                                     */
#define PWRCTRL_PWRWEIGHTHP4_WTHPPDM2_Msk (0xf000000UL)             /*!< WTHPPDM2 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP4_WTHPPDM1_Pos (20UL)                    /*!< WTHPPDM1 (Bit 20)                                     */
#define PWRCTRL_PWRWEIGHTHP4_WTHPPDM1_Msk (0xf00000UL)              /*!< WTHPPDM1 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP4_WTHPPDM0_Pos (16UL)                    /*!< WTHPPDM0 (Bit 16)                                     */
#define PWRCTRL_PWRWEIGHTHP4_WTHPPDM0_Msk (0xf0000UL)               /*!< WTHPPDM0 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP4_WTHPI2S3_Pos (12UL)                    /*!< WTHPI2S3 (Bit 12)                                     */
#define PWRCTRL_PWRWEIGHTHP4_WTHPI2S3_Msk (0xf000UL)                /*!< WTHPI2S3 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP4_WTHPI2S2_Pos (8UL)                     /*!< WTHPI2S2 (Bit 8)                                      */
#define PWRCTRL_PWRWEIGHTHP4_WTHPI2S2_Msk (0xf00UL)                 /*!< WTHPI2S2 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP4_WTHPI2S1_Pos (4UL)                     /*!< WTHPI2S1 (Bit 4)                                      */
#define PWRCTRL_PWRWEIGHTHP4_WTHPI2S1_Msk (0xf0UL)                  /*!< WTHPI2S1 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTHP4_WTHPI2S0_Pos (0UL)                     /*!< WTHPI2S0 (Bit 0)                                      */
#define PWRCTRL_PWRWEIGHTHP4_WTHPI2S0_Msk (0xfUL)                   /*!< WTHPI2S0 (Bitfield-Mask: 0x0f)                        */
/* =====================================================  PWRWEIGHTHP5  ====================================================== */
#define PWRCTRL_PWRWEIGHTHP5_WTHPUSBPHY_Pos (4UL)                   /*!< WTHPUSBPHY (Bit 4)                                    */
#define PWRCTRL_PWRWEIGHTHP5_WTHPUSBPHY_Msk (0xf0UL)                /*!< WTHPUSBPHY (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTHP5_WTHPDISPPHY_Pos (0UL)                  /*!< WTHPDISPPHY (Bit 0)                                   */
#define PWRCTRL_PWRWEIGHTHP5_WTHPDISPPHY_Msk (0xfUL)                /*!< WTHPDISPPHY (Bitfield-Mask: 0x0f)                     */
/* =====================================================  PWRWEIGHTSLP  ====================================================== */
#define PWRCTRL_PWRWEIGHTSLP_WTDSMCU_Pos  (0UL)                     /*!< WTDSMCU (Bit 0)                                       */
#define PWRCTRL_PWRWEIGHTSLP_WTDSMCU_Msk  (0xfUL)                   /*!< WTDSMCU (Bitfield-Mask: 0x0f)                         */
/* =====================================================  VRDEMOTIONTHR  ===================================================== */
#define PWRCTRL_VRDEMOTIONTHR_VRDEMOTIONTHR_Pos (0UL)               /*!< VRDEMOTIONTHR (Bit 0)                                 */
#define PWRCTRL_VRDEMOTIONTHR_VRDEMOTIONTHR_Msk (0xffffffffUL)      /*!< VRDEMOTIONTHR (Bitfield-Mask: 0xffffffff)             */
/* =======================================================  SRAMCTRL  ======================================================== */
#define PWRCTRL_SRAMCTRL_SRAMLIGHTSLEEP_Pos (8UL)                   /*!< SRAMLIGHTSLEEP (Bit 8)                                */
#define PWRCTRL_SRAMCTRL_SRAMLIGHTSLEEP_Msk (0xfff00UL)             /*!< SRAMLIGHTSLEEP (Bitfield-Mask: 0xfff)                 */
#define PWRCTRL_SRAMCTRL_SRAMMASTERCLKGATE_Pos (2UL)                /*!< SRAMMASTERCLKGATE (Bit 2)                             */
#define PWRCTRL_SRAMCTRL_SRAMMASTERCLKGATE_Msk (0x4UL)              /*!< SRAMMASTERCLKGATE (Bitfield-Mask: 0x01)               */
#define PWRCTRL_SRAMCTRL_SRAMCLKGATE_Pos  (1UL)                     /*!< SRAMCLKGATE (Bit 1)                                   */
#define PWRCTRL_SRAMCTRL_SRAMCLKGATE_Msk  (0x2UL)                   /*!< SRAMCLKGATE (Bitfield-Mask: 0x01)                     */
/* =======================================================  ADCSTATUS  ======================================================= */
#define PWRCTRL_ADCSTATUS_REFBUFPWD_Pos   (5UL)                     /*!< REFBUFPWD (Bit 5)                                     */
#define PWRCTRL_ADCSTATUS_REFBUFPWD_Msk   (0x20UL)                  /*!< REFBUFPWD (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_ADCSTATUS_REFKEEPPWD_Pos  (4UL)                     /*!< REFKEEPPWD (Bit 4)                                    */
#define PWRCTRL_ADCSTATUS_REFKEEPPWD_Msk  (0x10UL)                  /*!< REFKEEPPWD (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_ADCSTATUS_VBATPWD_Pos     (3UL)                     /*!< VBATPWD (Bit 3)                                       */
#define PWRCTRL_ADCSTATUS_VBATPWD_Msk     (0x8UL)                   /*!< VBATPWD (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_ADCSTATUS_VPTATPWD_Pos    (2UL)                     /*!< VPTATPWD (Bit 2)                                      */
#define PWRCTRL_ADCSTATUS_VPTATPWD_Msk    (0x4UL)                   /*!< VPTATPWD (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_ADCSTATUS_BGTPWD_Pos      (1UL)                     /*!< BGTPWD (Bit 1)                                        */
#define PWRCTRL_ADCSTATUS_BGTPWD_Msk      (0x2UL)                   /*!< BGTPWD (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_ADCSTATUS_ADCPWD_Pos      (0UL)                     /*!< ADCPWD (Bit 0)                                        */
#define PWRCTRL_ADCSTATUS_ADCPWD_Msk      (0x1UL)                   /*!< ADCPWD (Bitfield-Mask: 0x01)                          */
/* =====================================================  AUDADCSTATUS  ====================================================== */
#define PWRCTRL_AUDADCSTATUS_AUDREFBUFPWD_Pos (5UL)                 /*!< AUDREFBUFPWD (Bit 5)                                  */
#define PWRCTRL_AUDADCSTATUS_AUDREFBUFPWD_Msk (0x20UL)              /*!< AUDREFBUFPWD (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_AUDADCSTATUS_AUDREFKEEPPWD_Pos (4UL)                /*!< AUDREFKEEPPWD (Bit 4)                                 */
#define PWRCTRL_AUDADCSTATUS_AUDREFKEEPPWD_Msk (0x10UL)             /*!< AUDREFKEEPPWD (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_AUDADCSTATUS_AUDVBATPWD_Pos (3UL)                   /*!< AUDVBATPWD (Bit 3)                                    */
#define PWRCTRL_AUDADCSTATUS_AUDVBATPWD_Msk (0x8UL)                 /*!< AUDVBATPWD (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_AUDADCSTATUS_AUDVPTATPWD_Pos (2UL)                  /*!< AUDVPTATPWD (Bit 2)                                   */
#define PWRCTRL_AUDADCSTATUS_AUDVPTATPWD_Msk (0x4UL)                /*!< AUDVPTATPWD (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_AUDADCSTATUS_AUDBGTPWD_Pos (1UL)                    /*!< AUDBGTPWD (Bit 1)                                     */
#define PWRCTRL_AUDADCSTATUS_AUDBGTPWD_Msk (0x2UL)                  /*!< AUDBGTPWD (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_AUDADCSTATUS_AUDADCPWD_Pos (0UL)                    /*!< AUDADCPWD (Bit 0)                                     */
#define PWRCTRL_AUDADCSTATUS_AUDADCPWD_Msk (0x1UL)                  /*!< AUDADCPWD (Bitfield-Mask: 0x01)                       */
/* =======================================================  EMONCTRL  ======================================================== */
#define PWRCTRL_EMONCTRL_CLEAR_Pos        (8UL)                     /*!< CLEAR (Bit 8)                                         */
#define PWRCTRL_EMONCTRL_CLEAR_Msk        (0xff00UL)                /*!< CLEAR (Bitfield-Mask: 0xff)                           */
#define PWRCTRL_EMONCTRL_FREEZE_Pos       (0UL)                     /*!< FREEZE (Bit 0)                                        */
#define PWRCTRL_EMONCTRL_FREEZE_Msk       (0xffUL)                  /*!< FREEZE (Bitfield-Mask: 0xff)                          */
/* =======================================================  EMONCFG0  ======================================================== */
#define PWRCTRL_EMONCFG0_EMONSEL0_Pos     (0UL)                     /*!< EMONSEL0 (Bit 0)                                      */
#define PWRCTRL_EMONCFG0_EMONSEL0_Msk     (0xffUL)                  /*!< EMONSEL0 (Bitfield-Mask: 0xff)                        */
/* =======================================================  EMONCFG1  ======================================================== */
#define PWRCTRL_EMONCFG1_EMONSEL1_Pos     (0UL)                     /*!< EMONSEL1 (Bit 0)                                      */
#define PWRCTRL_EMONCFG1_EMONSEL1_Msk     (0xffUL)                  /*!< EMONSEL1 (Bitfield-Mask: 0xff)                        */
/* =======================================================  EMONCFG2  ======================================================== */
#define PWRCTRL_EMONCFG2_EMONSEL2_Pos     (0UL)                     /*!< EMONSEL2 (Bit 0)                                      */
#define PWRCTRL_EMONCFG2_EMONSEL2_Msk     (0xffUL)                  /*!< EMONSEL2 (Bitfield-Mask: 0xff)                        */
/* =======================================================  EMONCFG3  ======================================================== */
#define PWRCTRL_EMONCFG3_EMONSEL3_Pos     (0UL)                     /*!< EMONSEL3 (Bit 0)                                      */
#define PWRCTRL_EMONCFG3_EMONSEL3_Msk     (0xffUL)                  /*!< EMONSEL3 (Bitfield-Mask: 0xff)                        */
/* =======================================================  EMONCFG4  ======================================================== */
#define PWRCTRL_EMONCFG4_EMONSEL4_Pos     (0UL)                     /*!< EMONSEL4 (Bit 0)                                      */
#define PWRCTRL_EMONCFG4_EMONSEL4_Msk     (0xffUL)                  /*!< EMONSEL4 (Bitfield-Mask: 0xff)                        */
/* =======================================================  EMONCFG5  ======================================================== */
#define PWRCTRL_EMONCFG5_EMONSEL5_Pos     (0UL)                     /*!< EMONSEL5 (Bit 0)                                      */
#define PWRCTRL_EMONCFG5_EMONSEL5_Msk     (0xffUL)                  /*!< EMONSEL5 (Bitfield-Mask: 0xff)                        */
/* =======================================================  EMONCFG6  ======================================================== */
#define PWRCTRL_EMONCFG6_EMONSEL6_Pos     (0UL)                     /*!< EMONSEL6 (Bit 0)                                      */
#define PWRCTRL_EMONCFG6_EMONSEL6_Msk     (0xffUL)                  /*!< EMONSEL6 (Bitfield-Mask: 0xff)                        */
/* =======================================================  EMONCFG7  ======================================================== */
#define PWRCTRL_EMONCFG7_EMONSEL7_Pos     (0UL)                     /*!< EMONSEL7 (Bit 0)                                      */
#define PWRCTRL_EMONCFG7_EMONSEL7_Msk     (0xffUL)                  /*!< EMONSEL7 (Bitfield-Mask: 0xff)                        */
/* ======================================================  EMONCOUNT0  ======================================================= */
#define PWRCTRL_EMONCOUNT0_EMONCOUNT0_Pos (0UL)                     /*!< EMONCOUNT0 (Bit 0)                                    */
#define PWRCTRL_EMONCOUNT0_EMONCOUNT0_Msk (0xffffffffUL)            /*!< EMONCOUNT0 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  EMONCOUNT1  ======================================================= */
#define PWRCTRL_EMONCOUNT1_EMONCOUNT1_Pos (0UL)                     /*!< EMONCOUNT1 (Bit 0)                                    */
#define PWRCTRL_EMONCOUNT1_EMONCOUNT1_Msk (0xffffffffUL)            /*!< EMONCOUNT1 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  EMONCOUNT2  ======================================================= */
#define PWRCTRL_EMONCOUNT2_EMONCOUNT2_Pos (0UL)                     /*!< EMONCOUNT2 (Bit 0)                                    */
#define PWRCTRL_EMONCOUNT2_EMONCOUNT2_Msk (0xffffffffUL)            /*!< EMONCOUNT2 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  EMONCOUNT3  ======================================================= */
#define PWRCTRL_EMONCOUNT3_EMONCOUNT3_Pos (0UL)                     /*!< EMONCOUNT3 (Bit 0)                                    */
#define PWRCTRL_EMONCOUNT3_EMONCOUNT3_Msk (0xffffffffUL)            /*!< EMONCOUNT3 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  EMONCOUNT4  ======================================================= */
#define PWRCTRL_EMONCOUNT4_EMONCOUNT4_Pos (0UL)                     /*!< EMONCOUNT4 (Bit 0)                                    */
#define PWRCTRL_EMONCOUNT4_EMONCOUNT4_Msk (0xffffffffUL)            /*!< EMONCOUNT4 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  EMONCOUNT5  ======================================================= */
#define PWRCTRL_EMONCOUNT5_EMONCOUNT5_Pos (0UL)                     /*!< EMONCOUNT5 (Bit 0)                                    */
#define PWRCTRL_EMONCOUNT5_EMONCOUNT5_Msk (0xffffffffUL)            /*!< EMONCOUNT5 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  EMONCOUNT6  ======================================================= */
#define PWRCTRL_EMONCOUNT6_EMONCOUNT6_Pos (0UL)                     /*!< EMONCOUNT6 (Bit 0)                                    */
#define PWRCTRL_EMONCOUNT6_EMONCOUNT6_Msk (0xffffffffUL)            /*!< EMONCOUNT6 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  EMONCOUNT7  ======================================================= */
#define PWRCTRL_EMONCOUNT7_EMONCOUNT7_Pos (0UL)                     /*!< EMONCOUNT7 (Bit 0)                                    */
#define PWRCTRL_EMONCOUNT7_EMONCOUNT7_Msk (0xffffffffUL)            /*!< EMONCOUNT7 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  EMONSTATUS  ======================================================= */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW7_Pos (7UL)                  /*!< EMONOVERFLOW7 (Bit 7)                                 */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW7_Msk (0x80UL)               /*!< EMONOVERFLOW7 (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW6_Pos (6UL)                  /*!< EMONOVERFLOW6 (Bit 6)                                 */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW6_Msk (0x40UL)               /*!< EMONOVERFLOW6 (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW5_Pos (5UL)                  /*!< EMONOVERFLOW5 (Bit 5)                                 */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW5_Msk (0x20UL)               /*!< EMONOVERFLOW5 (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW4_Pos (4UL)                  /*!< EMONOVERFLOW4 (Bit 4)                                 */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW4_Msk (0x10UL)               /*!< EMONOVERFLOW4 (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW3_Pos (3UL)                  /*!< EMONOVERFLOW3 (Bit 3)                                 */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW3_Msk (0x8UL)                /*!< EMONOVERFLOW3 (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW2_Pos (2UL)                  /*!< EMONOVERFLOW2 (Bit 2)                                 */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW2_Msk (0x4UL)                /*!< EMONOVERFLOW2 (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW1_Pos (1UL)                  /*!< EMONOVERFLOW1 (Bit 1)                                 */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW1_Msk (0x2UL)                /*!< EMONOVERFLOW1 (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW0_Pos (0UL)                  /*!< EMONOVERFLOW0 (Bit 0)                                 */
#define PWRCTRL_EMONSTATUS_EMONOVERFLOW0_Msk (0x1UL)                /*!< EMONOVERFLOW0 (Bitfield-Mask: 0x01)                   */


/* =========================================================================================================================== */
/* ================                                          RSTGEN                                           ================ */
/* =========================================================================================================================== */

