AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* ==============================================  AUDADC CFG TRIGPOL [19..19]  ============================================== */
typedef enum {                                  /*!< AUDADC_CFG_TRIGPOL                                                        */
  AUDADC_CFG_TRIGPOL_RISING_EDGE       = 0,     /*!< RISING_EDGE : Trigger on rising edge.                                     */
  AUDADC_CFG_TRIGPOL_FALLING_EDGE      = 1,     /*!< FALLING_EDGE : Trigger on falling edge.                                   */
} AUDADC_CFG_TRIGPOL_Enum;

/* ==============================================  AUDADC CFG TRIGSEL [16..18]  ============================================== */
typedef enum {                                  /*!< AUDADC_CFG_TRIGSEL                                                        */
  AUDADC_CFG_TRIGSEL_EXT0              = 0,     /*!< EXT0 : Off chip External Trigger0 (ADC_ET0)                               */
  AUDADC_CFG_TRIGSEL_EXT1              = 1,     /*!< EXT1 : Off chip External Trigger1 (ADC_ET1)                               */
  AUDADC_CFG_TRIGSEL_EXT2              = 2,     /*!< EXT2 : Off chip External Trigger2 (ADC_ET2)                               */
  AUDADC_CFG_TRIGSEL_EXT3              = 3,     /*!< EXT3 : Off chip External Trigger3 (ADC_ET3)                               */
  AUDADC_CFG_TRIGSEL_VCOMP             = 4,     /*!< VCOMP : Voltage Comparator Output                                         */
  AUDADC_CFG_TRIGSEL_SWT               = 7,     /*!< SWT : Software Trigger                                                    */
} AUDADC_CFG_TRIGSEL_Enum;

/* ==============================================  AUDADC CFG DATAFMT [13..13]  ============================================== */
typedef enum {                                  /*!< AUDADC_CFG_DATAFMT                                                        */
  AUDADC_CFG_DATAFMT_UINT              = 0,     /*!< UINT : Unsigned binary format                                             */
  AUDADC_CFG_DATAFMT_SIGNED            = 1,     /*!< SIGNED : Two's complement signed format                                   */
} AUDADC_CFG_DATAFMT_Enum;

/* =============================================  AUDADC CFG DFIFORDEN [12..12]  ============================================= */
typedef enum {                                  /*!< AUDADC_CFG_DFIFORDEN                                                      */
  AUDADC_CFG_DFIFORDEN_DIS             = 0,     /*!< DIS : Destructive Reads are prevented. Reads to the FIFOPR register
                                                     will not POP an entry off the FIFO.                                       */
  AUDADC_CFG_DFIFORDEN_EN              = 1,     /*!< EN : Reads to the FIFOPR registger will automatically pop an
                                                     entry off the FIFO.                                                       */
} AUDADC_CFG_DFIFORDEN_Enum;

/* ===============================================  AUDADC CFG CKMODE [4..4]  ================================================ */
typedef enum {                                  /*!< AUDADC_CFG_CKMODE                                                         */
  AUDADC_CFG_CKMODE_LPCKMODE           = 0,     /*!< LPCKMODE : Disable the clock between scans for LPMODE0. Set
                                                     LPCKMODE to 0x1 while configuring the ADC.                                */
  AUDADC_CFG_CKMODE_LLCKMODE           = 1,     /*!< LLCKMODE : Low Latency Clock Mode. When set, HFRC and the adc_clk
                                                     will remain on while in functioning in LPMODE0.                           */
} AUDADC_CFG_CKMODE_Enum;

/* ===============================================  AUDADC CFG LPMODE [3..3]  ================================================ */
typedef enum {                                  /*!< AUDADC_CFG_LPMODE                                                         */
  AUDADC_CFG_LPMODE_MODE0              = 0,     /*!< MODE0 : Low Power Mode 0. Leaves the ADC fully powered between
                                                     scans with minimum latency between a trigger event and
                                                     sample data collection.                                                   */
  AUDADC_CFG_LPMODE_MODE1              = 1,     /*!< MODE1 : Low Power Mode 1. Powers down all circuity and clocks
                                                     associated with the ADC until the next trigger event. Between
                                                     scans, the reference buffer requires up to 50us of delay
                                                     from a scan trigger event before the conversion will commence
                                                     while operating in this mode.                                             */
} AUDADC_CFG_LPMODE_Enum;

/* ================================================  AUDADC CFG RPTEN [2..2]  ================================================ */
typedef enum {                                  /*!< AUDADC_CFG_RPTEN                                                          */
  AUDADC_CFG_RPTEN_SINGLE_SCAN         = 0,     /*!< SINGLE_SCAN : In Single Scan Mode, the ADC will complete a single
                                                     scan upon each trigger event.                                             */
  AUDADC_CFG_RPTEN_REPEATING_SCAN      = 1,     /*!< REPEATING_SCAN : In Repeating Scan Mode, the ADC will complete
                                                     it's first scan upon the initial trigger event and all
                                                     subsequent scans will occur at regular intervals defined
                                                     by the configuration programmed for the CTTMRA3 timer or
                                                     the ADC-internal timer (see the RPTTRIGSEL field) until
                                                     the timer is disabled or the ADC is disabled. When disabling
                                                     the ADC (setting ADCEN to '0'), the RPTEN bit should be
                                                     cleared.                                                                  */
} AUDADC_CFG_RPTEN_Enum;

/* ================================================  AUDADC CFG ADCEN [0..0]  ================================================ */
typedef enum {                                  /*!< AUDADC_CFG_ADCEN                                                          */
  AUDADC_CFG_ADCEN_DIS                 = 0,     /*!< DIS : Disable the ADC module.                                             */
  AUDADC_CFG_ADCEN_EN                  = 1,     /*!< EN : Enable the ADC module.                                               */
} AUDADC_CFG_ADCEN_Enum;

/* =========================================================  STAT  ========================================================== */
/* ==============================================  AUDADC STAT PWDSTAT [0..0]  =============================================== */
typedef enum {                                  /*!< AUDADC_STAT_PWDSTAT                                                       */
  AUDADC_STAT_PWDSTAT_ON               = 0,     /*!< ON : Powered on.                                                          */
  AUDADC_STAT_PWDSTAT_POWERED_DOWN     = 1,     /*!< POWERED_DOWN : ADC Low Power Mode 1.                                      */
} AUDADC_STAT_PWDSTAT_Enum;

/* ==========================================================  SWT  ========================================================== */
/* =================================================  AUDADC SWT SWT [0..7]  ================================================= */
typedef enum {                                  /*!< AUDADC_SWT_SWT                                                            */
  AUDADC_SWT_SWT_GEN_SW_TRIGGER        = 55,    /*!< GEN_SW_TRIGGER : Writing this value generates a software trigger.         */
} AUDADC_SWT_SWT_Enum;

