AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* ========================================================  SL0CFG  ========================================================= */
/* =============================================  AUDADC SL0CFG ADSEL0 [24..26]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL0CFG_ADSEL0                                                      */
  AUDADC_SL0CFG_ADSEL0_AVG_1_MSRMT     = 0,     /*!< AVG_1_MSRMT : Average in 1 measurement in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL0CFG_ADSEL0_AVG_2_MSRMTS    = 1,     /*!< AVG_2_MSRMTS : Average in 2 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL0CFG_ADSEL0_AVG_4_MSRMTS    = 2,     /*!< AVG_4_MSRMTS : Average in 4 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL0CFG_ADSEL0_AVG_8_MSRMT     = 3,     /*!< AVG_8_MSRMT : Average in 8 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL0CFG_ADSEL0_AVG_16_MSRMTS   = 4,     /*!< AVG_16_MSRMTS : Average in 16 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL0CFG_ADSEL0_AVG_32_MSRMTS   = 5,     /*!< AVG_32_MSRMTS : Average in 32 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL0CFG_ADSEL0_AVG_64_MSRMTS   = 6,     /*!< AVG_64_MSRMTS : Average in 64 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL0CFG_ADSEL0_AVG_128_MSRMTS  = 7,     /*!< AVG_128_MSRMTS : Average in 128 measurements in the accumulate
                                                     divide module for this slot.                                              */
} AUDADC_SL0CFG_ADSEL0_Enum;

/* ============================================  AUDADC SL0CFG PRMODE0 [16..17]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL0CFG_PRMODE0                                                     */
  AUDADC_SL0CFG_PRMODE0_P12B0          = 0,     /*!< P12B0 : 12-bit precision mode                                             */
  AUDADC_SL0CFG_PRMODE0_P12B1          = 1,     /*!< P12B1 : 12-bit precision mode                                             */
  AUDADC_SL0CFG_PRMODE0_P10B           = 2,     /*!< P10B : 10-bit precision mode                                              */
  AUDADC_SL0CFG_PRMODE0_P8B            = 3,     /*!< P8B : 8-bit precision mode                                                */
} AUDADC_SL0CFG_PRMODE0_Enum;

/* =============================================  AUDADC SL0CFG CHSEL0 [8..11]  ============================================== */
typedef enum {                                  /*!< AUDADC_SL0CFG_CHSEL0                                                      */
  AUDADC_SL0CFG_CHSEL0_SE0             = 0,     /*!< SE0 : PGA channel A0 output                                               */
  AUDADC_SL0CFG_CHSEL0_SE1             = 1,     /*!< SE1 : PGA channel A1 output                                               */
  AUDADC_SL0CFG_CHSEL0_SE2             = 2,     /*!< SE2 : PGA channel B0 output                                               */
  AUDADC_SL0CFG_CHSEL0_SE3             = 3,     /*!< SE3 : PGA channel B1 output                                               */
} AUDADC_SL0CFG_CHSEL0_Enum;

/* ==============================================  AUDADC SL0CFG WCEN0 [1..1]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL0CFG_WCEN0                                                       */
  AUDADC_SL0CFG_WCEN0_WCEN             = 1,     /*!< WCEN : Enable the window compare for slot 0.                              */
} AUDADC_SL0CFG_WCEN0_Enum;

/* ==============================================  AUDADC SL0CFG SLEN0 [0..0]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL0CFG_SLEN0                                                       */
  AUDADC_SL0CFG_SLEN0_SLEN             = 1,     /*!< SLEN : Enable slot 0 for ADC conversions.                                 */
} AUDADC_SL0CFG_SLEN0_Enum;

/* ========================================================  SL1CFG  ========================================================= */
/* =============================================  AUDADC SL1CFG ADSEL1 [24..26]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL1CFG_ADSEL1                                                      */
  AUDADC_SL1CFG_ADSEL1_AVG_1_MSRMT     = 0,     /*!< AVG_1_MSRMT : Average in 1 measurement in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL1CFG_ADSEL1_AVG_2_MSRMTS    = 1,     /*!< AVG_2_MSRMTS : Average in 2 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL1CFG_ADSEL1_AVG_4_MSRMTS    = 2,     /*!< AVG_4_MSRMTS : Average in 4 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL1CFG_ADSEL1_AVG_8_MSRMT     = 3,     /*!< AVG_8_MSRMT : Average in 8 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL1CFG_ADSEL1_AVG_16_MSRMTS   = 4,     /*!< AVG_16_MSRMTS : Average in 16 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL1CFG_ADSEL1_AVG_32_MSRMTS   = 5,     /*!< AVG_32_MSRMTS : Average in 32 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL1CFG_ADSEL1_AVG_64_MSRMTS   = 6,     /*!< AVG_64_MSRMTS : Average in 64 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL1CFG_ADSEL1_AVG_128_MSRMTS  = 7,     /*!< AVG_128_MSRMTS : Average in 128 measurements in the accumulate
                                                     divide module for this slot.                                              */
} AUDADC_SL1CFG_ADSEL1_Enum;

/* ============================================  AUDADC SL1CFG PRMODE1 [16..17]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL1CFG_PRMODE1                                                     */
  AUDADC_SL1CFG_PRMODE1_P12B0          = 0,     /*!< P12B0 : 12-bit precision mode                                             */
  AUDADC_SL1CFG_PRMODE1_P12B1          = 1,     /*!< P12B1 : 12-bit precision mode                                             */
  AUDADC_SL1CFG_PRMODE1_P10B           = 2,     /*!< P10B : 10-bit precision mode                                              */
  AUDADC_SL1CFG_PRMODE1_P8B            = 3,     /*!< P8B : 8-bit precision mode                                                */
} AUDADC_SL1CFG_PRMODE1_Enum;

/* =============================================  AUDADC SL1CFG CHSEL1 [8..11]  ============================================== */
typedef enum {                                  /*!< AUDADC_SL1CFG_CHSEL1                                                      */
  AUDADC_SL1CFG_CHSEL1_SE0             = 0,     /*!< SE0 : PGA channel A0 output                                               */
  AUDADC_SL1CFG_CHSEL1_SE1             = 1,     /*!< SE1 : PGA channel A1 output                                               */
  AUDADC_SL1CFG_CHSEL1_SE2             = 2,     /*!< SE2 : PGA channel B0 output                                               */
  AUDADC_SL1CFG_CHSEL1_SE3             = 3,     /*!< SE3 : PGA channel B1 output                                               */
} AUDADC_SL1CFG_CHSEL1_Enum;

/* ==============================================  AUDADC SL1CFG WCEN1 [1..1]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL1CFG_WCEN1                                                       */
  AUDADC_SL1CFG_WCEN1_WCEN             = 1,     /*!< WCEN : Enable the window compare for slot 1.                              */
} AUDADC_SL1CFG_WCEN1_Enum;

/* ==============================================  AUDADC SL1CFG SLEN1 [0..0]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL1CFG_SLEN1                                                       */
  AUDADC_SL1CFG_SLEN1_SLEN             = 1,     /*!< SLEN : Enable slot 1 for ADC conversions.                                 */
} AUDADC_SL1CFG_SLEN1_Enum;

/* ========================================================  SL2CFG  ========================================================= */
/* =============================================  AUDADC SL2CFG ADSEL2 [24..26]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL2CFG_ADSEL2                                                      */
  AUDADC_SL2CFG_ADSEL2_AVG_1_MSRMT     = 0,     /*!< AVG_1_MSRMT : Average in 1 measurement in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL2CFG_ADSEL2_AVG_2_MSRMTS    = 1,     /*!< AVG_2_MSRMTS : Average in 2 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL2CFG_ADSEL2_AVG_4_MSRMTS    = 2,     /*!< AVG_4_MSRMTS : Average in 4 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL2CFG_ADSEL2_AVG_8_MSRMT     = 3,     /*!< AVG_8_MSRMT : Average in 8 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL2CFG_ADSEL2_AVG_16_MSRMTS   = 4,     /*!< AVG_16_MSRMTS : Average in 16 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL2CFG_ADSEL2_AVG_32_MSRMTS   = 5,     /*!< AVG_32_MSRMTS : Average in 32 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL2CFG_ADSEL2_AVG_64_MSRMTS   = 6,     /*!< AVG_64_MSRMTS : Average in 64 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL2CFG_ADSEL2_AVG_128_MSRMTS  = 7,     /*!< AVG_128_MSRMTS : Average in 128 measurements in the accumulate
                                                     divide module for this slot.                                              */
} AUDADC_SL2CFG_ADSEL2_Enum;

/* ============================================  AUDADC SL2CFG PRMODE2 [16..17]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL2CFG_PRMODE2                                                     */
  AUDADC_SL2CFG_PRMODE2_P12B0          = 0,     /*!< P12B0 : 12-bit precision mode                                             */
  AUDADC_SL2CFG_PRMODE2_P12B1          = 1,     /*!< P12B1 : 12-bit precision mode                                             */
  AUDADC_SL2CFG_PRMODE2_P10B           = 2,     /*!< P10B : 10-bit precision mode                                              */
  AUDADC_SL2CFG_PRMODE2_P8B            = 3,     /*!< P8B : 8-bit precision mode                                                */
} AUDADC_SL2CFG_PRMODE2_Enum;

/* =============================================  AUDADC SL2CFG CHSEL2 [8..11]  ============================================== */
typedef enum {                                  /*!< AUDADC_SL2CFG_CHSEL2                                                      */
  AUDADC_SL2CFG_CHSEL2_SE0             = 0,     /*!< SE0 : PGA channel A0 output                                               */
  AUDADC_SL2CFG_CHSEL2_SE1             = 1,     /*!< SE1 : PGA channel A1 output                                               */
  AUDADC_SL2CFG_CHSEL2_SE2             = 2,     /*!< SE2 : PGA channel B0 output                                               */
  AUDADC_SL2CFG_CHSEL2_SE3             = 3,     /*!< SE3 : PGA channel B1 output                                               */
} AUDADC_SL2CFG_CHSEL2_Enum;

