AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* =========================================================  INTEN  ========================================================= */
/* ===============================================  AUDADC INTEN DERR [7..7]  ================================================ */
typedef enum {                                  /*!< AUDADC_INTEN_DERR                                                         */
  AUDADC_INTEN_DERR_DMAERROR           = 1,     /*!< DMAERROR : DMA Error Condition Occurred                                   */
} AUDADC_INTEN_DERR_Enum;

/* ===============================================  AUDADC INTEN DCMP [6..6]  ================================================ */
typedef enum {                                  /*!< AUDADC_INTEN_DCMP                                                         */
  AUDADC_INTEN_DCMP_DMACOMPLETE        = 1,     /*!< DMACOMPLETE : DMA Completed a transfer                                    */
} AUDADC_INTEN_DCMP_Enum;

/* ===============================================  AUDADC INTEN WCINC [5..5]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_WCINC                                                        */
  AUDADC_INTEN_WCINC_WCINCINT          = 1,     /*!< WCINCINT : Window comparitor voltage incursion interrupt.                 */
} AUDADC_INTEN_WCINC_Enum;

/* ===============================================  AUDADC INTEN WCEXC [4..4]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_WCEXC                                                        */
  AUDADC_INTEN_WCEXC_WCEXCINT          = 1,     /*!< WCEXCINT : Window comparitor voltage excursion interrupt.                 */
} AUDADC_INTEN_WCEXC_Enum;

/* =============================================  AUDADC INTEN FIFOOVR2 [3..3]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_FIFOOVR2                                                     */
  AUDADC_INTEN_FIFOOVR2_FIFOFULLINT    = 1,     /*!< FIFOFULLINT : FIFO 100 percent full interrupt.                            */
} AUDADC_INTEN_FIFOOVR2_Enum;

/* =============================================  AUDADC INTEN FIFOOVR1 [2..2]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_FIFOOVR1                                                     */
  AUDADC_INTEN_FIFOOVR1_FIFO75INT      = 1,     /*!< FIFO75INT : FIFO 75 percent full interrupt.                               */
} AUDADC_INTEN_FIFOOVR1_Enum;

/* ==============================================  AUDADC INTEN SCNCMP [1..1]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_SCNCMP                                                       */
  AUDADC_INTEN_SCNCMP_SCNCMPINT        = 1,     /*!< SCNCMPINT : ADC scan complete interrupt.                                  */
} AUDADC_INTEN_SCNCMP_Enum;

/* ==============================================  AUDADC INTEN CNVCMP [0..0]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_CNVCMP                                                       */
  AUDADC_INTEN_CNVCMP_CNVCMPINT        = 1,     /*!< CNVCMPINT : ADC conversion complete interrupt.                            */
} AUDADC_INTEN_CNVCMP_Enum;

/* ========================================================  INTSTAT  ======================================================== */
/* ==============================================  AUDADC INTSTAT DERR [7..7]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_DERR                                                       */
  AUDADC_INTSTAT_DERR_DMAERROR         = 1,     /*!< DMAERROR : DMA Error Condition Occurred                                   */
} AUDADC_INTSTAT_DERR_Enum;

/* ==============================================  AUDADC INTSTAT DCMP [6..6]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_DCMP                                                       */
  AUDADC_INTSTAT_DCMP_DMACOMPLETE      = 1,     /*!< DMACOMPLETE : DMA Completed a transfer                                    */
} AUDADC_INTSTAT_DCMP_Enum;

/* ==============================================  AUDADC INTSTAT WCINC [5..5]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_WCINC                                                      */
  AUDADC_INTSTAT_WCINC_WCINCINT        = 1,     /*!< WCINCINT : Window comparitor voltage incursion interrupt.                 */
} AUDADC_INTSTAT_WCINC_Enum;

/* ==============================================  AUDADC INTSTAT WCEXC [4..4]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_WCEXC                                                      */
  AUDADC_INTSTAT_WCEXC_WCEXCINT        = 1,     /*!< WCEXCINT : Window comparitor voltage excursion interrupt.                 */
} AUDADC_INTSTAT_WCEXC_Enum;

/* ============================================  AUDADC INTSTAT FIFOOVR2 [3..3]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTSTAT_FIFOOVR2                                                   */
  AUDADC_INTSTAT_FIFOOVR2_FIFOFULLINT  = 1,     /*!< FIFOFULLINT : FIFO 100 percent full interrupt.                            */
} AUDADC_INTSTAT_FIFOOVR2_Enum;

/* ============================================  AUDADC INTSTAT FIFOOVR1 [2..2]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTSTAT_FIFOOVR1                                                   */
  AUDADC_INTSTAT_FIFOOVR1_FIFO75INT    = 1,     /*!< FIFO75INT : FIFO 75 percent full interrupt.                               */
} AUDADC_INTSTAT_FIFOOVR1_Enum;

