AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* =============================================  AUDADC INTSTAT SCNCMP [1..1]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_SCNCMP                                                     */
  AUDADC_INTSTAT_SCNCMP_SCNCMPINT      = 1,     /*!< SCNCMPINT : ADC scan complete interrupt.                                  */
} AUDADC_INTSTAT_SCNCMP_Enum;

/* =============================================  AUDADC INTSTAT CNVCMP [0..0]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_CNVCMP                                                     */
  AUDADC_INTSTAT_CNVCMP_CNVCMPINT      = 1,     /*!< CNVCMPINT : ADC conversion complete interrupt.                            */
} AUDADC_INTSTAT_CNVCMP_Enum;

/* ========================================================  INTCLR  ========================================================= */
/* ===============================================  AUDADC INTCLR DERR [7..7]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_DERR                                                        */
  AUDADC_INTCLR_DERR_DMAERROR          = 1,     /*!< DMAERROR : DMA Error Condition Occurred                                   */
} AUDADC_INTCLR_DERR_Enum;

/* ===============================================  AUDADC INTCLR DCMP [6..6]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_DCMP                                                        */
  AUDADC_INTCLR_DCMP_DMACOMPLETE       = 1,     /*!< DMACOMPLETE : DMA Completed a transfer                                    */
} AUDADC_INTCLR_DCMP_Enum;

/* ==============================================  AUDADC INTCLR WCINC [5..5]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_WCINC                                                       */
  AUDADC_INTCLR_WCINC_WCINCINT         = 1,     /*!< WCINCINT : Window comparitor voltage incursion interrupt.                 */
} AUDADC_INTCLR_WCINC_Enum;

/* ==============================================  AUDADC INTCLR WCEXC [4..4]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_WCEXC                                                       */
  AUDADC_INTCLR_WCEXC_WCEXCINT         = 1,     /*!< WCEXCINT : Window comparitor voltage excursion interrupt.                 */
} AUDADC_INTCLR_WCEXC_Enum;

/* =============================================  AUDADC INTCLR FIFOOVR2 [3..3]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTCLR_FIFOOVR2                                                    */
  AUDADC_INTCLR_FIFOOVR2_FIFOFULLINT   = 1,     /*!< FIFOFULLINT : FIFO 100 percent full interrupt.                            */
} AUDADC_INTCLR_FIFOOVR2_Enum;

/* =============================================  AUDADC INTCLR FIFOOVR1 [2..2]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTCLR_FIFOOVR1                                                    */
  AUDADC_INTCLR_FIFOOVR1_FIFO75INT     = 1,     /*!< FIFO75INT : FIFO 75 percent full interrupt.                               */
} AUDADC_INTCLR_FIFOOVR1_Enum;

/* ==============================================  AUDADC INTCLR SCNCMP [1..1]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_SCNCMP                                                      */
  AUDADC_INTCLR_SCNCMP_SCNCMPINT       = 1,     /*!< SCNCMPINT : ADC scan complete interrupt.                                  */
} AUDADC_INTCLR_SCNCMP_Enum;

/* ==============================================  AUDADC INTCLR CNVCMP [0..0]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_CNVCMP                                                      */
  AUDADC_INTCLR_CNVCMP_CNVCMPINT       = 1,     /*!< CNVCMPINT : ADC conversion complete interrupt.                            */
} AUDADC_INTCLR_CNVCMP_Enum;

/* ========================================================  INTSET  ========================================================= */
/* ===============================================  AUDADC INTSET DERR [7..7]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_DERR                                                        */
  AUDADC_INTSET_DERR_DMAERROR          = 1,     /*!< DMAERROR : DMA Error Condition Occurred                                   */
} AUDADC_INTSET_DERR_Enum;

/* ===============================================  AUDADC INTSET DCMP [6..6]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_DCMP                                                        */
  AUDADC_INTSET_DCMP_DMACOMPLETE       = 1,     /*!< DMACOMPLETE : DMA Completed a transfer                                    */
} AUDADC_INTSET_DCMP_Enum;

/* ==============================================  AUDADC INTSET WCINC [5..5]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_WCINC                                                       */
  AUDADC_INTSET_WCINC_WCINCINT         = 1,     /*!< WCINCINT : Window comparitor voltage incursion interrupt.                 */
} AUDADC_INTSET_WCINC_Enum;

/* ==============================================  AUDADC INTSET WCEXC [4..4]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_WCEXC                                                       */
  AUDADC_INTSET_WCEXC_WCEXCINT         = 1,     /*!< WCEXCINT : Window comparitor voltage excursion interrupt.                 */
} AUDADC_INTSET_WCEXC_Enum;

/* =============================================  AUDADC INTSET FIFOOVR2 [3..3]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTSET_FIFOOVR2                                                    */
  AUDADC_INTSET_FIFOOVR2_FIFOFULLINT   = 1,     /*!< FIFOFULLINT : FIFO 100 percent full interrupt.                            */
} AUDADC_INTSET_FIFOOVR2_Enum;

/* =============================================  AUDADC INTSET FIFOOVR1 [2..2]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTSET_FIFOOVR1                                                    */
  AUDADC_INTSET_FIFOOVR1_FIFO75INT     = 1,     /*!< FIFO75INT : FIFO 75 percent full interrupt.                               */
} AUDADC_INTSET_FIFOOVR1_Enum;

/* ==============================================  AUDADC INTSET SCNCMP [1..1]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_SCNCMP                                                      */
  AUDADC_INTSET_SCNCMP_SCNCMPINT       = 1,     /*!< SCNCMPINT : ADC scan complete interrupt.                                  */
} AUDADC_INTSET_SCNCMP_Enum;

