AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* =======================================================  NCR0START  ======================================================= */
/* ========================================================  NCR0END  ======================================================== */
/* =======================================================  NCR1START  ======================================================= */
/* ========================================================  NCR1END  ======================================================== */
/* ========================================================  DAXICFG  ======================================================== */
/* ============================================  CPU DAXICFG BUFFERENABLE [8..9]  ============================================ */
typedef enum {                                  /*!< CPU_DAXICFG_BUFFERENABLE                                                  */
  CPU_DAXICFG_BUFFERENABLE_ONE         = 0,     /*!< ONE : Single buffer mode                                                  */
  CPU_DAXICFG_BUFFERENABLE_TWO         = 1,     /*!< TWO : Enable Two buffers                                                  */
  CPU_DAXICFG_BUFFERENABLE_THREE       = 2,     /*!< THREE : Enable Three buffers                                              */
  CPU_DAXICFG_BUFFERENABLE_FOUR        = 3,     /*!< FOUR : Enable Four buffers                                                */
} CPU_DAXICFG_BUFFERENABLE_Enum;

/* =======================================================  DAXICTRL  ======================================================== */
/* ====================================================  ICODEFAULTADDR  ===================================================== */
/* ====================================================  DCODEFAULTADDR  ===================================================== */
/* =====================================================  SYSFAULTADDR  ====================================================== */
/* ======================================================  FAULTSTATUS  ====================================================== */
/* ============================================  CPU FAULTSTATUS SYSFAULT [2..2]  ============================================ */
typedef enum {                                  /*!< CPU_FAULTSTATUS_SYSFAULT                                                  */
  CPU_FAULTSTATUS_SYSFAULT_NOFAULT     = 0,     /*!< NOFAULT : No bus fault has been detected.                                 */
  CPU_FAULTSTATUS_SYSFAULT_FAULT       = 1,     /*!< FAULT : Bus fault detected.                                               */
} CPU_FAULTSTATUS_SYSFAULT_Enum;

/* ===========================================  CPU FAULTSTATUS DCODEFAULT [1..1]  =========================================== */
typedef enum {                                  /*!< CPU_FAULTSTATUS_DCODEFAULT                                                */
  CPU_FAULTSTATUS_DCODEFAULT_NOFAULT   = 0,     /*!< NOFAULT : No DCODE fault has been detected.                               */
  CPU_FAULTSTATUS_DCODEFAULT_FAULT     = 1,     /*!< FAULT : DCODE fault detected.                                             */
} CPU_FAULTSTATUS_DCODEFAULT_Enum;

/* ===========================================  CPU FAULTSTATUS ICODEFAULT [0..0]  =========================================== */
typedef enum {                                  /*!< CPU_FAULTSTATUS_ICODEFAULT                                                */
  CPU_FAULTSTATUS_ICODEFAULT_NOFAULT   = 0,     /*!< NOFAULT : No ICODE fault has been detected.                               */
  CPU_FAULTSTATUS_ICODEFAULT_FAULT     = 1,     /*!< FAULT : ICODE fault detected.                                             */
} CPU_FAULTSTATUS_ICODEFAULT_Enum;

/* ====================================================  FAULTCAPTUREEN  ===================================================== */
/* =======================================  CPU FAULTCAPTUREEN FAULTCAPTUREEN [0..0]  ======================================== */
typedef enum {                                  /*!< CPU_FAULTCAPTUREEN_FAULTCAPTUREEN                                         */
  CPU_FAULTCAPTUREEN_FAULTCAPTUREEN_DIS = 0,    /*!< DIS : Disable fault capture.                                              */
  CPU_FAULTCAPTUREEN_FAULTCAPTUREEN_EN = 1,     /*!< EN : Enable fault capture.                                                */
} CPU_FAULTCAPTUREEN_FAULTCAPTUREEN_Enum;

/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* =====================================================  WRITEERRADDR  ====================================================== */
/* =========================================================  DMON0  ========================================================= */
/* =========================================================  DMON1  ========================================================= */
/* =========================================================  DMON2  ========================================================= */
/* =========================================================  DMON3  ========================================================= */
/* =========================================================  IMON0  ========================================================= */
/* =========================================================  IMON1  ========================================================= */
/* =========================================================  IMON2  ========================================================= */
/* =========================================================  IMON3  ========================================================= */


/* =========================================================================================================================== */
/* ================                                          CRYPTO                                           ================ */
/* =========================================================================================================================== */

