AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* ====================================================  DATALANEPOLSWAP  ==================================================== */
/* =======================================  DSI DATALANEPOLSWAP DATALNPOLSWAP [0..3]  ======================================== */
typedef enum {                                  /*!< DSI_DATALANEPOLSWAP_DATALNPOLSWAP                                         */
  DSI_DATALANEPOLSWAP_DATALNPOLSWAP_LANE0 = 1,  /*!< LANE0 : lane 0 polarity swap                                              */
  DSI_DATALANEPOLSWAP_DATALNPOLSWAP_LANE1 = 2,  /*!< LANE1 : lane 1 polarity swap                                              */
  DSI_DATALANEPOLSWAP_DATALNPOLSWAP_LANE2 = 4,  /*!< LANE2 : lane 2 polarity swap                                              */
  DSI_DATALANEPOLSWAP_DATALNPOLSWAP_LANE3 = 8,  /*!< LANE3 : lane 3 polarity swap                                              */
  DSI_DATALANEPOLSWAP_DATALNPOLSWAP_ALLLANES = 15,/*!< ALLLANES : data lanes polarity swap                                     */
} DSI_DATALANEPOLSWAP_DATALNPOLSWAP_Enum;



/* =========================================================================================================================== */
/* ================                                          DSPI2S0                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  FIFO  ========================================================== */
/* ========================================================  FIFOPTR  ======================================================== */
/* ========================================================  FIFOTHR  ======================================================== */
/* ========================================================  FIFOPOP  ======================================================== */
/* =======================================================  FIFOPUSH  ======================================================== */
/* =======================================================  FIFOCTRL  ======================================================== */
/* ========================================================  FIFOLOC  ======================================================== */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* ========================================================  CLKCFG  ========================================================= */
/* =============================================  DSPI2S0 CLKCFG DIVEN [12..12]  ============================================= */
typedef enum {                                  /*!< DSPI2S0_CLKCFG_DIVEN                                                      */
  DSPI2S0_CLKCFG_DIVEN_DIS             = 0,     /*!< DIS : Disable TOTPER division.                                            */
  DSPI2S0_CLKCFG_DIVEN_EN              = 1,     /*!< EN : Enable TOTPER division.                                              */
} DSPI2S0_CLKCFG_DIVEN_Enum;

/* =============================================  DSPI2S0 CLKCFG DIV3 [11..11]  ============================================== */
typedef enum {                                  /*!< DSPI2S0_CLKCFG_DIV3                                                       */
  DSPI2S0_CLKCFG_DIV3_DIS              = 0,     /*!< DIS : Select divide by 1.                                                 */
  DSPI2S0_CLKCFG_DIV3_EN               = 1,     /*!< EN : Select divide by 3.                                                  */
} DSPI2S0_CLKCFG_DIV3_Enum;

/* ==============================================  DSPI2S0 CLKCFG FSEL [8..10]  ============================================== */
typedef enum {                                  /*!< DSPI2S0_CLKCFG_FSEL                                                       */
  DSPI2S0_CLKCFG_FSEL_MIN_PWR          = 0,     /*!< MIN_PWR : Selects the minimum power clock. This setting should
                                                     be used whenever the IOM is not active.                                   */
  DSPI2S0_CLKCFG_FSEL_HFRC             = 1,     /*!< HFRC : Selects the HFRC as the input clock.                               */
  DSPI2S0_CLKCFG_FSEL_HFRC_DIV2        = 2,     /*!< HFRC_DIV2 : Selects the HFRC / 2 as the input clock.                      */
  DSPI2S0_CLKCFG_FSEL_HFRC_DIV4        = 3,     /*!< HFRC_DIV4 : Selects the HFRC / 4 as the input clock.                      */
  DSPI2S0_CLKCFG_FSEL_HFRC_DIV8        = 4,     /*!< HFRC_DIV8 : Selects the HFRC / 8 as the input clock.                      */
  DSPI2S0_CLKCFG_FSEL_HFRC_DIV16       = 5,     /*!< HFRC_DIV16 : Selects the HFRC / 16 as the input clock.                    */
  DSPI2S0_CLKCFG_FSEL_HFRC_DIV32       = 6,     /*!< HFRC_DIV32 : Selects the HFRC / 32 as the input clock.                    */
  DSPI2S0_CLKCFG_FSEL_HFRC_DIV64       = 7,     /*!< HFRC_DIV64 : Selects the HFRC / 64 as the input clock.                    */
} DSPI2S0_CLKCFG_FSEL_Enum;

/* ======================================================  SUBMODCTRL  ======================================================= */
/* ==========================================  DSPI2S0 SUBMODCTRL SMOD1TYPE [5..7]  ========================================== */
typedef enum {                                  /*!< DSPI2S0_SUBMODCTRL_SMOD1TYPE                                              */
  DSPI2S0_SUBMODCTRL_SMOD1TYPE_MSPI    = 0,     /*!< MSPI : SPI Master submodule                                               */
  DSPI2S0_SUBMODCTRL_SMOD1TYPE_I2C_MASTER = 1,  /*!< I2C_MASTER : MI2C submodule                                               */
  DSPI2S0_SUBMODCTRL_SMOD1TYPE_SSPI    = 2,     /*!< SSPI : SPI Slave submodule                                                */
  DSPI2S0_SUBMODCTRL_SMOD1TYPE_SI2C    = 3,     /*!< SI2C : I2C Slave submodule                                                */
  DSPI2S0_SUBMODCTRL_SMOD1TYPE_NA      = 7,     /*!< NA : NOT INSTALLED                                                        */
} DSPI2S0_SUBMODCTRL_SMOD1TYPE_Enum;

/* ==========================================  DSPI2S0 SUBMODCTRL SMOD0TYPE [1..3]  ========================================== */
typedef enum {                                  /*!< DSPI2S0_SUBMODCTRL_SMOD0TYPE                                              */
  DSPI2S0_SUBMODCTRL_SMOD0TYPE_SPI_MASTER = 0,  /*!< SPI_MASTER : MSPI submodule                                               */
  DSPI2S0_SUBMODCTRL_SMOD0TYPE_I2C_MASTER = 1,  /*!< I2C_MASTER : I2C Master submodule                                         */
  DSPI2S0_SUBMODCTRL_SMOD0TYPE_SSPI    = 2,     /*!< SSPI : SPI Slave submodule                                                */
  DSPI2S0_SUBMODCTRL_SMOD0TYPE_SI2C    = 3,     /*!< SI2C : I2C Slave submodule                                                */
  DSPI2S0_SUBMODCTRL_SMOD0TYPE_NA      = 7,     /*!< NA : NOT INSTALLED                                                        */
} DSPI2S0_SUBMODCTRL_SMOD0TYPE_Enum;

/* ==========================================================  CMD  ========================================================== */
/* ================================================  DSPI2S0 CMD CMD [0..4]  ================================================= */
typedef enum {                                  /*!< DSPI2S0_CMD_CMD                                                           */
  DSPI2S0_CMD_CMD_WRITE                = 1,     /*!< WRITE : Write command using count of offset bytes specified
                                                     in the OFFSETCNT field                                                    */
  DSPI2S0_CMD_CMD_READ                 = 2,     /*!< READ : Read command using count of offset bytes specified in
                                                     the OFFSETCNT field                                                       */
  DSPI2S0_CMD_CMD_TMW                  = 3,     /*!< TMW : SPI only. Test mode to do constant write operations. Useful
                                                     for debug and power measurements. Will continually send
                                                     data in OFFSET field                                                      */
  DSPI2S0_CMD_CMD_TMR                  = 4,     /*!< TMR : SPI Only. Test mode to do constant read operations. Useful
                                                     for debug and power measurements. Will continually read
                                                     data from external input                                                  */
} DSPI2S0_CMD_CMD_Enum;

/* ========================================================  CMDRPT  ========================================================= */
/* =======================================================  OFFSETHI  ======================================================== */
/* ========================================================  CMDSTAT  ======================================================== */
/* ============================================  DSPI2S0 CMDSTAT CMDSTAT [5..7]  ============================================= */
typedef enum {                                  /*!< DSPI2S0_CMDSTAT_CMDSTAT                                                   */
  DSPI2S0_CMDSTAT_CMDSTAT_ERR          = 1,     /*!< ERR : Error encountered with command                                      */
  DSPI2S0_CMDSTAT_CMDSTAT_ACTIVE       = 2,     /*!< ACTIVE : Actively processing command                                      */
  DSPI2S0_CMDSTAT_CMDSTAT_IDLE         = 4,     /*!< IDLE : Idle state, no active command, no error                            */
  DSPI2S0_CMDSTAT_CMDSTAT_WAIT         = 6,     /*!< WAIT : Command in progress, but waiting on data from host                 */
} DSPI2S0_CMDSTAT_CMDSTAT_Enum;

