AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* =======================================================  CQCURIDX  ======================================================== */
/* =======================================================  CQENDIDX  ======================================================== */
/* ========================================================  STATUS  ========================================================= */
/* =============================================  DSPI2S0 STATUS IDLEST [2..2]  ============================================== */
typedef enum {                                  /*!< DSPI2S0_STATUS_IDLEST                                                     */
  DSPI2S0_STATUS_IDLEST_IDLE           = 1,     /*!< IDLE : The I/O state machine is in the idle state.                        */
} DSPI2S0_STATUS_IDLEST_Enum;

/* =============================================  DSPI2S0 STATUS CMDACT [1..1]  ============================================== */
typedef enum {                                  /*!< DSPI2S0_STATUS_CMDACT                                                     */
  DSPI2S0_STATUS_CMDACT_ACTIVE         = 1,     /*!< ACTIVE : An I/O command is active. Indicates the active module
                                                     has an active command and is processing this. De-asserted
                                                     when the command is completed.                                            */
} DSPI2S0_STATUS_CMDACT_Enum;

/* ===============================================  DSPI2S0 STATUS ERR [0..0]  =============================================== */
typedef enum {                                  /*!< DSPI2S0_STATUS_ERR                                                        */
  DSPI2S0_STATUS_ERR_ERROR             = 1,     /*!< ERROR : Bit has been deprecated and will always return 0.                 */
} DSPI2S0_STATUS_ERR_Enum;

/* ========================================================  MSPICFG  ======================================================== */
/* ============================================  DSPI2S0 MSPICFG SPILSB [23..23]  ============================================ */
typedef enum {                                  /*!< DSPI2S0_MSPICFG_SPILSB                                                    */
  DSPI2S0_MSPICFG_SPILSB_MSB           = 0,     /*!< MSB : Send and receive MSB bit first                                      */
  DSPI2S0_MSPICFG_SPILSB_LSB           = 1,     /*!< LSB : Send and receive LSB bit first                                      */
} DSPI2S0_MSPICFG_SPILSB_Enum;

/* ===========================================  DSPI2S0 MSPICFG RDFCPOL [22..22]  ============================================ */
typedef enum {                                  /*!< DSPI2S0_MSPICFG_RDFCPOL                                                   */
  DSPI2S0_MSPICFG_RDFCPOL_HIGH         = 0,     /*!< HIGH : Flow control signal high creates flow control.                     */
  DSPI2S0_MSPICFG_RDFCPOL_LOW          = 1,     /*!< LOW : Flow control signal low creates flow control.                       */
} DSPI2S0_MSPICFG_RDFCPOL_Enum;

/* ===========================================  DSPI2S0 MSPICFG WTFCPOL [21..21]  ============================================ */
typedef enum {                                  /*!< DSPI2S0_MSPICFG_WTFCPOL                                                   */
  DSPI2S0_MSPICFG_WTFCPOL_HIGH         = 0,     /*!< HIGH : Flow control signal high(1) creates flow control and
                                                     byte transfers will stop until the flow control signal
                                                     goes low.                                                                 */
  DSPI2S0_MSPICFG_WTFCPOL_LOW          = 1,     /*!< LOW : Flow control signal low(0) creates flow control and byte
                                                     transfers will stop until the flow control signal goes
                                                     high(1).                                                                  */
} DSPI2S0_MSPICFG_WTFCPOL_Enum;

/* ===========================================  DSPI2S0 MSPICFG WTFCIRQ [20..20]  ============================================ */
typedef enum {                                  /*!< DSPI2S0_MSPICFG_WTFCIRQ                                                   */
  DSPI2S0_MSPICFG_WTFCIRQ_MISO         = 0,     /*!< MISO : MISO is used as the write mode flow control signal.                */
  DSPI2S0_MSPICFG_WTFCIRQ_IRQ          = 1,     /*!< IRQ : IRQ is used as the write mode flow control signal.                  */
} DSPI2S0_MSPICFG_WTFCIRQ_Enum;

/* ===========================================  DSPI2S0 MSPICFG MOSIINV [18..18]  ============================================ */
typedef enum {                                  /*!< DSPI2S0_MSPICFG_MOSIINV                                                   */
  DSPI2S0_MSPICFG_MOSIINV_NORMAL       = 0,     /*!< NORMAL : MOSI is set to 0 in read mode and 1 in write mode.               */
  DSPI2S0_MSPICFG_MOSIINV_INVERT       = 1,     /*!< INVERT : MOSI is set to 1 in read mode and 0 in write mode.               */
} DSPI2S0_MSPICFG_MOSIINV_Enum;

/* =============================================  DSPI2S0 MSPICFG RDFC [17..17]  ============================================= */
typedef enum {                                  /*!< DSPI2S0_MSPICFG_RDFC                                                      */
  DSPI2S0_MSPICFG_RDFC_DIS             = 0,     /*!< DIS : Read mode flow control disabled.                                    */
  DSPI2S0_MSPICFG_RDFC_EN              = 1,     /*!< EN : Read mode flow control enabled.                                      */
} DSPI2S0_MSPICFG_RDFC_Enum;

/* =============================================  DSPI2S0 MSPICFG WTFC [16..16]  ============================================= */
typedef enum {                                  /*!< DSPI2S0_MSPICFG_WTFC                                                      */
  DSPI2S0_MSPICFG_WTFC_DIS             = 0,     /*!< DIS : Write mode flow control disabled.                                   */
  DSPI2S0_MSPICFG_WTFC_EN              = 1,     /*!< EN : Write mode flow control enabled.                                     */
} DSPI2S0_MSPICFG_WTFC_Enum;

