AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* ==============================================  DSPI2S0 MSPICFG SPHA [1..1]  ============================================== */
typedef enum {                                  /*!< DSPI2S0_MSPICFG_SPHA                                                      */
  DSPI2S0_MSPICFG_SPHA_SAMPLE_LEADING_EDGE = 0, /*!< SAMPLE_LEADING_EDGE : Sample on the leading (first) clock edge.           */
  DSPI2S0_MSPICFG_SPHA_SAMPLE_TRAILING_EDGE = 1,/*!< SAMPLE_TRAILING_EDGE : Sample on the trailing (second) clock
                                                     edge.                                                                     */
} DSPI2S0_MSPICFG_SPHA_Enum;

/* ==============================================  DSPI2S0 MSPICFG SPOL [0..0]  ============================================== */
typedef enum {                                  /*!< DSPI2S0_MSPICFG_SPOL                                                      */
  DSPI2S0_MSPICFG_SPOL_CLK_BASE_0      = 0,     /*!< CLK_BASE_0 : The base value of the clock is 0.                            */
  DSPI2S0_MSPICFG_SPOL_CLK_BASE_1      = 1,     /*!< CLK_BASE_1 : The base value of the clock is 1.                            */
} DSPI2S0_MSPICFG_SPOL_Enum;

/* ========================================================  MI2CCFG  ======================================================== */
/* =============================================  DSPI2S0 MI2CCFG ARBEN [2..2]  ============================================== */
typedef enum {                                  /*!< DSPI2S0_MI2CCFG_ARBEN                                                     */
  DSPI2S0_MI2CCFG_ARBEN_ARBEN          = 1,     /*!< ARBEN : Enable multi-master bus arbitration support for this
                                                     i2c master                                                                */
  DSPI2S0_MI2CCFG_ARBEN_ARBDIS         = 0,     /*!< ARBDIS : Disable multi-master bus arbitration support for this
                                                     i2c master                                                                */
} DSPI2S0_MI2CCFG_ARBEN_Enum;

/* =============================================  DSPI2S0 MI2CCFG I2CLSB [1..1]  ============================================= */
typedef enum {                                  /*!< DSPI2S0_MI2CCFG_I2CLSB                                                    */
  DSPI2S0_MI2CCFG_I2CLSB_MSBFIRST      = 0,     /*!< MSBFIRST : Byte data is transmitted MSB first onto the bus/read
                                                     from the bus                                                              */
  DSPI2S0_MI2CCFG_I2CLSB_LSBFIRST      = 1,     /*!< LSBFIRST : Byte data is transmitted LSB first onto the bus/read
                                                     from the bus                                                              */
} DSPI2S0_MI2CCFG_I2CLSB_Enum;

/* =============================================  DSPI2S0 MI2CCFG ADDRSZ [0..0]  ============================================= */
typedef enum {                                  /*!< DSPI2S0_MI2CCFG_ADDRSZ                                                    */
  DSPI2S0_MI2CCFG_ADDRSZ_ADDRSZ7       = 0,     /*!< ADDRSZ7 : Use 7b addressing for I2C master transactions                   */
  DSPI2S0_MI2CCFG_ADDRSZ_ADDRSZ10      = 1,     /*!< ADDRSZ10 : Use 10b addressing for I2C master transactions                 */
} DSPI2S0_MI2CCFG_ADDRSZ_Enum;

/* ========================================================  DEVCFG  ========================================================= */
/* ========================================================  IOMDBG  ========================================================= */


/* =========================================================================================================================== */
/* ================                                            DSP                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  MUTEX0  ========================================================= */
/* ===============================================  DSP MUTEX0 MUTEX0 [0..2]  ================================================ */
typedef enum {                                  /*!< DSP_MUTEX0_MUTEX0                                                         */
  DSP_MUTEX0_MUTEX0_NONE               = 0,     /*!< NONE : Mutex is free                                                      */
  DSP_MUTEX0_MUTEX0_CPU                = 1,     /*!< CPU : CPU Owns Mutex                                                      */
  DSP_MUTEX0_MUTEX0_DSP0               = 2,     /*!< DSP0 : DSP0 Owns Mutex                                                    */
  DSP_MUTEX0_MUTEX0_DSP1               = 4,     /*!< DSP1 : DSP1 Owns Mutex                                                    */
  DSP_MUTEX0_MUTEX0_CLEAR              = 6,     /*!< CLEAR : Clear Mutex (conditional)                                         */
  DSP_MUTEX0_MUTEX0_SET                = 7,     /*!< SET : Set Mutex (conditional)                                             */
} DSP_MUTEX0_MUTEX0_Enum;

/* ========================================================  MUTEX1  ========================================================= */
/* ===============================================  DSP MUTEX1 MUTEX1 [0..2]  ================================================ */
typedef enum {                                  /*!< DSP_MUTEX1_MUTEX1                                                         */
  DSP_MUTEX1_MUTEX1_NONE               = 0,     /*!< NONE : Mutex is free                                                      */
  DSP_MUTEX1_MUTEX1_CPU                = 1,     /*!< CPU : CPU Owns Mutex                                                      */
  DSP_MUTEX1_MUTEX1_DSP0               = 2,     /*!< DSP0 : DSP0 Owns Mutex                                                    */
  DSP_MUTEX1_MUTEX1_DSP1               = 4,     /*!< DSP1 : DSP1 Owns Mutex                                                    */
  DSP_MUTEX1_MUTEX1_CLEAR              = 6,     /*!< CLEAR : Clear Mutex (conditional)                                         */
  DSP_MUTEX1_MUTEX1_SET                = 7,     /*!< SET : Set Mutex (conditional)                                             */
} DSP_MUTEX1_MUTEX1_Enum;

