AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* ========================================================  TEX2RES  ======================================================== */
/* =======================================================  TEX3BASE  ======================================================== */
/* ======================================================  TEX3STRIDE  ======================================================= */
/* ============================================  GPU TEX3STRIDE IMGFMT [24..31]  ============================================= */
typedef enum {                                  /*!< GPU_TEX3STRIDE_IMGFMT                                                     */
  GPU_TEX3STRIDE_IMGFMT_RGBX8888       = 0,     /*!< RGBX8888 : Color Space RGBX means, that the pixel format still
                                                     has an alpha channel, but it is ignored, and is always
                                                     set to 255. The RGBX 32 bit RGB format is stored in memory
                                                     as 8 red bits, 8 green bits, 8 blue bits, and 8 ignored
                                                     bits.                                                                     */
  GPU_TEX3STRIDE_IMGFMT_RGBA8888       = 1,     /*!< RGBA8888 : Color Space RED GREEN BLUE ALPHA (internal format
                                                     is always on: 32-bit)                                                     */
  GPU_TEX3STRIDE_IMGFMT_XRGB8888       = 2,     /*!< XRGB8888 : Color Space                                                    */
  GPU_TEX3STRIDE_IMGFMT_ARGB8888       = 3,     /*!< ARGB8888 : Color Space In the ARGB (word-order) encoding the
                                                     intensity of each channel sample is defined by 8 bits,
                                                     and are arranged in memory in such manner that a single
                                                     32-bit unsigned integer has the alpha sample in the highest
                                                     8 bits, followed by the red sample, green sample and finally
                                                     the blue sample in the lowest 8 bits                                      */
  GPU_TEX3STRIDE_IMGFMT_RGBA565        = 4,     /*!< RGBA565 : Color Space RED(5-bits) GREEN(6-bits) BLUE (5-bits)             */
  GPU_TEX3STRIDE_IMGFMT_RGBA5551       = 5,     /*!< RGBA5551 : Color Space Red,green,blue,alpha (transparency).               */
  GPU_TEX3STRIDE_IMGFMT_L8             = 9,     /*!< L8 : Color Space Lum8 grayscale                                           */
  GPU_TEX3STRIDE_IMGFMT_TSC4           = 18,    /*!< TSC4 : Color Space Proprietary texture compression                        */
  GPU_TEX3STRIDE_IMGFMT_TSC6           = 22,    /*!< TSC6 : Color Space Optional proprietary texture compression               */
  GPU_TEX3STRIDE_IMGFMT_TSC6A          = 23,    /*!< TSC6A : Color Space Optional proprietary texture compression              */
} GPU_TEX3STRIDE_IMGFMT_Enum;

/* ============================================  GPU TEX3STRIDE IMGMODE [16..23]  ============================================ */
typedef enum {                                  /*!< GPU_TEX3STRIDE_IMGMODE                                                    */
  GPU_TEX3STRIDE_IMGMODE_POINTSAMPLE   = 0,     /*!< POINTSAMPLE : Texture mapping: rotate, resize and distort a
                                                     bitmap image.                                                             */
  GPU_TEX3STRIDE_IMGMODE_BILINEARFILTERING = 1, /*!< BILINEARFILTERING : Texture mapping: rotate, resize and distort
                                                     a bitmap image. A method used to smooth textures when displayed
                                                     larger or smaller than they actually are.                                 */
} GPU_TEX3STRIDE_IMGMODE_Enum;

/* ========================================================  TEX3RES  ======================================================== */
/* =========================================================  CGCMD  ========================================================= */
/* ========================================================  CGCTRL  ========================================================= */
/* =====================================================  DIRTYTRIGMIN  ====================================================== */
/* =====================================================  DIRTYTRIGMAX  ====================================================== */
/* ========================================================  STATUS  ========================================================= */
/* ========================================================  BUSCTRL  ======================================================== */
/* ======================================================  IMEMLDIADDR  ====================================================== */
/* =====================================================  IMEMLDIDATAHL  ===================================================== */
/* =====================================================  IMEMLDIDATAHH  ===================================================== */
/* =====================================================  CMDLISTSTATUS  ===================================================== */
/* ====================================================  CMDLISTRINGSTOP  ==================================================== */
/* ======================================================  CMDLISTADDR  ====================================================== */
/* ======================================================  CMDLISTSIZE  ====================================================== */
/* =====================================================  INTERRUPTCTRL  ===================================================== */
/* =======================================================  SYSCLEAR  ======================================================== */
/* ========================================================  DRAWCMD  ======================================================== */
/* ===============================================  GPU DRAWCMD START [0..2]  ================================================ */
typedef enum {                                  /*!< GPU_DRAWCMD_START                                                         */
  GPU_DRAWCMD_START_PIXEL              = 0,     /*!< PIXEL : draw pixel using STARTXY                                          */
  GPU_DRAWCMD_START_LINE               = 1,     /*!< LINE : draw line from STARTXY to ENDXY                                    */
  GPU_DRAWCMD_START_RECT               = 2,     /*!< RECT : fill rectangle from STARTXY to ENDXY                               */
  GPU_DRAWCMD_START_TRI                = 3,     /*!< TRI : draw triangle (if enabled)                                          */
  GPU_DRAWCMD_START_QUAD               = 4,     /*!< QUAD : draw quadrilateral (if enabled)                                    */
} GPU_DRAWCMD_START_Enum;

/* ========================================================  DRAWPT0  ======================================================== */
/* ========================================================  DRAWPT1  ======================================================== */
/* ========================================================  CLIPMIN  ======================================================== */
/* ========================================================  CLIPMAX  ======================================================== */
/* =======================================================  RASTCTRL  ======================================================== */
/* ======================================================  DRAWCODEPTR  ====================================================== */
/* =======================================================  DRAWPT0X  ======================================================== */
/* =======================================================  DRAWPT0Y  ======================================================== */
/* =======================================================  DRAWPT0Z  ======================================================== */
/* =======================================================  DRAWCOLOR  ======================================================= */
/* =======================================================  DRAWPT1X  ======================================================== */
/* =======================================================  DRAWPT1Y  ======================================================== */
/* =======================================================  DRAWPT1Z  ======================================================== */
/* =======================================================  DRAWPT2X  ======================================================== */
/* =======================================================  DRAWPT2Y  ======================================================== */
/* =======================================================  DRAWPT2Z  ======================================================== */
/* =======================================================  DRAWPT3X  ======================================================== */
/* =======================================================  DRAWPT3Y  ======================================================== */
/* =======================================================  DRAWPT3Z  ======================================================== */
/* =========================================================  MM00  ========================================================== */
/* =========================================================  MM01  ========================================================== */
/* =========================================================  MM02  ========================================================== */
/* =========================================================  MM10  ========================================================== */
/* =========================================================  MM11  ========================================================== */
/* =========================================================  MM12  ========================================================== */
/* =========================================================  MM20  ========================================================== */
/* =========================================================  MM21  ========================================================== */
/* =========================================================  MM22  ========================================================== */
/* ======================================================  DEPTHSTARTL  ====================================================== */
/* ======================================================  DEPTHSTARTH  ====================================================== */
/* =======================================================  DEPTHDXL  ======================================================== */
/* =======================================================  DEPTHDXH  ======================================================== */
/* =======================================================  DEPTHDYL  ======================================================== */
/* =======================================================  DEPTHDYH  ======================================================== */
/* =========================================================  REDX  ========================================================== */
/* =========================================================  REDY  ========================================================== */
/* ========================================================  GREENX  ========================================================= */
/* ========================================================  GREENY  ========================================================= */
/* =========================================================  BLUEX  ========================================================= */
/* =========================================================  BLUEY  ========================================================= */
/* =========================================================  ALFX  ========================================================== */
/* =========================================================  ALFY  ========================================================== */
/* ========================================================  REDINIT  ======================================================== */
/* ========================================================  GREINIT  ======================================================== */
/* ========================================================  BLUINIT  ======================================================== */
/* ========================================================  ALFINIT  ======================================================== */
/* =========================================================  IDREG  ========================================================= */
/* =======================================================  LOADCTRL  ======================================================== */
/* =========================================================  C0REG  ========================================================= */
/* =========================================================  C1REG  ========================================================= */
/* =========================================================  C2REG  ========================================================= */
/* =========================================================  C3REG  ========================================================= */
/* =========================================================  IRQID  ========================================================= */


/* =========================================================================================================================== */
/* ================                                            I3C                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  HCIVERSION  ======================================================= */
/* =======================================================  HCCONTROL  ======================================================= */
/* ======================================================  DEVICEADDR  ======================================================= */
/* ====================================================  HCCAPABILITIES  ===================================================== */
/* =======================================================  RESETCTRL  ======================================================= */
/* =====================================================  PRESENTSTATE  ====================================================== */
/* ======================================================  INTRSTATUS  ======================================================= */
/* ===================================================  INTRSTATUSENABLE  ==================================================== */
/* ===================================================  INTRSIGNALENABLE  ==================================================== */
/* =======================================================  INTRFORCE  ======================================================= */
/* ===================================================  DATSECTIONOFFSET  ==================================================== */
/* ===================================================  DCTSECTIONOFFSET  ==================================================== */
/* ===============================================  RINGHEADERSSECTIONOFFSET  ================================================ */
/* ===================================================  PIOSECTIONOFFSET  ==================================================== */
/* =================================================  EXTCAPSSECTIONOFFSET  ================================================== */
/* =====================================================  IBINOTIFYCTRL  ===================================================== */
/* =========================================================  DAT0  ========================================================== */
/* =========================================================  DAT1  ========================================================== */
/* =========================================================  DCT0  ========================================================== */
/* =========================================================  DCT1  ========================================================== */
/* =========================================================  DCT2  ========================================================== */
/* =========================================================  DCT3  ========================================================== */
/* ======================================================  RHSCONTROL  ======================================================= */
/* =======================================================  RH0OFFSET  ======================================================= */
/* =======================================================  RH1OFFSET  ======================================================= */
/* =======================================================  RH2OFFSET  ======================================================= */
/* =======================================================  RH3OFFSET  ======================================================= */
/* ===================================================  COMMANDQUEUEPORT  ==================================================== */
/* ===================================================  RESPONSEQUEUEPORT  =================================================== */
/* =====================================================  XFERDATAPORT  ====================================================== */
/* ========================================================  IBIPORT  ======================================================== */
/* =====================================================  QUEUETHLDCTRL  ===================================================== */
/* ==================================================  DATABUFFERTHLDCTRL  =================================================== */
/* =====================================================  QUEUESIZECTRL  ===================================================== */
/* =====================================================  PIOINTRSTATUS  ===================================================== */
/* ==================================================  PIOINTRSTATUSENABLE  ================================================== */
/* ==================================================  PIOINTRSIGNALENABLE  ================================================== */
/* =====================================================  PIOINTRFORCE  ====================================================== */
/* =====================================================  EXTCAPHEADER  ====================================================== */
/* ===================================================  COMPMANUFACTURER  ==================================================== */
/* ======================================================  COMPVERSION  ====================================================== */
/* =======================================================  COMPTYPE  ======================================================== */
/* =====================================================  MASTERCONFIG  ====================================================== */
/* ========================================================  CRSETUP  ======================================================== */
/* =======================================================  IBISETUP  ======================================================== */
/* =====================================================  CHUNKCONTROL  ====================================================== */
/* =====================================================  RHINTRSTATUS  ====================================================== */
/* ==================================================  RHINTRSTATUSENABLE  =================================================== */
/* ==================================================  RHINTRSIGNALENABLE  =================================================== */
/* ======================================================  RHINTRFORCE  ====================================================== */
/* =======================================================  RHSTATUS  ======================================================== */
/* =======================================================  RHCONTROL  ======================================================= */
/* =====================================================  RHOPERATION1  ====================================================== */
/* =====================================================  RHOPERATION2  ====================================================== */
/* ====================================================  RHCMDRINGBASELO  ==================================================== */
/* ====================================================  RHCMDRINGBASEHI  ==================================================== */
/* ===================================================  RHRESPRINGBASELO  ==================================================== */
/* ===================================================  RHRESPRINGBASEHI  ==================================================== */
/* =================================================  RHIBISTATUSRINGBASELO  ================================================= */
/* =================================================  RHIBISTATUSRINGBASEHI  ================================================= */
/* ==================================================  RHIBIDATARINGBASELO  ================================================== */
/* ==================================================  RHIBIDATARINGBASEHI  ================================================== */


/* =========================================================================================================================== */
/* ================                                           IOM0                                            ================ */
/* =========================================================================================================================== */

