AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* ========================================================  ACCESS  ========================================================= */
/* ==============================================  MRAM ACCESS ACCESS [0..31]  =============================================== */
typedef enum {                                  /*!< MRAM_ACCESS_ACCESS                                                        */
  MRAM_ACCESS_ACCESS_Key               = 195,   /*!< Key : Key value to unlock the register.                                   */
} MRAM_ACCESS_ACCESS_Enum;

/* ========================================================  TMCCTRL  ======================================================== */
/* ========================================================  TMCCMD  ========================================================= */
/* ===============================================  MRAM TMCCMD TMCCMD [0..4]  =============================================== */
typedef enum {                                  /*!< MRAM_TMCCMD_TMCCMD                                                        */
  MRAM_TMCCMD_TMCCMD_NOP               = 0,     /*!< NOP : No operation                                                        */
  MRAM_TMCCMD_TMCCMD_READ              = 1,     /*!< READ : Perform read                                                       */
  MRAM_TMCCMD_TMCCMD_LOAD              = 2,     /*!< LOAD : Perform buffer load (pre-programming step)                         */
  MRAM_TMCCMD_TMCCMD_WRITE             = 3,     /*!< WRITE : Perform buffer write                                              */
  MRAM_TMCCMD_TMCCMD_CLRLOAD           = 4,     /*!< CLRLOAD : Clear Load Buffers                                              */
  MRAM_TMCCMD_TMCCMD_WRITECFG          = 5,     /*!< WRITECFG : Write Config                                                   */
  MRAM_TMCCMD_TMCCMD_READCFG           = 6,     /*!< READCFG : Read Config                                                     */
  MRAM_TMCCMD_TMCCMD_WAKEUP            = 12,    /*!< WAKEUP : Wake up command                                                  */
  MRAM_TMCCMD_TMCCMD_AUTOWAKEUP        = 13,    /*!< AUTOWAKEUP : Auto Wake up command                                         */
  MRAM_TMCCMD_TMCCMD_RECALL            = 22,    /*!< RECALL : Recall                                                           */
} MRAM_TMCCMD_TMCCMD_Enum;



/* =========================================================================================================================== */
/* ================                                           MSPI0                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* =============================================  MSPI0 CTRL PIOMIXED [13..15]  ============================================== */
typedef enum {                                  /*!< MSPI0_CTRL_PIOMIXED                                                       */
  MSPI0_CTRL_PIOMIXED_NORMAL           = 0,     /*!< NORMAL : Transfers all proceed using the settings in DEVCFG
                                                     register (everything in the same data rate)                               */
  MSPI0_CTRL_PIOMIXED_D2               = 1,     /*!< D2 : Data operations proceed in dual data rate                            */
  MSPI0_CTRL_PIOMIXED_AD2              = 3,     /*!< AD2 : Address and Data operations proceed in dual data rate               */
  MSPI0_CTRL_PIOMIXED_D4               = 5,     /*!< D4 : Data operations proceed in quad data rate                            */
  MSPI0_CTRL_PIOMIXED_AD4              = 7,     /*!< AD4 : Address and Data operations proceed in quad data rate               */
} MSPI0_CTRL_PIOMIXED_Enum;

/* ===============================================  MSPI0 CTRL PIODEV [4..4]  ================================================ */
typedef enum {                                  /*!< MSPI0_CTRL_PIODEV                                                         */
  MSPI0_CTRL_PIODEV_DEVICE0            = 0,     /*!< DEVICE0 : Use DEVICE0 Configuration                                       */
  MSPI0_CTRL_PIODEV_DEVICE1            = 1,     /*!< DEVICE1 : Use DEVICE1 CONFIGURATION                                       */
} MSPI0_CTRL_PIODEV_Enum;

/* =========================================================  ADDR  ========================================================== */
/* =========================================================  INSTR  ========================================================= */
/* ========================================================  TXFIFO  ========================================================= */
/* ========================================================  RXFIFO  ========================================================= */
/* =======================================================  TXENTRIES  ======================================================= */
/* =======================================================  RXENTRIES  ======================================================= */
/* =======================================================  THRESHOLD  ======================================================= */
/* ========================================================  MSPICFG  ======================================================== */
/* ==============================================  MSPI0 MSPICFG IOMSEL [4..7]  ============================================== */
typedef enum {                                  /*!< MSPI0_MSPICFG_IOMSEL                                                      */
  MSPI0_MSPICFG_IOMSEL_IOM0            = 0,     /*!< IOM0 : ERROR: desc VALUE MISSING                                          */
  MSPI0_MSPICFG_IOMSEL_IOM1            = 1,     /*!< IOM1 : ERROR: desc VALUE MISSING                                          */
  MSPI0_MSPICFG_IOMSEL_IOM2            = 2,     /*!< IOM2 : ERROR: desc VALUE MISSING                                          */
  MSPI0_MSPICFG_IOMSEL_IOM3            = 3,     /*!< IOM3 : ERROR: desc VALUE MISSING                                          */
  MSPI0_MSPICFG_IOMSEL_IOM4            = 4,     /*!< IOM4 : ERROR: desc VALUE MISSING                                          */
  MSPI0_MSPICFG_IOMSEL_IOM5            = 5,     /*!< IOM5 : ERROR: desc VALUE MISSING                                          */
  MSPI0_MSPICFG_IOMSEL_IOM6            = 6,     /*!< IOM6 : ERROR: desc VALUE MISSING                                          */
  MSPI0_MSPICFG_IOMSEL_IOM7            = 7,     /*!< IOM7 : ERROR: desc VALUE MISSING                                          */
  MSPI0_MSPICFG_IOMSEL_MSPI0           = 8,     /*!< MSPI0 : ERROR: desc VALUE MISSING                                         */
  MSPI0_MSPICFG_IOMSEL_MSPI1           = 9,     /*!< MSPI1 : ERROR: desc VALUE MISSING                                         */
  MSPI0_MSPICFG_IOMSEL_MSPI2           = 10,    /*!< MSPI2 : ERROR: desc VALUE MISSING                                         */
} MSPI0_MSPICFG_IOMSEL_Enum;

/* ==============================================  MSPI0 MSPICFG APBCLK [0..0]  ============================================== */
typedef enum {                                  /*!< MSPI0_MSPICFG_APBCLK                                                      */
  MSPI0_MSPICFG_APBCLK_DIS             = 0,     /*!< DIS : Disable continuous clock.                                           */
  MSPI0_MSPICFG_APBCLK_EN              = 1,     /*!< EN : Enable continuous clock.                                             */
} MSPI0_MSPICFG_APBCLK_Enum;

/* =======================================================  PADOUTEN  ======================================================== */
/* ==============================================  MSPI0 PADOUTEN OUTEN [0..9]  ============================================== */
typedef enum {                                  /*!< MSPI0_PADOUTEN_OUTEN                                                      */
  MSPI0_PADOUTEN_OUTEN_QUAD            = 271,   /*!< QUAD : Quad0 (4 data + 1 clock)                                           */
  MSPI0_PADOUTEN_OUTEN_OCTAL           = 1023,  /*!< OCTAL : Octal (8 data + 1 clock)                                          */
  MSPI0_PADOUTEN_OUTEN_SERIAL          = 259,   /*!< SERIAL : Serial (2 data + 1 clock)                                        */
} MSPI0_PADOUTEN_OUTEN_Enum;

