AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* ====================================================  DEV0SCRAMBLING  ===================================================== */
/* ========================================================  DEV1AXI  ======================================================== */
/* ============================================  MSPI0 DEV1AXI READONLY1 [4..4]  ============================================= */
typedef enum {                                  /*!< MSPI0_DEV1AXI_READONLY1                                                   */
  MSPI0_DEV1AXI_READONLY1_READONLY     = 1,     /*!< READONLY : Indicates AXI aperture only supports read operations           */
  MSPI0_DEV1AXI_READONLY1_READWRITE    = 0,     /*!< READWRITE : Indicates AXI aperture supports read and write operations     */
} MSPI0_DEV1AXI_READONLY1_Enum;

/* ==============================================  MSPI0 DEV1AXI SIZE1 [0..3]  =============================================== */
typedef enum {                                  /*!< MSPI0_DEV1AXI_SIZE1                                                       */
  MSPI0_DEV1AXI_SIZE1_SIZE64K          = 0,     /*!< SIZE64K : 64KB Aperture                                                   */
  MSPI0_DEV1AXI_SIZE1_SIZE128K         = 1,     /*!< SIZE128K : 128KB Aperture                                                 */
  MSPI0_DEV1AXI_SIZE1_SIZE256K         = 2,     /*!< SIZE256K : 256KB Aperture                                                 */
  MSPI0_DEV1AXI_SIZE1_SIZE512K         = 3,     /*!< SIZE512K : 512KB Aperture                                                 */
  MSPI0_DEV1AXI_SIZE1_SIZE1M           = 4,     /*!< SIZE1M : 1MB Aperture                                                     */
  MSPI0_DEV1AXI_SIZE1_SIZE2M           = 5,     /*!< SIZE2M : 2MB Aperture                                                     */
  MSPI0_DEV1AXI_SIZE1_SIZE4M           = 6,     /*!< SIZE4M : 4MB Aperture                                                     */
  MSPI0_DEV1AXI_SIZE1_SIZE8M           = 7,     /*!< SIZE8M : 8MB Aperture                                                     */
  MSPI0_DEV1AXI_SIZE1_SIZE16M          = 8,     /*!< SIZE16M : 16MB Aperture                                                   */
  MSPI0_DEV1AXI_SIZE1_SIZE32M          = 9,     /*!< SIZE32M : 32MB Aperture                                                   */
  MSPI0_DEV1AXI_SIZE1_SIZE64M          = 10,    /*!< SIZE64M : 64MB Aperture                                                   */
} MSPI0_DEV1AXI_SIZE1_Enum;

/* ========================================================  DEV1CFG  ======================================================== */
/* =============================================  MSPI0 DEV1CFG TXNEG1 [24..24]  ============================================= */
typedef enum {                                  /*!< MSPI0_DEV1CFG_TXNEG1                                                      */
  MSPI0_DEV1CFG_TXNEG1_NORMAL          = 0,     /*!< NORMAL : TX launched from posedge internal clock                          */
  MSPI0_DEV1CFG_TXNEG1_NEGEDGE         = 1,     /*!< NEGEDGE : TX data launched from negedge of internal clock                 */
} MSPI0_DEV1CFG_TXNEG1_Enum;

/* =============================================  MSPI0 DEV1CFG RXNEG1 [23..23]  ============================================= */
typedef enum {                                  /*!< MSPI0_DEV1CFG_RXNEG1                                                      */
  MSPI0_DEV1CFG_RXNEG1_NORMAL          = 0,     /*!< NORMAL : RX data sampled on posedge of internal clock                     */
  MSPI0_DEV1CFG_RXNEG1_NEGEDGE         = 1,     /*!< NEGEDGE : RX data sampled on negedge of internal clock                    */
} MSPI0_DEV1CFG_RXNEG1_Enum;

/* =============================================  MSPI0 DEV1CFG RXCAP1 [22..22]  ============================================= */
typedef enum {                                  /*!< MSPI0_DEV1CFG_RXCAP1                                                      */
  MSPI0_DEV1CFG_RXCAP1_NORMAL          = 0,     /*!< NORMAL : RX Capture phase aligns with CPHA setting                        */
  MSPI0_DEV1CFG_RXCAP1_DELAY           = 1,     /*!< DELAY : RX Capture phase is delayed from CPHA setting by one
                                                     clock edge                                                                */
} MSPI0_DEV1CFG_RXCAP1_Enum;

/* ============================================  MSPI0 DEV1CFG CLKDIV1 [16..21]  ============================================= */
typedef enum {                                  /*!< MSPI0_DEV1CFG_CLKDIV1                                                     */
  MSPI0_DEV1CFG_CLKDIV1_CLK48          = 1,     /*!< CLK48 : 48 MHz MSPI clock                                                 */
  MSPI0_DEV1CFG_CLKDIV1_CLK24          = 2,     /*!< CLK24 : 24 MHz MSPI clock                                                 */
  MSPI0_DEV1CFG_CLKDIV1_CLK16          = 3,     /*!< CLK16 : 16 MHz MSPI clock                                                 */
  MSPI0_DEV1CFG_CLKDIV1_CLK12          = 4,     /*!< CLK12 : 12 MHz MSPI clock                                                 */
  MSPI0_DEV1CFG_CLKDIV1_CLK8           = 6,     /*!< CLK8 : 8 MHz MSPI clock                                                   */
  MSPI0_DEV1CFG_CLKDIV1_CLK6           = 8,     /*!< CLK6 : 6 MHz MSPI clock                                                   */
  MSPI0_DEV1CFG_CLKDIV1_CLK4           = 12,    /*!< CLK4 : 4 MHz MSPI clock                                                   */
  MSPI0_DEV1CFG_CLKDIV1_CLK3           = 16,    /*!< CLK3 : 3 MHz MSPI clock                                                   */
  MSPI0_DEV1CFG_CLKDIV1_CLK2           = 24,    /*!< CLK2 : 2 MHz MSPI clock                                                   */
  MSPI0_DEV1CFG_CLKDIV1_CLK1_5         = 32,    /*!< CLK1_5 : 1.5 MHz MSPI clock                                               */
} MSPI0_DEV1CFG_CLKDIV1_Enum;

