AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* =======================================================  EMONCFG3  ======================================================== */
/* ===========================================  PWRCTRL EMONCFG3 EMONSEL3 [0..7]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_EMONCFG3_EMONSEL3                                                 */
  PWRCTRL_EMONCFG3_EMONSEL3_NEVER      = 0,     /*!< NEVER : Never increment the counter                                       */
  PWRCTRL_EMONCFG3_EMONSEL3_ALWAYS     = 1,     /*!< ALWAYS : Always increment the counter                                     */
  PWRCTRL_EMONCFG3_EMONSEL3_MCUSLEEP   = 2,     /*!< MCUSLEEP : Increment the counter for MCU sleep mode                       */
  PWRCTRL_EMONCFG3_EMONSEL3_MCUDEEPSLEEP = 3,   /*!< MCUDEEPSLEEP : Increment the counter for MCU deepsleep mode               */
  PWRCTRL_EMONCFG3_EMONSEL3_DSP0ON     = 4,     /*!< DSP0ON : Increment the counter for DSP0 active mode                       */
  PWRCTRL_EMONCFG3_EMONSEL3_DSP1ON     = 5,     /*!< DSP1ON : Increment the counter for DSP1 active mode                       */
  PWRCTRL_EMONCFG3_EMONSEL3_ADCON      = 6,     /*!< ADCON : Increment the counter when ADC is powered on                      */
  PWRCTRL_EMONCFG3_EMONSEL3_AUDPBON    = 7,     /*!< AUDPBON : Increment the counter when AUDPB is powered on                  */
  PWRCTRL_EMONCFG3_EMONSEL3_AUDRECON   = 8,     /*!< AUDRECON : Increment the counter when AUDREC is powered on                */
  PWRCTRL_EMONCFG3_EMONSEL3_I2S0ON     = 9,     /*!< I2S0ON : Increment the counter when I2S0 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_I2S1ON     = 10,    /*!< I2S1ON : Increment the counter when I2S1 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_I2S2ON     = 11,    /*!< I2S2ON : Increment the counter when I2S2 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_I2S3ON     = 12,    /*!< I2S3ON : Increment the counter when I2S3 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_PDM0ON     = 13,    /*!< PDM0ON : Increment the counter when PDM0 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_PDM1ON     = 14,    /*!< PDM1ON : Increment the counter when PDM1 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_PDM2ON     = 15,    /*!< PDM2ON : Increment the counter when PDM2 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_PDM3ON     = 16,    /*!< PDM3ON : Increment the counter when PDM3 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_AUDADCON   = 17,    /*!< AUDADCON : Increment the counter when AUDADC is powered on                */
  PWRCTRL_EMONCFG3_EMONSEL3_CRYPTOON   = 18,    /*!< CRYPTOON : Increment the counter when CRYPTO is powered on                */
  PWRCTRL_EMONCFG3_EMONSEL3_DBGON      = 19,    /*!< DBGON : Increment the counter when DBG is powered on                      */
  PWRCTRL_EMONCFG3_EMONSEL3_DISPON     = 20,    /*!< DISPON : Increment the counter when DISP is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_DISPPHYON  = 21,    /*!< DISPPHYON : Increment the counter when DISPPHY is powered on              */
  PWRCTRL_EMONCFG3_EMONSEL3_DSPAON     = 22,    /*!< DSPAON : Increment the counter when DSPA is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_GFXON      = 23,    /*!< GFXON : Increment the counter when GFX is powered on                      */
  PWRCTRL_EMONCFG3_EMONSEL3_UART0ON    = 24,    /*!< UART0ON : Increment the counter when UART0 is powered on                  */
  PWRCTRL_EMONCFG3_EMONSEL3_UART1ON    = 25,    /*!< UART1ON : Increment the counter when UART1 is powered on                  */
  PWRCTRL_EMONCFG3_EMONSEL3_UART2ON    = 26,    /*!< UART2ON : Increment the counter when UART2 is powered on                  */
  PWRCTRL_EMONCFG3_EMONSEL3_UART3ON    = 27,    /*!< UART3ON : Increment the counter when UART3 is powered on                  */
  PWRCTRL_EMONCFG3_EMONSEL3_IOM0ON     = 28,    /*!< IOM0ON : Increment the counter when IOM0 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_IOM1ON     = 29,    /*!< IOM1ON : Increment the counter when IOM1 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_IOM2ON     = 30,    /*!< IOM2ON : Increment the counter when IOM2 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_IOM3ON     = 31,    /*!< IOM3ON : Increment the counter when IOM3 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_I3C0ON     = 32,    /*!< I3C0ON : Increment the counter when I3C0 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_I3C1ON     = 33,    /*!< I3C1ON : Increment the counter when I3C1 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_IOM4ON     = 34,    /*!< IOM4ON : Increment the counter when IOM4 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_IOM5ON     = 35,    /*!< IOM5ON : Increment the counter when IOM5 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_IOM6ON     = 36,    /*!< IOM6ON : Increment the counter when IOM6 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_IOM7ON     = 37,    /*!< IOM7ON : Increment the counter when IOM7 is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_IOSON      = 38,    /*!< IOSON : Increment the counter when IOS is powered on                      */
  PWRCTRL_EMONCFG3_EMONSEL3_MSPI0ON    = 39,    /*!< MSPI0ON : Increment the counter when MSPI0 is powered on                  */
  PWRCTRL_EMONCFG3_EMONSEL3_MSPI1ON    = 40,    /*!< MSPI1ON : Increment the counter when MSPI1 is powered on                  */
  PWRCTRL_EMONCFG3_EMONSEL3_MSPI2ON    = 41,    /*!< MSPI2ON : Increment the counter when MSPI2 is powered on                  */
  PWRCTRL_EMONCFG3_EMONSEL3_SDIOON     = 42,    /*!< SDIOON : Increment the counter when SDIO is powered on                    */
  PWRCTRL_EMONCFG3_EMONSEL3_USBON      = 43,    /*!< USBON : Increment the counter when USB is powered on                      */
  PWRCTRL_EMONCFG3_EMONSEL3_USBPHYON   = 44,    /*!< USBPHYON : Increment the counter when USBPHY is powered on                */
} PWRCTRL_EMONCFG3_EMONSEL3_Enum;

