AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo4.h
/* ========================================================  PATCTRL  ======================================================== */
/* ============================================  TIMER PATCTRL PATTMODE [24..25]  ============================================ */
typedef enum {                                  /*!< TIMER_PATCTRL_PATTMODE                                                    */
  TIMER_PATCTRL_PATTMODE_DIS           = 0,     /*!< DIS : Trigger not enabled                                                 */
  TIMER_PATCTRL_PATTMODE_RISE          = 1,     /*!< RISE : Trigger on rising edge of TRIGSEL source                           */
  TIMER_PATCTRL_PATTMODE_FALL          = 2,     /*!< FALL : Trigger on falling edge of TRIGSEL source                          */
  TIMER_PATCTRL_PATTMODE_BOTH          = 3,     /*!< BOTH : Trigger on either edge of TRIGSEL source                           */
} TIMER_PATCTRL_PATTMODE_Enum;

/* ===========================================  TIMER PATCTRL PATTRIGSEL [16..23]  =========================================== */
typedef enum {                                  /*!< TIMER_PATCTRL_PATTRIGSEL                                                  */
  TIMER_PATCTRL_PATTRIGSEL_TMR00       = 32,    /*!< TMR00 : Trigger source is TIMER 0 Output 0                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR01       = 33,    /*!< TMR01 : Trigger source is TIMER 0 Output 1                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR10       = 34,    /*!< TMR10 : Trigger source is TIMER 1 Output 0                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR11       = 35,    /*!< TMR11 : Trigger source is TIMER 1 Output 1                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR20       = 36,    /*!< TMR20 : Trigger source is TIMER 2 Output 0                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR21       = 37,    /*!< TMR21 : Trigger source is TIMER 2 Output 1                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR30       = 38,    /*!< TMR30 : Trigger source is TIMER 3 Output 0                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR31       = 39,    /*!< TMR31 : Trigger source is TIMER 3 Output 1                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR40       = 40,    /*!< TMR40 : Trigger source is TIMER 4 Output 0                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR41       = 41,    /*!< TMR41 : Trigger source is TIMER 4 Output 1                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR50       = 42,    /*!< TMR50 : Trigger source is TIMER 5 Output 0                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR51       = 43,    /*!< TMR51 : Trigger source is TIMER 5 Output 1                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR60       = 44,    /*!< TMR60 : Trigger source is TIMER 6 Output 0                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR61       = 45,    /*!< TMR61 : Trigger source is TIMER 6 Output 1                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR70       = 46,    /*!< TMR70 : Trigger source is TIMER 7 Output 0                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR71       = 47,    /*!< TMR71 : Trigger source is TIMER 7 Output 1                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR80       = 48,    /*!< TMR80 : Trigger source is TIMER 8 Output 0                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR81       = 49,    /*!< TMR81 : Trigger source is TIMER 8 Output 1                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR90       = 50,    /*!< TMR90 : Trigger source is TIMER 9 Output 0                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR91       = 51,    /*!< TMR91 : Trigger source is TIMER 9 Output 1                                */
  TIMER_PATCTRL_PATTRIGSEL_TMR100      = 52,    /*!< TMR100 : Trigger source is TIMER 10 Output 0                              */
  TIMER_PATCTRL_PATTRIGSEL_TMR101      = 53,    /*!< TMR101 : Trigger source is TIMER 10 Output 1                              */
  TIMER_PATCTRL_PATTRIGSEL_TMR110      = 54,    /*!< TMR110 : Trigger source is TIMER 11 Output 0                              */
  TIMER_PATCTRL_PATTRIGSEL_TMR111      = 55,    /*!< TMR111 : Trigger source is TIMER 11 Output 1                              */
  TIMER_PATCTRL_PATTRIGSEL_TMR120      = 56,    /*!< TMR120 : Trigger source is TIMER 12 Output 0                              */
  TIMER_PATCTRL_PATTRIGSEL_TMR121      = 57,    /*!< TMR121 : Trigger source is TIMER 12 Output 1                              */
  TIMER_PATCTRL_PATTRIGSEL_TMR130      = 58,    /*!< TMR130 : Trigger source is TIMER 13 Output 0                              */
  TIMER_PATCTRL_PATTRIGSEL_TMR131      = 59,    /*!< TMR131 : Trigger source is TIMER 13 Output 1                              */
  TIMER_PATCTRL_PATTRIGSEL_TMR140      = 60,    /*!< TMR140 : Trigger source is TIMER 14 Output 0                              */
  TIMER_PATCTRL_PATTRIGSEL_TMR141      = 61,    /*!< TMR141 : Trigger source is TIMER 14 Output 1                              */
  TIMER_PATCTRL_PATTRIGSEL_TMR150      = 62,    /*!< TMR150 : Trigger source is TIMER 15 Output 0                              */
  TIMER_PATCTRL_PATTRIGSEL_TMR151      = 63,    /*!< TMR151 : Trigger source is TIMER 15 Output 1                              */
  TIMER_PATCTRL_PATTRIGSEL_GPIO0       = 128,   /*!< GPIO0 : Trigger source is GPIO #0                                         */
  TIMER_PATCTRL_PATTRIGSEL_GPIO63      = 191,   /*!< GPIO63 : Trigger source is GPIO #63                                       */
  TIMER_PATCTRL_PATTRIGSEL_GPIO95      = 223,   /*!< GPIO95 : Trigger source is GPIO #95                                       */
  TIMER_PATCTRL_PATTRIGSEL_GPIO127     = 255,   /*!< GPIO127 : Trigger source is GPIO #127                                     */
} TIMER_PATCTRL_PATTRIGSEL_Enum;

/* =============================================  TIMER PATCTRL PATCLK [8..15]  ============================================== */
typedef enum {                                  /*!< TIMER_PATCTRL_PATCLK                                                      */
  TIMER_PATCTRL_PATCLK_HFRC_DIV4       = 0,     /*!< HFRC_DIV4 : Clock source is the HFRC / 4                                  */
  TIMER_PATCTRL_PATCLK_HFRC_DIV16      = 1,     /*!< HFRC_DIV16 : Clock source is HFRC / 16                                    */
  TIMER_PATCTRL_PATCLK_HFRC_DIV64      = 2,     /*!< HFRC_DIV64 : Clock source is HFRC / 64                                    */
  TIMER_PATCTRL_PATCLK_HFRC_DIV256     = 3,     /*!< HFRC_DIV256 : Clock source is HFRC / 256                                  */
  TIMER_PATCTRL_PATCLK_HFRC_DIV1024    = 4,     /*!< HFRC_DIV1024 : Clock source is HFRC / 1024                                */
  TIMER_PATCTRL_PATCLK_HFRC_DIV4K      = 5,     /*!< HFRC_DIV4K : Clock source is HFRC / 4096                                  */
  TIMER_PATCTRL_PATCLK_LFRC            = 6,     /*!< LFRC : Clock source is LFRC                                               */
  TIMER_PATCTRL_PATCLK_LFRC_DIV2       = 7,     /*!< LFRC_DIV2 : Clock source is LFRC / 2                                      */
  TIMER_PATCTRL_PATCLK_LFRC_DIV32      = 8,     /*!< LFRC_DIV32 : Clock source is LFRC / 32                                    */
  TIMER_PATCTRL_PATCLK_LFRC_DIV1K      = 9,     /*!< LFRC_DIV1K : Clock source is LFRC / 1024                                  */
  TIMER_PATCTRL_PATCLK_XT              = 10,    /*!< XT : Clock source is the XT (uncalibrated).                               */
  TIMER_PATCTRL_PATCLK_XT_DIV2         = 11,    /*!< XT_DIV2 : Clock source is XT / 2                                          */
  TIMER_PATCTRL_PATCLK_XT_DIV4         = 12,    /*!< XT_DIV4 : Clock source is XT / 4                                          */
  TIMER_PATCTRL_PATCLK_XT_DIV8         = 13,    /*!< XT_DIV8 : Clock source is XT / 8                                          */
  TIMER_PATCTRL_PATCLK_XT_DIV16        = 14,    /*!< XT_DIV16 : Clock source is XT / 16                                        */
  TIMER_PATCTRL_PATCLK_XT_DIV32        = 15,    /*!< XT_DIV32 : Clock source is XT / 32                                        */
  TIMER_PATCTRL_PATCLK_XT_DIV128       = 16,    /*!< XT_DIV128 : Clock source is XT / 128                                      */
  TIMER_PATCTRL_PATCLK_RTC_100HZ       = 17,    /*!< RTC_100HZ : Clock source is 100 Hz from the current RTC oscillator.       */
  TIMER_PATCTRL_PATCLK_HCLK_DIV4       = 18,    /*!< HCLK_DIV4 : Clock source is HCLK / 4.                                     */
  TIMER_PATCTRL_PATCLK_BUCKC           = 28,    /*!< BUCKC : Clock source is Buck VDDC TON pulses.                             */
  TIMER_PATCTRL_PATCLK_BUCKF           = 29,    /*!< BUCKF : Clock source is Buck VDDF TON pulses.                             */
  TIMER_PATCTRL_PATCLK_BUCKS           = 30,    /*!< BUCKS : Clock source is Buck VDDS TON pulses.                             */
  TIMER_PATCTRL_PATCLK_BUCKCLV         = 31,    /*!< BUCKCLV : Clock source is Buck VDDC_LV TON pulses.                        */
  TIMER_PATCTRL_PATCLK_TMR00           = 32,    /*!< TMR00 : Clock source is TIMER 0 Output 0                                  */
  TIMER_PATCTRL_PATCLK_TMR01           = 33,    /*!< TMR01 : Clock source is TIMER 0 Output 1                                  */
  TIMER_PATCTRL_PATCLK_TMR10           = 34,    /*!< TMR10 : Clock source is TIMER 1 Output 0                                  */
  TIMER_PATCTRL_PATCLK_TMR11           = 35,    /*!< TMR11 : Clock source is TIMER 1 Output 1                                  */
  TIMER_PATCTRL_PATCLK_TMR20           = 36,    /*!< TMR20 : Clock source is TIMER 2 Output 0                                  */
  TIMER_PATCTRL_PATCLK_TMR21           = 37,    /*!< TMR21 : Clock source is TIMER 2 Output 1                                  */
  TIMER_PATCTRL_PATCLK_TMR30           = 38,    /*!< TMR30 : Clock source is TIMER 3 Output 0                                  */
  TIMER_PATCTRL_PATCLK_TMR31           = 39,    /*!< TMR31 : Clock source is TIMER 3 Output 1                                  */
  TIMER_PATCTRL_PATCLK_TMR40           = 40,    /*!< TMR40 : Clock source is TIMER 4 Output 0                                  */
  TIMER_PATCTRL_PATCLK_TMR41           = 41,    /*!< TMR41 : Clock source is TIMER 4 Output 1                                  */
  TIMER_PATCTRL_PATCLK_TMR50           = 42,    /*!< TMR50 : Clock source is TIMER 5 Output 0                                  */
  TIMER_PATCTRL_PATCLK_TMR51           = 43,    /*!< TMR51 : Clock source is TIMER 5 Output 1                                  */
  TIMER_PATCTRL_PATCLK_TMR60           = 44,    /*!< TMR60 : Clock source is TIMER 6 Output 0                                  */
  TIMER_PATCTRL_PATCLK_TMR61           = 45,    /*!< TMR61 : Clock source is TIMER 6 Output 1                                  */
  TIMER_PATCTRL_PATCLK_TMR70           = 46,    /*!< TMR70 : Clock source is TIMER 7 Output 0                                  */
  TIMER_PATCTRL_PATCLK_TMR71           = 47,    /*!< TMR71 : Clock source is TIMER 7 Output 1                                  */
  TIMER_PATCTRL_PATCLK_TMR80           = 48,    /*!< TMR80 : Clock source is TIMER 8 Output 0                                  */
  TIMER_PATCTRL_PATCLK_TMR81           = 49,    /*!< TMR81 : Clock source is TIMER 8 Output 1                                  */
  TIMER_PATCTRL_PATCLK_TMR90           = 50,    /*!< TMR90 : Clock source is TIMER 9 Output 0                                  */
  TIMER_PATCTRL_PATCLK_TMR91           = 51,    /*!< TMR91 : Clock source is TIMER 9 Output 1                                  */
  TIMER_PATCTRL_PATCLK_TMR100          = 52,    /*!< TMR100 : Clock source is TIMER 10 Output 0                                */
  TIMER_PATCTRL_PATCLK_TMR101          = 53,    /*!< TMR101 : Clock source is TIMER 10 Output 1                                */
  TIMER_PATCTRL_PATCLK_TMR110          = 54,    /*!< TMR110 : Clock source is TIMER 11 Output 0                                */
  TIMER_PATCTRL_PATCLK_TMR111          = 55,    /*!< TMR111 : Clock source is TIMER 11 Output 1                                */
  TIMER_PATCTRL_PATCLK_TMR120          = 56,    /*!< TMR120 : Clock source is TIMER 12 Output 0                                */
  TIMER_PATCTRL_PATCLK_TMR121          = 57,    /*!< TMR121 : Clock source is TIMER 12 Output 1                                */
  TIMER_PATCTRL_PATCLK_TMR130          = 58,    /*!< TMR130 : Clock source is TIMER 13 Output 0                                */
  TIMER_PATCTRL_PATCLK_TMR131          = 59,    /*!< TMR131 : Clock source is TIMER 13 Output 1                                */
  TIMER_PATCTRL_PATCLK_TMR140          = 60,    /*!< TMR140 : Clock source is TIMER 14 Output 0                                */
  TIMER_PATCTRL_PATCLK_TMR141          = 61,    /*!< TMR141 : Clock source is TIMER 14 Output 1                                */
  TIMER_PATCTRL_PATCLK_TMR150          = 62,    /*!< TMR150 : Clock source is TIMER 15 Output 0                                */
  TIMER_PATCTRL_PATCLK_TMR151          = 63,    /*!< TMR151 : Clock source is TIMER 15 Output 1                                */
  TIMER_PATCTRL_PATCLK_GPIO0           = 128,   /*!< GPIO0 : GPIO #0 is clock source                                           */
  TIMER_PATCTRL_PATCLK_GPIO127         = 255,   /*!< GPIO127 : GPIO #127 is clock source                                       */
} TIMER_PATCTRL_PATCLK_Enum;

/* =============================================  TIMER PATCTRL PATMODE [4..7]  ============================================== */
typedef enum {                                  /*!< TIMER_PATCTRL_PATMODE                                                     */
  TIMER_PATCTRL_PATMODE_SINGLE         = 0,     /*!< SINGLE : Single channel configuration. 32 samples per word (0,
                                                     1, 2...)                                                                  */
  TIMER_PATCTRL_PATMODE_DUAL           = 1,     /*!< DUAL : Dual channel configuration. 16 samples per word (01,
                                                     23, 45, ...)                                                              */
  TIMER_PATCTRL_PATMODE_QUAD           = 2,     /*!< QUAD : Quad channel configuration. 8 samples per word (0123,
                                                     4567, 89AB, ...)                                                          */
  TIMER_PATCTRL_PATMODE_OCTAL          = 3,     /*!< OCTAL : Octal (8-bit) channel configuration. 4 samples per word
                                                     (byte 0, 1, 2, 3)                                                         */
  TIMER_PATCTRL_PATMODE_PWM            = 4,     /*!< PWM : Octal (8-bit) channel configuration with timing count.
                                                     2 samples per word. [15:8]=count [7:0]=pattern                            */
} TIMER_PATCTRL_PATMODE_Enum;

/* ==============================================  TIMER PATCTRL PATEN [0..0]  =============================================== */
typedef enum {                                  /*!< TIMER_PATCTRL_PATEN                                                       */
  TIMER_PATCTRL_PATEN_EN               = 1,     /*!< EN : Pattern Generator Enabled.                                           */
  TIMER_PATCTRL_PATEN_DIS              = 0,     /*!< DIS : Pattern Generator Disabled                                          */
} TIMER_PATCTRL_PATEN_Enum;

